#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	
	ПрочитатьТипОбъекта();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	Если ЭтоНоменклатура Тогда 
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", Запись.Упаковка);

		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Номенклатура", Запись.Объект);
		СтруктураСтроки.Вставить("Упаковка", Запись.Упаковка);
	
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтруктураСтроки, СтруктураДействий, КэшированныеЗначения);

		ЗаполнитьЗначенияСвойств(Запись, СтруктураСтроки);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьТипОбъекта()
	
	УказыватьКоличество = Ложь;
	ЭтоНоменклатура = Ложь;
	
	Если ЗначениеЗаполнено(Запись.ТипОбъекта) Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.ТипОбъекта, "УказыватьКоличество, ТипЗначения");
		УказыватьКоличество = Реквизиты.УказыватьКоличество;
		ЭтоНоменклатура = Реквизиты.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Номенклатура"));
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
		
	Форма.Элементы.ГруппаКоличество.Видимость = Форма.УказыватьКоличество;
	Форма.Элементы.Упаковка.Видимость = Форма.ЭтоНоменклатура;
	
	Форма.Элементы.Объект.ТолькоПросмотр = Форма.Запись.НеВлияетНаУчетТМЦ;
	Форма.Элементы.Количество.ТолькоПросмотр = Форма.Запись.НеВлияетНаУчетТМЦ;
	Форма.Элементы.Упаковка.ТолькоПросмотр = Форма.Запись.НеВлияетНаУчетТМЦ;
	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ПрочитатьТипОбъекта();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры	

&НаКлиенте
Процедура НоменклатураАлкогольПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти
