#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Получение актуальной рецептуры, отличной от данной, но с той же датой начала действия.
// Процедура используется в обработке загрузки рецептур, и при записи редактируемой процедуры.
//
// Параметры:
//	НаДату - Дата, дата начала действия рецептуры
//	ШагДат - Число, шаг смещения новой даты.
//	МаксимальнаяЗаДень - Булево, необходимость раместить новую дату последней за день,
//						необходимо при загрузке основных рецептур из Рецептурника.
//
// Возвращаемое значение:
//	Неопределено или Дата, новая свободная дата для актуальной рецептуры
//
Функция ПолучитьДругуюАктуальнуюРецептуру(Знач Объект, Знач НаДату, Знач ШагДат=+1, Знач МаксимальнаяЗаДень=Ложь) Экспорт
	
	Результат = Неопределено;
	// Если не указан ХозяйственнаяОперация, значит ничего не ищем
	Если НЕ ЗначениеЗаполнено(Объект.ХозяйственнаяОперация) Тогда
		Возврат Результат;
	КонецЕсли;
	// Если НаДату не указана, то нечего искать
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос=Новый Запрос();
	
	// Сформируем текст запроса.
	// Первый запрос определяет, есть ли другая рецептура с той же датой.
	// Вложенный запрос собирает все рецептуры за этот день, чтобы потом определить максимальную дату.
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РецептурыЗаДень.Ссылка,
	|	РецептурыЗаДень.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Документ.питРецептура КАК Рецептура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Рецептура.Ссылка КАК Ссылка,
	|			Рецептура.ДатаНачала КАК ДатаНачала
	|		ИЗ
	|			Документ.питРецептура КАК Рецептура
	|		ГДЕ
	|			Рецептура.Ссылка <> &Ссылка
	|			И Рецептура.Номенклатура = &Номенклатура
	|			И Рецептура.Характеристика = &Характеристика
	|			И НАЧАЛОПЕРИОДА(Рецептура.ДатаНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаОбъекта, ДЕНЬ)
	|			И Рецептура.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|			И (НЕ Рецептура.ПометкаУдаления)) КАК РецептурыЗаДень
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Рецептура.Ссылка <> &Ссылка
	|	И Рецептура.Номенклатура = &Номенклатура
	|	И Рецептура.Характеристика = &Характеристика
	|	И Рецептура.ДатаНачала = &ДатаОбъекта
	|	И Рецептура.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И (НЕ Рецептура.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала УБЫВ";
	
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Объект.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Объект.Характеристика);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",Объект.ХозяйственнаяОперация);
	Если НаДату <> Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаОбъекта", НаДату);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
		// Определим доступную дату начала.
		НоваяДатаНачала = НаДату;
		МассивДат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ДатаНачала");
		Если ТипЗнч(ШагДат) <> Тип("Число") ИЛИ ШагДат=0 ИЛИ ШагДат>4000 ИЛИ ШагДат<-4000 Тогда
			ШагДат = +1;
		ИначеЕсли ШагДат<-4000 Тогда
			ШагДат = -2;
		КонецЕсли;
		Если МаксимальнаяЗаДень = Истина Тогда
			НоваяДатаНачала = МассивДат[0]+?(ШагДат>0,ШагДат,-ШагДат);
		Иначе
			Для СчетчикВыхода = 1 По 1000 Цикл
				НоваяДатаНачала = НоваяДатаНачала + ШагДат;
				Если МассивДат.Найти(НоваяДатаНачала) = Неопределено Тогда
					// Дата свободна, выходим
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Возврат НоваяДатаНачала;
		
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаДокумента"
		И ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	ХозяйственнаяОперация = Неопределено; 
	
	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ХозяйственнаяОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "ХозяйственнаяОперация");
	КонецЕсли;
	
	// Если документ копируется, то вид формы получаем из копируемого документа.
	Если НЕ ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		Если Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ХозяйственнаяОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Параметры.ЗначениеКопирования, "ХозяйственнаяОперация");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		Если Параметры.Свойство("ЗначенияЗаполнения") 
			И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
			Если Параметры.ЗначенияЗаполнения.Свойство("ХозяйственнаяОперация") Тогда
				ХозяйственнаяОперация = Параметры.ЗначенияЗаполнения.ХозяйственнаяОперация;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		Если Параметры.Свойство("Основание")
			И ЗначениеЗаполнено(Параметры.Основание) Тогда
			ХозяйственнаяОперация = ОпределитьВидОперацииПоДокументуОснованию(Параметры.Основание);
		КонецЕсли;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ФормыПоступлениеТоваровУслуг = ПолучитьСоответствиеВидовОперацийФормам();
	ВыбраннаяФорма = ФормыПоступлениеТоваровУслуг[ХозяйственнаяОперация];
	Если ВыбраннаяФорма = Неопределено Тогда
		ВыбраннаяФорма = "ФормаДокумента";
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ОпределитьВидОперацииПоДокументуОснованию(Основание) Экспорт
	
	Результат = Перечисления.питХозяйственныеОперации.РецептураПриготовление;
	
	Если ЗначениеЗаполнено(Основание)
		И ТипЗнч(Основание) = Тип("ДокументСсылка.питАктПроработки") Тогда
		
		Результат = Перечисления.питХозяйственныеОперации.РецептураПриготовление;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеВидовОперацийФормам() Экспорт
	
	ФормыДокумента = Новый Соответствие;
	ФормыДокумента.Вставить(Перечисления.питХозяйственныеОперации.РецептураПриготовление,        "ФормаДокументаОбщая");
	ФормыДокумента.Вставить(Перечисления.питХозяйственныеОперации.РецептураРазделка,             "ФормаДокументаОбщая");
	ФормыДокумента.Вставить(Перечисления.питХозяйственныеОперации.РецептураРазукомплектацияБлюд, "ФормаДокументаОбщая");
	//ФормыДокумента.Вставить(Перечисления.питХозяйственныеОперации.РецептураРазделка,             "ФормаДокументаРазделка");
	//ФормыДокумента.Вставить(Перечисления.питХозяйственныеОперации.РецептураРазукомплектацияБлюд, "ФормаДокументаРазукомплектация");
	
	Возврат ФормыДокумента;
	
КонецФункции

// Функция формирует строку с наименованием номенклатуры по переданным парметрам.
//
// Параметры:
//  Номенклатура	 - СправочникСсылка.Номенклатура - Ссылка на номенклатуру.
//  Характеристика	 - СправочникСсылка.ХарактеристикиНоменклатуры - Ссылка на характеристику номенклатуры.
//  ДатаДействияС	 - Дата - Дата начала действия рецептуры.
//  ДатаДействияПо	 - Дата - Дата окончания действия рецептуры.
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьНаименованиеРецептуры(Номенклатура, Характеристика = Неопределено, ДатаДействияС = Неопределено, ДатаДействияПо = Неопределено) Экспорт
	
	Если Характеристика = Неопределено Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Если ДатаДействияС = Неопределено Тогда
		ДатаДействияС = Дата("00010101");
	КонецЕсли;
	
	Если ДатаДействияПо = Неопределено Тогда
		ДатаДействияПо = Дата("00010101");
	КонецЕсли;
	
	
	Возврат Строка(Номенклатура) 
		+ ?(ЗначениеЗаполнено(Характеристика), ";", "") + Строка(Характеристика) 
		+ ?(ЗначениеЗаполнено(ДатаДействияС), " (с " + Формат(ДатаДействияС, "ДФ='dd.MM.yyyy HH:mm'") + ?(ЗначениеЗаполнено(ДатаДействияПо), " по " + Формат(ДатаДействияПо, "ДФ='dd.MM.yyyy HH:mm'"), "") + ")", "");
	
КонецФункции

// Функция проверяет на дубли табличные части документа.
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.питРецептура, ДанныеФормыСтруктура - Объект документа.
// 
// Возвращаемое значение:
//  Булево - Результат работы функции.
//
&НаСервере
Функция ПроверитьНаДубли(ДокументОбъект) Экспорт
	
	//+ПараметризацияРецептур
	Возврат Истина;
	//-ПараметризацияРецептур
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДанныеФормыСтруктура") Тогда
		Документ = ДанныеФормыВЗначение(ДокументОбъект, Тип("ДокументОбъект.питРецептура")); // Преобразования данных формы в объект
		УстановитьСоответствиеОбъектаИРеквизитаФормы(Документ, "Объект"); // Установка соответствия
	Иначе
		Документ = ДокументОбъект;
	КонецЕсли;
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питРецептураИнгредиенты.НомерСтроки,
	|	питРецептураИнгредиенты.Номенклатура,
	|	питРецептураИнгредиенты.Характеристика,
	|	питРецептураИнгредиенты.Упаковка
	|ПОМЕСТИТЬ втИнгредиенты
	|ИЗ
	|	&втИнгредиенты КАК питРецептураИнгредиенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРецептураИнгредиенты.Номенклатура,
	|	питРецептураИнгредиенты.Характеристика,
	|	питРецептураИнгредиенты.Упаковка,
	|	МИНИМУМ(питРецептураИнгредиенты.НомерСтроки) КАК НомерСтроки,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ втРезультат
	|ИЗ
	|	втИнгредиенты КАК питРецептураИнгредиенты
	|
	|СГРУППИРОВАТЬ ПО
	|	питРецептураИнгредиенты.Номенклатура,
	|	питРецептураИнгредиенты.Характеристика,
	|	питРецептураИнгредиенты.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультат.Номенклатура,
	|	втРезультат.Характеристика,
	|	втРезультат.Упаковка,
	|	втРезультат.НомерСтроки,
	|	втРезультат.Количество
	|ИЗ
	|	втРезультат КАК втРезультат
	|ГДЕ
	|	втРезультат.Количество > 1";
	
	Запрос.УстановитьПараметр("втИнгредиенты", ДокументОбъект.Ингредиенты.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Результат = Ложь;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дубли в строке <"+ВыборкаДетальныеЗаписи.НомерСтроки+"> по реквизитам Номенклатура, Характеристика, Единица измерения!";
			Сообщение.УстановитьДанные(Документ);
			Сообщение.Поле = "Ингредиенты[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Номенклатура";
			Сообщение.Сообщить();
			Возврат Результат;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Печать

// Формирует печатную форму "ОП-1"
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОП1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати=Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("СтруктураПараметровОП1") Тогда
		СтруктураПараметров = ПараметрыПечати.СтруктураПараметровОП1;
	//АдагамовАР., НЭП, 14.07.2024. ORIP-1425. ++	
	ИначеЕсли ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("НЭП_СтруктураПараметровОП1") Тогда
		СтруктураПараметров = ПараметрыПечати.НЭП_СтруктураПараметровОП1;		
	//АдагамовАР., НЭП, 14.07.2024. ORIP-1425. --	
	Иначе
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("РецептурнаяЕдиница", Истина);
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Рецептура_ОП1";
	
	МассивРецептуры = Новый Массив; // для исключения дублирования блюд
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выведем калькуляцию
		////ОбщептЕРП!!!
		питОтчеты.ВывестиКалькуляцию(ТабличныйДокумент, ДокументСсылка, ДокументСсылка, , СтруктураПараметров);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьОП1()

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы.
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыТехКарта()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	питРецептура.Ссылка КАК Ссылка,
	|	питРецептура.Номер КАК Номер,
	|	питРецептура.Дата КАК Дата,
	|	питРецептура.Организация,
	|	питРецептура.Ответственный,
	|	питРецептура.Номенклатура,
	|	питРецептура.Характеристика,
	|	питРецептура.КоличествоУпаковок КАК Количество,
	|	питРецептура.Упаковка,
	|	питРецептура.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	питРецептура.Выход,
	|	питРецептура.НомерРецептуры,
	|	питРецептура.ТехнологияПриготовления,
	|	ДокументОснованиеРецептуры.Ссылка КАК ДокументОснование,
	|	ДокументОснованиеРецептуры.Номер КАК ДокументОснованиеНомер,
	|	ДокументОснованиеРецептуры.Дата КАК ДокументОснованиеДата,
	|	1 КАК ID,
	|	питРецептура.Ингредиенты.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура,
	|		Характеристика,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Упаковка.Представление КАК ЕдиницаИзмерения,
	|		Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдиницаХранения,
	|		КоличествоУпаковокБрутто КАК КоличествоУпаковок,
	|		КоличествоУпаковокНетто КАК КоличествоУпаковокНетто,
	|		КоличествоУпаковокВыход КАК КоличествоУпаковокВыход,
	|		КлючСвязи КАК КлючСвязи,
	|		ПроцентПотерьПриХолоднойОбработке КАК ПроцентОтходовХолоднойОбработки,
	|		ПроцентПотерьПриГорячейОбработке КАК ПроцентОтходовТепловойОбработки,
	//<< Портал-Юг, Свинцов И.И., 2019.10.03 [9.07. Пересчет весовых показателей в печатных формах рецептур] 
	// Рассчитываем коэф пересчета (только для документов "Рецептура") и выводим единицу измерения веса
	// Если товар не весовой коэф = 0
	|		ВЫБОР
	|			КОГДА НЕ питРецептура.Ингредиенты.Номенклатура.ВесИспользовать
	|				ТОГДА 0
	//<<Портал-Юг, Каунов, 2019.11.26
	|			КОГДА питРецептура.Ингредиенты.КоличествоУпаковокВыход = 0
	|				ТОГДА 0
	//>>Портал-Юг, Каунов, 2019.11.26	
	|			ИНАЧЕ питРецептура.Ингредиенты.КоличествоВыход * питРецептура.Ингредиенты.Номенклатура.ВесЧислитель / ВЫБОР
	|					КОГДА питРецептура.Ингредиенты.Номенклатура.ВесЗнаменатель = 0
	|						ТОГДА 1
	|					ИНАЧЕ питРецептура.Ингредиенты.Номенклатура.ВесЗнаменатель
	|				КОНЕЦ / питРецептура.Ингредиенты.КоличествоУпаковокВыход
	|		КОНЕЦ КАК Коэф ,
	|	Номенклатура.ВесЕдиницаИзмерения.Представление КАК ВесЕдиницаИзмерения,
	//>> Портал-Юг, Свинцов И.И., 2019.10.03
	//+АвтовыборНоменклатуры
	|		Рецептура КАК Рецептура,
	|		СпособАвтовыбораНоменклатуры КАК СпособАвтовыбораНоменклатуры,
	|		СпособАвтовыбораХарактеристики КАК СпособАвтовыбораХарактеристики,
	|		СвойствоСодержащееНоменклатуру КАК СвойствоСодержащееНоменклатуру,
	|		АлгоритмАвтовыбораХарактеристики КАК АлгоритмАвтовыбораХарактеристики,
	|		Номенклатура.питВидНоменклатуры КАК НоменклатурапитВидНоменклатуры
	//-АвтовыборНоменклатуры
	|	) КАК Ингредиенты
	|ИЗ
	|	Документ.питРецептура КАК питРецептура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питАктПроработки КАК ДокументОснованиеРецептуры
	|		ПО (ДокументОснованиеРецептуры.Ссылка = питРецептура.ДокументОснование)
	|ГДЕ
	|	питРецептура.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	питАктПроработки.Ссылка,
	|	питАктПроработки.Номер,
	|	питАктПроработки.Дата,
	|	питАктПроработки.Организация,
	|	питАктПроработки.Ответственный,
	|	питАктПроработки.Номенклатура,
	|	питАктПроработки.Характеристика,
	|	питАктПроработки.КоличествоУпаковок КАК Количество,
	|	питАктПроработки.Упаковка,
	|	питАктПроработки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	питАктПроработки.Выход,
	|	питАктПроработки.НомерРецептуры,
	|	питАктПроработки.ТехнологияПриготовления,
	|	NULL,
	|	NULL,
	|	NULL,
	|	2,
	|	питАктПроработки.Ингредиенты.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Характеристика,
	|		Номенклатура.НаименованиеПолное,
	|		Упаковка.Представление,
	|		Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|		ВЫРАЗИТЬ((КоличествоУпаковокБрутто + КоличествоУпаковокБрутто1 + КоличествоУпаковокБрутто2) / 3 КАК ЧИСЛО(15,3)),
	|		ВЫРАЗИТЬ((КоличествоУпаковокНетто + КоличествоУпаковокНетто1 + КоличествоУпаковокНетто2) / 3 КАК ЧИСЛО(15,3)),
	|		ВЫРАЗИТЬ((КоличествоУпаковокВыход + КоличествоУпаковокВыход1 + КоличествоУпаковокВыход2) / 3 КАК ЧИСЛО(15,3)),
	|		"""" КАК КлючСвязи,
	|		0,
	|		0,
	//<< Портал-Юг, Свинцов И.И., 2019.10.03 [9.07. Пересчет весовых показателей в печатных формах рецептур] 
	|		1,
	|		Номенклатура.ЕдиницаИзмерения.Представление,
	//>> Портал-Юг, Свинцов И.И., 2019.10.03
	//+АвтовыборНоменклатуры
	|		ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка) КАК Рецептура,
	|		ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ) КАК СпособАвтовыбораНоменклатуры,
	|		ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ) КАК СпособАвтовыбораХарактеристики,
	|		"""" КАК СвойствоСодержащееНоменклатуру,
	|		"""" КАК АлгоритмАвтовыбораХарактеристики,
	|		Номенклатура.питВидНоменклатуры КАК НоменклатурапитВидНоменклатуры
	//-АвтовыборНоменклатуры
	|	)
	|ИЗ
	|	Документ.питАктПроработки КАК питАктПроработки
	|ГДЕ
	|	питАктПроработки.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка,
	|	ID,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция формирует табличный документ с печатной формой "Технологическая карта".
//
// Возвращаемое значение:
//  Табличный документ - печатная форма акта проработки.
//
Функция ПечатьТехКарта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РассчитываемоеКоличество = Неопределено;
	КоэффициентПересчета = 1;
	НеИспользоватьСезонныеПроценты = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питНеИспользоватьСезонныеПроценты");
	ДатаФормирования = ТекущаяДата();
	
	//+ПараметризацияРецептур
	питПодразделениеПроизводства = Неопределено;
	//-ПараметризацияРецептур
	
	//+АвтовыборНоменклатуры
	УточненияАвтовыбора = Неопределено;
	//-АвтовыборНоменклатуры
	
	РазворачиватьДоИнгредиентов = Ложь;
	
	Если ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("СтруктураПараметровТехКарта") Тогда
		СтруктураПараметров = ПараметрыПечати.СтруктураПараметровТехКарта;
		Если СтруктураПараметров.Свойство("РассчитываемоеКоличество") Тогда
			РассчитываемоеКоличество = СтруктураПараметров.РассчитываемоеКоличество;
		КонецЕсли;
		Если СтруктураПараметров.Свойство("НеИспользоватьСезонныеПроценты") Тогда
			НеИспользоватьСезонныеПроценты = СтруктураПараметров.НеИспользоватьСезонныеПроценты;
		КонецЕсли;
		Если СтруктураПараметров.Свойство("ДатаФормирования") Тогда
			ДатаФормирования = СтруктураПараметров.ДатаФормирования;
		КонецЕсли;
		Если СтруктураПараметров.Свойство("РазворачиватьДоИнгредиентов") Тогда
			РазворачиватьДоИнгредиентов = СтруктураПараметров.РазворачиватьДоИнгредиентов;
		КонецЕсли;
		//+ПараметризацияРецептур
		Если СтруктураПараметров.Свойство("питПодразделениеПроизводства") Тогда
			питПодразделениеПроизводства = СтруктураПараметров.питПодразделениеПроизводства;
		КонецЕсли;
		//-ПараметризацияРецептур
		//+АвтовыборНоменклатуры
		Если СтруктураПараметров.Свойство("УточненияАвтовыбора") Тогда
			УточненияАвтовыбора = ПолучитьИзВременногоХранилища(СтруктураПараметров.УточненияАвтовыбора);
		КонецЕсли;
		//-АвтовыборНоменклатуры
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Рецептура_ТехКарта";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_питТехнологическаяКарта");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыТехКарта();
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	// Служебная структура, хранящая кэшированные значения, уменбшает общее число запросов 
	//  к базе во время заполнения дерева состава, вычисления сезонных процентов и т.д.
	КэшЗаполненияДерева = питПроизводство.ИнициализироватьСтруктуруКэшированныхЗначенийДляЗаполненияДереваСостава();
	
	Пока Шапка.Следующий() Цикл
		
		//+АвтовыборНоменклатуры
		Если УточненияАвтовыбора = Неопределено И ТипЗнч(Шапка.Ссылка) = Тип("ДокументСсылка.питРецептура") Тогда
			УточненияАвтовыбора = питУправлениеДаннымиОбИзделиях.ПолучитьТаблицуУточненийАвтовыбораПоДокументу(Шапка.Ссылка);
		КонецЕсли;
		//-АвтовыборНоменклатуры
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если РассчитываемоеКоличество<>Неопределено И Шапка.Количество<>0 Тогда
			КоэффициентПересчета = РассчитываемоеКоличество / Шапка.Количество;
		Иначе
			КоэффициентПересчета = 1;
		КонецЕсли;
		
		// Выводим шапку накладной
		
		ЕдиницаШапкиДляВывода = ?(ЗначениеЗаполнено(Шапка.Упаковка),Шапка.Упаковка, Шапка.ЕдиницаХранения);
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.Заполнить(Шапка);
		ОбластьЗаголовок.Параметры.Номенклатура = СокрЛП(Шапка.Номенклатура.НаименованиеПолное)+ "" + ?(ЗначениеЗаполнено(Шапка.Характеристика)," / " + СокрЛП(Шапка.Характеристика.НаименованиеПолное),"") + ", "+Строка(Окр(Шапка.Количество*КоэффициентПересчета,3))+" " + ЕдиницаШапкиДляВывода;
		СведенияОбОрганизации    = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, ДатаФормирования);
		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		ОбластьЗаголовок.Параметры.Организация = ПредставлениеОрганизации;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Шапка таблицы
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьШапка.Параметры.КолвоПорций = " 1 " + ЕдиницаШапкиДляВывода;
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Вывести табличную часть
		ВыборкаСтрокТовары = Шапка.Ингредиенты.Выбрать();
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		ИтогоВыход = 0;
		
		ИспользуетсяДеревоСостава = Ложь;
		Если ТипЗнч(Шапка.Ссылка) = Тип("ДокументСсылка.питРецептура") 
			И РазворачиватьДоИнгредиентов Тогда
			
			ИспользуетсяДеревоСостава = Истина;
			
			МассивПодразделенийПФ = Неопределено;
			Если НЕ питПодразделениеПроизводства = Неопределено Тогда
				МассивПодразделенийПФ = Новый Массив(1);
				МассивПодразделенийПФ[0] = питПодразделениеПроизводства;
			КонецЕсли;
			
			СтруктураРассчитываемогоБлюдо = Неопределено;
			СтруктураРассчитываемогоБлюдо = Новый Структура("Блюдо,Характеристика,Упаковка",Шапка.Номенклатура,Шапка.Характеристика,Шапка.Упаковка);
			ДеревоСостава	= питПроизводство.РассчитатьДеревоСоставаРецептуры(Шапка.Ссылка,,Шапка.Количество,,,,,,,,,,СтруктураРассчитываемогоБлюдо,,,,,,,,,МассивПодразделенийПФ,питПодразделениеПроизводства,,УточненияАвтовыбора);
			ТаблицаТовары = питОбщегоНазначения.СоздатьТаблицуЗначенийПоРезультату(ДеревоСостава, Истина);
			Для каждого ТекСтрокаТовары Из ТаблицаТовары Цикл
				Если НЕ ЗначениеЗаполнено(ТекСтрокаТовары.ЕдиницаИзмерения) Тогда
					ТекСтрокаТовары.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрокаТовары.Номенклатура, "ЕдиницаИзмерения");
				КонецЕсли;
			КонецЦикла;
			КолонкиГруппировокСтрокой = "";
			КолонкиСверткиСтрокой = "";
			Для каждого ТекКолонкаДерева Из ДеревоСостава.Колонки Цикл
				Если СтрНайти(ТекКолонкаДерева.Имя, "СтатьяКалькуляции") Тогда
					Продолжить;
				КонецЕсли;
				Если СтрНайти(ТекКолонкаДерева.Имя, "Количество") Тогда
					КолонкиСверткиСтрокой = КолонкиСверткиСтрокой + ?(ПустаяСтрока(КолонкиСверткиСтрокой), "", ",") + ТекКолонкаДерева.Имя;
				Иначе
					КолонкиГруппировокСтрокой = КолонкиГруппировокСтрокой + ?(ПустаяСтрока(КолонкиГруппировокСтрокой), "", ",") + ТекКолонкаДерева.Имя;
				КонецЕсли;
			КонецЦикла;
			ТаблицаТовары.Свернуть(КолонкиГруппировокСтрокой, КолонкиСверткиСтрокой);
			
			// Функция "РассчитатьДеревоСоставаРецептуры" не считает процент ХО и ГО.
			ТаблицаТовары.Колонки.Добавить("ПроцентОтходовХолоднойОбработки", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
			ТаблицаТовары.Колонки.Добавить("ПроцентОтходовТепловойОбработки", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
			Для каждого ТекСтрокаТовары Из ТаблицаТовары Цикл
				ТекСтрокаТовары.ПроцентОтходовХолоднойОбработки = (
					(ТекСтрокаТовары.КоличествоУпаковок - ТекСтрокаТовары.КоличествоУпаковокНетто)
					/ ТекСтрокаТовары.КоличествоУпаковок)*100;
				ТекСтрокаТовары.ПроцентОтходовТепловойОбработки = (
					(ТекСтрокаТовары.КоличествоУпаковокНетто - ТекСтрокаТовары.КоличествоУпаковокВыход)
					/ ТекСтрокаТовары.КоличествоУпаковокНетто)*100;
			КонецЦикла;
			
		Иначе
			
			ТаблицаТовары = Шапка.Ингредиенты.Выгрузить();
			
			//+ПараметризацияРецептур
			Если ТипЗнч(Шапка.Ссылка) = Тип("ДокументСсылка.питРецептура") 
				И ЗначениеЗаполнено(Шапка.Ссылка) Тогда
				Если питПодразделениеПроизводства = Неопределено Тогда
					питПодразделениеПроизводства = питОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шапка.Ссылка, "Подразделение");
				КонецЕсли;
				ТаблицаОтборПоСвойствам = питУправлениеСвойствами.ПолучитьТаблицуОтборПоСвойствам(Шапка.Ссылка, питПодразделениеПроизводства);
				СПОтборПоСвойствам = Новый Структура("КлючСвязи");
			КонецЕсли;
			//-ПараметризацияРецептур
			
			//+АвтовыборНоменклатуры
			питУправлениеДаннымиОбИзделиях.ОбработатьНастройкиАвтовыбораНоменклатуры(ТаблицаТовары, Шапка.Ссылка, Шапка.Количество, Шапка, УточненияАвтовыбора);
			//-АвтовыборНоменклатуры
			
			СтрокиУдалить = Новый Массив;
			
			Для каждого ТекСтрокаТовары Из ТаблицаТовары Цикл
				
				//+ПараметризацияРецептур
				Если ТипЗнч(Шапка.Ссылка) = Тип("ДокументСсылка.питРецептура") 
					И ЗначениеЗаполнено(Шапка.Ссылка) Тогда
					СПОтборПоСвойствам.КлючСвязи = ТекСтрокаТовары.КлючСвязи;
					СтрокиОтборПоСвойствам = ТаблицаОтборПоСвойствам.НайтиСтроки(СПОтборПоСвойствам);
					ТекИспользуется = Истина;
					Для каждого ТекСтрокаОтборПоСвойствам Из СтрокиОтборПоСвойствам Цикл
						Если НЕ ТекСтрокаОтборПоСвойствам.Используется Тогда
							ТекИспользуется = Ложь;
						КонецЕсли;
					КонецЦикла;
					Если НЕ ТекИспользуется Тогда
						СтрокиУдалить.Добавить(ТекСтрокаТовары);
					КонецЕсли;
				КонецЕсли;
				//-ПараметризацияРецептур
				
			КонецЦикла;
			
			Для каждого ТекСтрокаУдалить Из СтрокиУдалить Цикл
				ТаблицаТовары.Удалить(ТекСтрокаУдалить);
			КонецЦикла;
			
		КонецЕсли;
		
		Для каждого ВыборкаСтрокТовары Из ТаблицаТовары Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			
			Если ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
				ОбластьСтрока.Параметры.Номенклатура = СокрЛП(ВыборкаСтрокТовары.Номенклатура.НаименованиеПолное)+ "" + ?(ЗначениеЗаполнено(ВыборкаСтрокТовары.Характеристика)," / " + СокрЛП(ВыборкаСтрокТовары.Характеристика.НаименованиеПолное),"");
			Иначе
				ОбластьСтрока.Параметры.Номенклатура = "<Уточняется при производстве>";
			КонецЕсли;
			
			Если ВыборкаСтрокТовары.КоличествоУпаковок > 0 Тогда
				ОбластьСтрока.Параметры.ПроцентОтходовТепловойОбработки	= ВыборкаСтрокТовары.ПроцентОтходовХолоднойОбработки;
			КонецЕсли;
			Если ВыборкаСтрокТовары.КоличествоУпаковокНетто > 0 Тогда
				ОбластьСтрока.Параметры.ПроцентОтходовТепловойОбработки	= ВыборкаСтрокТовары.ПроцентОтходовТепловойОбработки;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Количество      = ВыборкаСтрокТовары.КоличествоУпаковок;
			ОбластьСтрока.Параметры.КоличествоНетто = ВыборкаСтрокТовары.КоличествоУпаковокНетто;
			ОбластьСтрока.Параметры.КоличествоВыход = ВыборкаСтрокТовары.КоличествоУпаковокВыход;
			
			//<<=== Плотникова Н. 05.10.2021 
			пл_КоличествоУпаковокВыход = ВыборкаСтрокТовары.КоличествоУпаковокВыход;	
			//>>=== Плотникова Н.Ю. 05.10.2021 
			
			ОбластьСтрока.Параметры.КоличествоНеттоНаКоличествоПорций = ОбластьСтрока.Параметры.КоличествоНетто / Шапка.Количество;
			Если КоэффициентПересчета <> 1 Тогда
				ОбластьСтрока.Параметры.Количество      = ВыборкаСтрокТовары.КоличествоУпаковок * КоэффициентПересчета;
				ОбластьСтрока.Параметры.КоличествоНетто = ВыборкаСтрокТовары.КоличествоУпаковокНетто * КоэффициентПересчета;
				ОбластьСтрока.Параметры.КоличествоВыход = ВыборкаСтрокТовары.КоличествоУпаковокВыход * КоэффициентПересчета;
				
				//<<=== Плотникова Н. 05.10.2021 
				пл_КоличествоУпаковокВыход = ВыборкаСтрокТовары.КоличествоУпаковокВыход * КоэффициентПересчета;	
				//>>=== Плотникова Н.Ю. 05.10.2021
				
			КонецЕсли;
			
			// В случае, если производится нормативный расчет калькуляции, то следует учесть влияние сезонного коэффициента.
			Если НЕ НеИспользоватьСезонныеПроценты Тогда
				СезонныйПроцент = питЛицензированиеСервер.ПолучитьСезонныйПроцент(ВыборкаСтрокТовары.Номенклатура, ДатаФормирования, КэшЗаполненияДерева.КэшСезонныхПроцентов);
				СезонныйКоэффициент = 1+СезонныйПроцент/100;
				ОбластьСтрока.Параметры.Количество = ВыборкаСтрокТовары.КоличествоУпаковок * КоэффициентПересчета * СезонныйКоэффициент;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ОбластьСтрока.Параметры.ЕдиницаИзмерения) Тогда
				Если ИспользуетсяДеревоСостава Тогда
					ОбластьСтрока.Параметры.ЕдиницаИзмерения = ВыборкаСтрокТовары.Номенклатура.ЕдиницаИзмерения;
				Иначе
					ОбластьСтрока.Параметры.ЕдиницаИзмерения = ВыборкаСтрокТовары.ЕдиницаХранения;
				КонецЕсли;
			КонецЕсли;
			
			// << MRS  #HELP1C-9787 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 06.11.2024 [Обновление релиза]
			//ТабличныйДокумент.Вывести(ОбластьСтрока);
			//
			//ИтогоВыход = ИтогоВыход + ВыборкаСтрокТовары.КоличествоУпаковокВыход;
			// >> MRS  #HELP1C-9787 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 06.11.2024 [Обновление релиза]
			
			//<<===ПорталЮгКрым, Плотникова Н.Ю. 06.09.2021 [исправление ошибок обновления] 
			//ИтогоВыход = ИтогоВыход + ВыборкаСтрокТовары.КоличествоУпаковокВыход;
			
			мКоличествоВыход = ?(ТаблицаТовары.Колонки.Найти("КоличествоВыход")=Неопределено,0,ВыборкаСтрокТовары.КоличествоВыход);
			мНомерСтроки = ?(ТаблицаТовары.Колонки.Найти("КоличествоВыход")=Неопределено,ВыборкаСтрокТовары.НомерСтроки,0);
			пл_СтрукВозврат = ПЛ_ВернутьВесовойКоэффициент(Новый Структура("Номенклатура,КоличествоВыход,КоличествоУпаковокВыход,Ссылка,НомерСтроки,РассчитываемоеКоличество",ВыборкаСтрокТовары.Номенклатура,мКоличествоВыход,пл_КоличествоУпаковокВыход,Шапка.Ссылка,мНомерСтроки,КоэффициентПересчета));
			Коэф = пл_СтрукВозврат.Коэф;
			
			Прочерк = "----";
			ОбластьСтрока.Параметры.Количество      = ?(Коэф = 0, Прочерк, ОбластьСтрока.Параметры.Количество * Коэф);
			ОбластьСтрока.Параметры.КоличествоНетто = ?(Коэф = 0, Прочерк, ОбластьСтрока.Параметры.КоличествоНетто * Коэф);
			ОбластьСтрока.Параметры.КоличествоВыход = ?(Коэф = 0, Прочерк, ОбластьСтрока.Параметры.КоличествоВыход * Коэф);
			ОбластьСтрока.Параметры.КоличествоНеттоНаКоличествоПорций = ?(Коэф = 0, Прочерк, ОбластьСтрока.Параметры.КоличествоНеттоНаКоличествоПорций * Коэф);
			ОбластьСтрока.Параметры.ЕдиницаИзмерения = пл_СтрукВозврат.ВесЕдиницаИзмерения;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			Если Коэф = 0 Тогда
				ИтогоВыход = ИтогоВыход + ВыборкаСтрокТовары.КоличествоУпаковокВыход;
			иначе
				ИтогоВыход = ИтогоВыход + ВыборкаСтрокТовары.КоличествоУпаковокВыход*Коэф;
			КонецЕсли; 
			
		КонецЦикла;
		
		// Выводим подвал документа
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		Если ЗначениеЗаполнено(Шапка.ДокументОснование) И ТипЗнч(Шапка.ДокументОснование) = Тип("ДокументСсылка.питАктПроработки") Тогда
			ОбластьПодвал.Параметры.ТекстСоставлена = " составлена на основании акта проработки №"+Шапка.ДокументОснованиеНомер+" от "+Формат(Шапка.ДокументОснованиеДата,"ДФ=dd.MM.yy");
		ИначеЕсли ТипЗнч(Шапка.Ссылка) = Тип("ДокументСсылка.питАктПроработки") Тогда
			ОбластьПодвал.Параметры.ТекстСоставлена = " составлена на основании акта проработки №"+Шапка.Номер+" от "+Формат(Шапка.Дата,"ДФ=dd.MM.yy");
		Иначе
			ОбластьПодвал.Параметры.ТекстСоставлена = "";
		КонецЕсли;
		
		Руководители = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Шапка.Организация, Шапка.Дата);
		ОбластьПодвал.Параметры.Руководитель = Руководители.РуководительНаименование;
		
		//<< Швецов. 12.07.2022. SD75275. Убрать руководителя
		ОбластьПодвал.Параметры.Руководитель = Неопределено;
		//>> Швецов. 12.07.2022. SD75275. Убрать руководителя
		
		Если Руководители.Свойство("питКалькулятор") Тогда
			ОбластьПодвал.Параметры.Калькулятор = Руководители.питКалькулятор;
		Иначе
			ОбластьПодвал.Параметры.Калькулятор = Шапка.Ответственный;
		КонецЕсли;
		Если Руководители.Свойство("питЗаведующийПроизводством") Тогда
			ОбластьПодвал.Параметры.ЗаведующийПроизводством = Руководители.питЗаведующийПроизводством;
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Выход = Шапка.Выход;  // Уточнить, какой здесь нужен выход, сумма колонок, или из реквизита?
		ОбластьПодвал.Параметры.ТехнологияПриготовления = Шапка.ТехнологияПриготовления;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует табличный документ технико-технологическая карта по норме
// 
// Возвращаемое значение:
//  Табличный документ - Технико-технологическая карта
//
Функция ПечатьТехТехнолКарта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("СтруктураПараметровТТК") Тогда
		СтруктураПараметров = ПараметрыПечати.СтруктураПараметровТТК;
	Иначе
		СтруктураПараметров = Новый Структура();
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыпускПродукции_ТехТехнолКарта";
	
	МассивРецептуры = Новый Массив; // для исключения дублирования блюд
	
	ПервыйДокумент = Истина;
	
	ПоГост = Ложь;
	Если ПараметрыПечати.Свойство("ПоГОСТ") Тогда
		ПоГост = ПараметрыПечати.ПоГОСТ;
	ИначеЕсли СтруктураПараметров.Свойство("ПоГОСТ") Тогда
		ПоГост = СтруктураПараметров.ПоГОСТ;
	КонецЕсли;
	
	//+АвтовыборНоменклатуры
	УточненияАвтовыбора = Неопределено;
	Если СтруктураПараметров.Свойство("УточненияАвтовыбора") Тогда
		УточненияАвтовыбора = ПолучитьИзВременногоХранилища(СтруктураПараметров.УточненияАвтовыбора);
	КонецЕсли;
	//-АвтовыборНоменклатуры
	
	питПодразделениеПроизводства = Неопределено;
	Если СтруктураПараметров.Свойство("питПодразделениеПроизводства") Тогда
		питПодразделениеПроизводства = СтруктураПараметров.питПодразделениеПроизводства;
	КонецЕсли;
	
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
		
		//+АвтовыборНоменклатуры
		Если УточненияАвтовыбора = Неопределено Тогда
			Если ТипЗнч(ДокументСсылка)=Тип("ДокументОбъект.питРецептура") Тогда
				УточненияАвтовыбора = ДокументСсылка.УточненияАвтовыбора.Выгрузить();
			ИначеЕсли ТипЗнч(ДокументСсылка)=Тип("ДокументСсылка.питРецептура") Тогда
				УточненияАвтовыбора = питУправлениеДаннымиОбИзделиях.ПолучитьТаблицуУточненийАвтовыбораПоДокументу(ДокументСсылка);
			КонецЕсли;
		КонецЕсли;
		//-АвтовыборНоменклатуры
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выведем технико-технологическую карту. 
		питДиетпитание.ВывестиТехникоТехнологическуюКарту(ТабличныйДокумент, ДокументСсылка, ДокументСсылка,,,,ПоГост,питПодразделениеПроизводства, УточненияАвтовыбора);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьТехТехнолКарта

// Функция формирует печатную форму "Состав химикоэнергетических характеристик"
//
// Возвращаемое значение:
//  Сформированный табличный документ:
//
Функция ПечатьСоставХЭХ(МассивОбъектов, ОбъектыПечати, ПараметрыПечати=Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СпособРасчетаКоличестваХЭХ = Константы.питСпособРасчетаКоличестваХЭХ.Получить();
	СтруктураРезультата = ПараметрыПечати.СтруктураПараметровХЭХ;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы  = ?(СтруктураРезультата.СпособВыводаРезультата = 0, ОриентацияСтраницы.Ландшафт, ОриентацияСтраницы.Портрет);
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Рецептура_СоставХЭХ" + ?(СтруктураРезультата.СпособВыводаРезультата = 0, "Полная", "Краткая");
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.питРецептура.ПФ_MXL_СоставХЭХ");
	
	//+АвтовыборНоменклатуры
	УточненияАвтовыбора = Неопределено;
	Если СтруктураРезультата.Свойство("УточненияАвтовыбора") Тогда
		УточненияАвтовыбора = ПолучитьИзВременногоХранилища(СтруктураРезультата.УточненияАвтовыбора);
	КонецЕсли;
	//-АвтовыборНоменклатуры
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
		
		//+АвтовыборНоменклатуры
		Если УточненияАвтовыбора = Неопределено Тогда
			Если ТипЗнч(ДокументСсылка)=Тип("ДокументОбъект.питРецептура") Тогда
				УточненияАвтовыбора = ДокументСсылка.УточненияАвтовыбора.Выгрузить();
			ИначеЕсли ТипЗнч(ДокументСсылка)=Тип("ДокументСсылка.питРецептура") Тогда
				УточненияАвтовыбора = питУправлениеДаннымиОбИзделиях.ПолучитьТаблицуУточненийАвтовыбораПоДокументу(ДокументСсылка);
			КонецЕсли;
		КонецЕсли;
		//-АвтовыборНоменклатуры
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок|КолонкаНоменклатура");
		Если ЗначениеЗаполнено(ДокументСсылка.Номенклатура) Тогда
			ОбластьЗаголовок.Параметры.Блюдо = СокрЛП(ДокументСсылка.Номенклатура.НаименованиеПолное) + " " + ?(ЗначениеЗаполнено(ДокументСсылка.Характеристика)," / " + ДокументСсылка.Характеристика.НаименованиеПолное,"");
		Иначе
			ОбластьЗаголовок.Параметры.Блюдо = "<Уточняется при производстве>";
		КонецЕсли;
		ОбластьЗаголовок.Параметры.Рецептура = ДокументСсылка.Ссылка;
		ОбластьЗаголовок.Параметры.Количество = ?(СтруктураРезультата.СпособВыводаКоличества = 0, ДокументСсылка.КоличествоУпаковок, СтруктураРезультата.КоличествоУпаковок);
		ЕдиницаБлюда = ?(СтруктураРезультата.СпособВыводаКоличества = 0, ДокументСсылка.Упаковка, СтруктураРезультата.ЕдиницаИзмерения);
		ОбластьЗаголовок.Параметры.ЕдиницаБлюда =?(ЗначениеЗаполнено(ЕдиницаБлюда),ЕдиницаБлюда, ДокументСсылка.Номенклатура.ЕдиницаИзмерения); 
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		РассчетноеКоличество =         ?(СтруктураРезультата.СпособВыводаКоличества = 0, ДокументСсылка.Количество, СтруктураРезультата.Количество);
		РассчетноеКоличествоУпаковок = ?(СтруктураРезультата.СпособВыводаКоличества = 0, ДокументСсылка.КоличествоУпаковок, СтруктураРезультата.КоличествоУпаковок);
		
		СпособРасчетаКоличестваХЭХ = Перечисления.питСпособыРасчетаКоличестваХЭХ[СтруктураРезультата.СпособРасчетаКоличестваХЭХ];
		
		ТаблицаСостава = Новый ТаблицаЗначений();
		
		СписокХЭХ = питДиетпитание.ПолучитьСоставХЭХ(ДокументСсылка.Номенклатура, ДокументСсылка.Характеристика, ДокументСсылка, РассчетноеКоличество,РассчетноеКоличествоУпаковок, , СпособРасчетаКоличестваХЭХ, , ДокументСсылка.СпособРасчетаКалорийности, ТаблицаСостава, ?(ЗначениеЗаполнено(СтруктураРезультата.питПодразделениеПроизводства), СтруктураРезультата.питПодразделениеПроизводства, ДокументСсылка.Подразделение), УточненияАвтовыбора);
		
		Если СписокХЭХ = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для блюда """+ДокументСсылка.Номенклатура.НаименованиеПолное+""" химико-энергетические характеристики не заданы!";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		// Получение областей
		
		ОбластьХЭХ = Макет.ПолучитьОбласть("ХЭХ|КолонкаНоменклатура");
		ОбластьШапкаНоменклатура = Макет.ПолучитьОбласть("ШапкаНоменклатура|КолонкаНоменклатура");
		ОбластьСтрокаНоменклатура = Макет.ПолучитьОбласть("СтрокаНоменклатура|КолонкаНоменклатура");
		
		ИмяШапкаХЭХПоГоризонтали = "ШапкаХЭХ" + ?(СтруктураРезультата.СпособВыводаРезультата = 0, "Полная", "Краткая");
		ИмяШапкаХЭХПоВертикали = "КолонкаХЭХ"+ ?(СпособРасчетаКоличестваХЭХ = Перечисления.питСпособыРасчетаКоличестваХЭХ.СУчетомПотерьХЭХ, "СПотерями", "");
		
		ОбластьШапкаХЭХ = Макет.ПолучитьОбласть(ИмяШапкаХЭХПоГоризонтали + "|" + ИмяШапкаХЭХПоВертикали);
		ОбластьСтрокаХЭХ = Макет.ПолучитьОбласть("СтрокаХЭХ|" + ИмяШапкаХЭХПоВертикали);
		
		ИмяШапкаКалорийностьПоГоризонтали = "ШапкаКалорийность" + ?(СтруктураРезультата.СпособВыводаРезультата = 0, "Полная", "Краткая");
		ИмяШапкаКалорийностьПоВертикали = "КолонкаКалорийность" + ?(СпособРасчетаКоличестваХЭХ = Перечисления.питСпособыРасчетаКоличестваХЭХ.СУчетомПотерьХЭХ, "СПотерями", "");
		
		ОбластьШапкаКалорийность = Макет.ПолучитьОбласть(ИмяШапкаКалорийностьПоГоризонтали + "|" + ИмяШапкаКалорийностьПоВертикали);
		ОбластьСтрокаКалорийность = Макет.ПолучитьОбласть("СтрокаКалорийность|" + ИмяШапкаКалорийностьПоВертикали);
		
		СтруктураШапкиХЭХ = Новый Структура("ХЭХ,ЕдиницаХЭХ");
		СтруктураСтрокиХЭХ = Новый Структура("Количество,ПроцентПотерь,Итого,Формула,Источник");
		
		// Вычислим порядок обхода таблицы состава
		ПорядокОбходаТаблицыСостава = питДиетпитание.СоздатьПорядокОбходаТаблицыСоставаХЭХ(ТаблицаСостава);
		МассивВходов = питДиетпитание.СформироватьМассивВходовВПорядокОбходаДеревоСостава(ТаблицаСостава, ПорядокОбходаТаблицыСостава);
		ДеревоНоменклатуры = питДиетпитание.СоздатьТаблицуДереваНоменклатурыСоставаХЭХ(ТаблицаСостава, ПорядокОбходаТаблицыСостава, МассивВходов);
		
		// ПОЛУЧАЕМ ТАБЛИЦУ НЕОБХОДИМЫХ ХЭХ
		Если СтруктураРезультата.ВыводимыеХЭХ = 1 Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = "ВЫБРАТЬ
			|	ХимикоэнергетическиеХарактеристики.Ссылка КАК ХЭХ,
			|	ХимикоэнергетическиеХарактеристики.ЕдиницаИзмерения КАК ЕдиницаИзмеренияХЭХ
			|ИЗ
			|	Справочник.питХимикоэнергетическиеХарактеристики КАК ХимикоэнергетическиеХарактеристики
			|ГДЕ
			|	ХимикоэнергетическиеХарактеристики.Предопределенный";
			ПереченьХЭХ = Запрос.Выполнить().Выгрузить();
		ИначеЕсли СтруктураРезультата.ВыводимыеХЭХ = 2 Тогда
			ПечатныеХЭХ = питДиетпитание.ПолучитьПереченьПечатныхХЭХ();
			ПереченьХЭХ = ПечатныеХЭХ.Скопировать(, "ХимикоэнергетическаяХарактеристика,ЕдиницаИзмерения");
			ПереченьХЭХ.Колонки.ХимикоэнергетическаяХарактеристика.Имя = "ХЭХ";
			ПереченьХЭХ.Колонки.ЕдиницаИзмерения.Имя = "ЕдиницаИзмеренияХЭХ";
			ПереченьХЭХ.Свернуть("ХЭХ,ЕдиницаИзмеренияХЭХ");
		ИначеЕсли СтруктураРезультата.ВыводимыеХЭХ = 3 Тогда
			ВыбраннаяГруппа = СтруктураРезультата.ГруппаХЭХ;
			Если ВыбраннаяГруппа.Пустая() Тогда
				Возврат Неопределено;
			КонецЕсли;
			Запрос = Новый Запрос();
			Запрос.Текст = "ВЫБРАТЬ
			|	ХимикоэнергетическиеХарактеристики.Ссылка КАК ХЭХ,
			|	ХимикоэнергетическиеХарактеристики.ЕдиницаИзмерения КАК ЕдиницаИзмеренияХЭХ
			|ИЗ
			|	Справочник.питХимикоэнергетическиеХарактеристики КАК ХимикоэнергетическиеХарактеристики
			|ГДЕ
			|	ХимикоэнергетическиеХарактеристики.ГруппаХЭХ = &ВыбраннаяГруппа";
			Запрос.УстановитьПараметр("ВыбраннаяГруппа", ВыбраннаяГруппа);
			ПереченьХЭХ = Запрос.Выполнить().Выгрузить();
			
		ИначеЕсли СтруктураРезультата.ВыводимыеХЭХ = 4 Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = "ВЫБРАТЬ
			|	ХимикоэнергетическиеХарактеристики.Ссылка КАК ХЭХ,
			|	ХимикоэнергетическиеХарактеристики.ЕдиницаИзмерения КАК ЕдиницаИзмеренияХЭХ
			|ИЗ
			|	Справочник.питХимикоэнергетическиеХарактеристики КАК ХимикоэнергетическиеХарактеристики";
			ПереченьХЭХ = Запрос.Выполнить().Выгрузить();
		Иначе
			ПереченьХЭХ = ТаблицаСостава.Скопировать(, "ХЭХ,ЕдиницаИзмеренияХЭХ");
			ПереченьХЭХ.Свернуть("ХЭХ,ЕдиницаИзмеренияХЭХ");
		КонецЕсли;
		
		СоответствиеХЭХ = Новый Соответствие();
		Для Каждого ЭлементПеречня Из ПереченьХЭХ Цикл
			СоответствиеХЭХ.Вставить(ЭлементПеречня.ХЭХ, -1);
			Сч = 0;
			Для Сч = 0 По МассивВходов.Количество() - 1 Цикл
				Вход = МассивВходов[Сч];
				Если Вход.ХЭХ = ЭлементПеречня.ХЭХ Тогда
					СоответствиеХЭХ[Вход.ХЭХ] = Сч;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// Инициализируем входы
		Для Каждого Вход Из МассивВходов Цикл
			Вход.Индекс = Вход.Начало;
		КонецЦикла;
		
		Если СтруктураРезультата.СпособВыводаРезультата = 0 Тогда
			// Собираем шапку таблицы
			ТабличныйДокумент.Вывести(ОбластьШапкаНоменклатура);
			Для Каждого ЭлементПеречня Из ПереченьХЭХ Цикл
				Если ЭлементПеречня.ХЭХ.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				Если ЭлементПеречня.ХЭХ = Справочники.питХимикоэнергетическиеХарактеристики.Калорийность Тогда
					ОбластьШапкаКалорийность.Параметры.Заполнить(ЭлементПеречня);
					ТабличныйДокумент.Присоединить(ОбластьШапкаКалорийность);
				Иначе
					ОбластьШапкаХЭХ.Параметры.Заполнить(ЭлементПеречня);
					ТабличныйДокумент.Присоединить(ОбластьШапкаХЭХ);
				КонецЕсли;
			КонецЦикла;
			
			// Выводим строки
			НомерСтроки = 1;
			Для Каждого СтрокаНоменклатуры Из ДеревоНоменклатуры Цикл
				// Данные о номенклатуре
				ОбластьСтрокаНоменклатура.Параметры.Заполнить(СтрокаНоменклатуры);
				ОбластьСтрокаНоменклатура.Параметры.НомерСтроки = НомерСтроки;
				//ОбластьСтрокаНоменклатура.Параметры.НоменклатураНаименование = ОбластьСтрокаНоменклатура.Параметры.НоменклатураНаименование + "" + ?(ЗначениеЗаполнено(СтрокаТаблицы.Характеристика)," / " + СокрЛП(СтрокаТаблицы.Характеристика),"")
				
				// Если единица измерения равна базовой, то она в ЕРП не пишется, поэтому берем напрямую из номенклатуры (отобразить то в ПФ нам ее надо все-равно).
				Если НЕ ЗначениеЗаполнено(СтрокаНоменклатуры.ЕдиницаИзмерения) Тогда
					ОбластьСтрокаНоменклатура.Параметры.ЕдиницаИзмерения = СтрокаНоменклатуры.Номенклатура.ЕдиницаИзмерения;
				КонецЕсли;
				
				Если СтрокаНоменклатуры.Рецептура.Пустая() Тогда
					ОбластьСтрокаНоменклатура.Параметры.РецептураПредставление = "";
				Иначе
					ОбластьСтрокаНоменклатура.Параметры.РецептураПредставление = "№" + СокрЛП(СтрокаНоменклатуры.Рецептура.Номер) + " от " + СокрЛП(Формат(СтрокаНоменклатуры.Рецептура.Дата, "ДФ=dd.MM.yyyy; ДЛФ=D"));
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтрокаНоменклатура);
				
				// Выводим ХЭХ
				Для Каждого ЭлементПеречня Из ПереченьХЭХ Цикл
					Если ЭлементПеречня.ХЭХ.Пустая() Тогда
						Продолжить;
					КонецЕсли;
					
					НомерВхода = СоответствиеХЭХ[ЭлементПеречня.ХЭХ];
					ОбнулитьВывод = Истина;
					Если НомерВхода >= 0 Тогда
						Вход = МассивВходов[НомерВхода];
						
						Если Вход.Индекс < Вход.Начало + Вход.Число Тогда
							ТекСтрокаСостава = ТаблицаСостава[ПорядокОбходаТаблицыСостава[Вход.Индекс]];
							
							СовпадаютСтроки =	(СтрокаНоменклатуры.Номенклатура = ТекСтрокаСостава.Номенклатура) И
												(СтрокаНоменклатуры.Количество = ТекСтрокаСостава.КоличествоНоменклатуры) И
												(СтрокаНоменклатуры.ЕдиницаИзмерения = ТекСтрокаСостава.ЕдиницаИзмеренияНоменклатуры) И
												(СтрокаНоменклатуры.Рецептура = ТекСтрокаСостава.Рецептура) И
												(СтрокаНоменклатуры.Уровень = ТекСтрокаСостава.Уровень) И
												(СтрокаНоменклатуры.НомерВетки = ТекСтрокаСостава.НомерВетки);
							
							Если СовпадаютСтроки Тогда
								ОбнулитьВывод = Ложь;
								
								СтруктураСтрокиХЭХ.Количество = ТекСтрокаСостава.КоличествоИсходное;
								СтруктураСтрокиХЭХ.ПроцентПотерь = ТекСтрокаСостава.ПроцентПотерь;
								СтруктураСтрокиХЭХ.Итого = ТекСтрокаСостава.КоличествоИтого;
								СтруктураСтрокиХЭХ.Формула = ТекСтрокаСостава.Формула;
								СтруктураСтрокиХЭХ.Источник = ТекСтрокаСостава.Источник;
								
								Если ЭлементПеречня.ХЭХ = Справочники.питХимикоэнергетическиеХарактеристики.Калорийность Тогда
									ОбластьСтрокаКалорийность.Параметры.Заполнить(СтруктураСтрокиХЭХ);
									ТабличныйДокумент.Присоединить(ОбластьСтрокаКалорийность);
								Иначе
									ОбластьСтрокаХЭХ.Параметры.Заполнить(СтруктураСтрокиХЭХ);
									ТабличныйДокумент.Присоединить(ОбластьСтрокаХЭХ);
								КонецЕсли;
								
								Вход.Индекс = Вход.Индекс + 1;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если ОбнулитьВывод Тогда
						СтруктураСтрокиХЭХ.Количество = 0;
						СтруктураСтрокиХЭХ.ПроцентПотерь = 0;
						СтруктураСтрокиХЭХ.Итого = 0;
						СтруктураСтрокиХЭХ.Формула = "";
						СтруктураСтрокиХЭХ.Источник = "";
						
						Если ЭлементПеречня.ХЭХ = Справочники.питХимикоэнергетическиеХарактеристики.Калорийность Тогда
							ОбластьСтрокаКалорийность.Параметры.Заполнить(СтруктураСтрокиХЭХ);
							ТабличныйДокумент.Присоединить(ОбластьСтрокаКалорийность);
						Иначе
							ОбластьСтрокаХЭХ.Параметры.Заполнить(СтруктураСтрокиХЭХ);
							ТабличныйДокумент.Присоединить(ОбластьСтрокаХЭХ);
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
				
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			
		Иначе
			
			Для Каждого ЭлементПеречня Из ПереченьХЭХ Цикл
				Если ЭлементПеречня.ХЭХ.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				НомерСтроки = 1;
				НомерВхода = СоответствиеХЭХ[ЭлементПеречня.ХЭХ];
				
				ОбластьХЭХ.Параметры.Заполнить(ЭлементПеречня);
				ТабличныйДокумент.Вывести(ОбластьХЭХ);
				
				// Выводим шапку
				ТабличныйДокумент.Вывести(ОбластьШапкаНоменклатура);
				Если ЭлементПеречня.ХЭХ = Справочники.питХимикоэнергетическиеХарактеристики.Калорийность Тогда
					ОбластьШапкаКалорийность.Параметры.Заполнить(ЭлементПеречня);
					ТабличныйДокумент.Присоединить(ОбластьШапкаКалорийность);
				Иначе
					ОбластьШапкаХЭХ.Параметры.Заполнить(ЭлементПеречня);
					ТабличныйДокумент.Присоединить(ОбластьШапкаХЭХ);
				КонецЕсли;
				
				Для Каждого СтрокаНоменклатуры Из ДеревоНоменклатуры Цикл
					// Данные о номенклатуре
					ОбластьСтрокаНоменклатура.Параметры.Заполнить(СтрокаНоменклатуры);
					ОбластьСтрокаНоменклатура.Параметры.НомерСтроки = НомерСтроки;
					//ОбластьСтрокаНоменклатура.Параметры.НоменклатураНаименование = ОбластьСтрокаНоменклатура.Параметры.НоменклатураНаименование + "" + ?(ЗначениеЗаполнено(СтрокаТаблицы.Характеристика)," / " + СокрЛП(СтрокаТаблицы.Характеристика),"")
					// Если единица измерения равна базовой, то она в ЕРП не пишется, поэтому берем напрямую из номенклатуры (отобразить то в ПФ нам ее надо все-равно).
					Если НЕ ЗначениеЗаполнено(СтрокаНоменклатуры.ЕдиницаИзмерения) Тогда
						ОбластьСтрокаНоменклатура.Параметры.ЕдиницаИзмерения = СтрокаНоменклатуры.Номенклатура.ЕдиницаИзмерения;
					КонецЕсли;
					
					Если СтрокаНоменклатуры.Рецептура.Пустая() Тогда
						ОбластьСтрокаНоменклатура.Параметры.РецептураПредставление = "";
					Иначе
						ОбластьСтрокаНоменклатура.Параметры.РецептураПредставление = "№" + СокрЛП(СтрокаНоменклатуры.Рецептура.Номер) + " от " + СокрЛП(Формат(СтрокаНоменклатуры.Рецептура.Дата, "ДФ=dd.MM.yyyy; ДЛФ=D"));
					КонецЕсли;
					ТабличныйДокумент.Вывести(ОбластьСтрокаНоменклатура);
					
					ОбнулитьВывод = Истина;
					Если НомерВхода >= 0 Тогда
						Вход = МассивВходов[НомерВхода];
						
						Если Вход.Индекс < Вход.Начало + Вход.Число Тогда
							ТекСтрокаСостава = ТаблицаСостава[ПорядокОбходаТаблицыСостава[Вход.Индекс]];
							
							СовпадаютСтроки =	(СтрокаНоменклатуры.Номенклатура = ТекСтрокаСостава.Номенклатура) И
												(СтрокаНоменклатуры.Количество = ТекСтрокаСостава.КоличествоНоменклатуры) И
												(СтрокаНоменклатуры.ЕдиницаИзмерения = ТекСтрокаСостава.ЕдиницаИзмеренияНоменклатуры) И
												(СтрокаНоменклатуры.Рецептура = ТекСтрокаСостава.Рецептура) И
												(СтрокаНоменклатуры.Уровень = ТекСтрокаСостава.Уровень) И
												(СтрокаНоменклатуры.НомерВетки = ТекСтрокаСостава.НомерВетки);
							
							Если СовпадаютСтроки Тогда
								ОбнулитьВывод = Ложь;
								
								СтруктураСтрокиХЭХ.Количество = ТекСтрокаСостава.КоличествоИсходное;
								СтруктураСтрокиХЭХ.ПроцентПотерь = ТекСтрокаСостава.ПроцентПотерь;
								СтруктураСтрокиХЭХ.Итого = ТекСтрокаСостава.КоличествоИтого;
								СтруктураСтрокиХЭХ.Формула = ТекСтрокаСостава.Формула;
								СтруктураСтрокиХЭХ.Источник = ТекСтрокаСостава.Источник;
								
								Если ЭлементПеречня.ХЭХ = Справочники.питХимикоэнергетическиеХарактеристики.Калорийность Тогда
									ОбластьСтрокаКалорийность.Параметры.Заполнить(СтруктураСтрокиХЭХ);
									ТабличныйДокумент.Присоединить(ОбластьСтрокаКалорийность);
								Иначе
									ОбластьСтрокаХЭХ.Параметры.Заполнить(СтруктураСтрокиХЭХ);
									ТабличныйДокумент.Присоединить(ОбластьСтрокаХЭХ);
								КонецЕсли;
								
								Вход.Индекс = Вход.Индекс + 1;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если ОбнулитьВывод Тогда
						СтруктураСтрокиХЭХ.Количество = 0;
						СтруктураСтрокиХЭХ.ПроцентПотерь = 0;
						СтруктураСтрокиХЭХ.Итого = 0;
						СтруктураСтрокиХЭХ.Формула = "";
						СтруктураСтрокиХЭХ.Источник = "";
						
						Если ЭлементПеречня.ХЭХ = Справочники.питХимикоэнергетическиеХарактеристики.Калорийность Тогда
							ОбластьСтрокаКалорийность.Параметры.Заполнить(СтруктураСтрокиХЭХ);
							ТабличныйДокумент.Присоединить(ОбластьСтрокаКалорийность);
						Иначе
							ОбластьСтрокаХЭХ.Параметры.Заполнить(СтруктураСтрокиХЭХ);
							ТабличныйДокумент.Присоединить(ОбластьСтрокаХЭХ);
						КонецЕсли;
					КонецЕсли;
					
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка.Ссылка);
		
		КонецЦикла;
		
	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП1";
	КомандаПечати.Представление = НСтр("ru = 'Калькуляционная карточка ОП-1'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;
	//
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП1_СПараметрами";
	КомандаПечати.Представление = НСтр("ru = 'Калькуляционная карточка ОП-1 (печать с параметрами)'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 2;
	
	//АдагамовАР., НЭП, 14.07.2024. ORIP-1425. ++
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НЭП_питОП1_СПараметрами";
	КомандаПечати.Представление = НСтр("ru = 'Калькуляционная карточка ОП-1 (печать с параметрами)(с деревом)'");
	КомандаПечати.Порядок = 2;
	//АдагамовАР., НЭП, 14.07.2024. ORIP-1425. --
	
	//  ЕПР требует Акт прорпботки для печати
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехКарта";
	КомандаПечати.Представление = НСтр("ru = 'Технологическая карта'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехКартаРассчитываемая";
	КомандаПечати.Представление = НСтр("ru = 'Технологическая карта (печать с параметрами)'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 6;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехТехнолКарта";
	КомандаПечати.Представление = НСтр("ru = 'Технико-технологическая карта'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоГОСТ", Ложь);
	КомандаПечати.Порядок = 8;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехТехнолКартаГОСТ";
	КомандаПечати.Представление = НСтр("ru = 'Технико-технологическая карта ГОСТ'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоГОСТ", Истина);
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехТехнолКартаПарам";
	КомандаПечати.Представление = НСтр("ru = 'Технико-технологическая карта (печать с параметрами)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 11;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СоставХЭХ";
	КомандаПечати.Представление = НСтр("ru = 'Состав химико-энергетических характеристик'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 25;
	
	// Реестр документов
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Реестр";
	//КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	//КомандаПечати.ЗаголовокФормы= НСтр("ru = 'Реестр документов ""Рецептура""'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	//КомандаПечати.СписокФорм    = "ФормаСписка";
	//КомандаПечати.Порядок       = 100;   
	
	//<< Каюмов А.А., ВиП, 25.09.2023, I-143. Печать этикеток из рецептур 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ВИП_ПФ_MXL_Этикетка"; 
	КомандаПечати.Представление  = НСтр("ru = 'Этикетка'");
	КомандаПечати.СразуНаПринтер = Истина;
	КомандаПечати.Порядок = 26;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВИП_ЭтикеткаПредпросмтор"; 
	КомандаПечати.Представление = НСтр("ru = 'Этикетка (предпросмотр)'");  
	
	КомандаПечати.Порядок = 27;
 	//>> 
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Проверяем, нужно ли для макета "..." формировать табличный документ.
	// А затем формируем табличный документ, и добавляем его в коллекцию печатных форм.
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "питОП1", "ОП-1",
			ПечатьОП1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питОП1");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП1_СПараметрами") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "питОП1_СПараметрами", "ОП-1",
			ПечатьОП1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питОП1");
	КонецЕсли;
	
	//АдагамовАР., НЭП, 14.07.2024. ORIP-1425. ++
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НЭП_питОП1_СПараметрами") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НЭП_питОП1_СПараметрами", "ОП-1",
			ПечатьОП1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питОП1");
	КонецЕсли;
	//АдагамовАР., НЭП, 14.07.2024. ORIP-1425. --
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехКарта") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТехКарта", "Тех. карта",
			ПечатьТехКарта(МассивОбъектов, ОбъектыПечати,ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питТехнологическаяКарта");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехКартаРассчитываемая") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТехКартаРассчитываемая", "Технико-технологическая карта",
			ПечатьТехКарта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питТехнологическаяКарта");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехТехнолКарта") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТехТехнолКарта", "Технико-технологическая карта",
			ПечатьТехТехнолКарта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питТехникоТехнологическаяКарта");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехТехнолКартаГОСТ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТехТехнолКартаГОСТ", "Технико-технологическая карта ГОСТ",
			ПечатьТехТехнолКарта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питТехникоТехнологическаяКартаГОСТ");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехТехнолКартаПарам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТехТехнолКартаПарам", "Технико-технологическая карта",
			ПечатьТехТехнолКарта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питТехникоТехнологическаяКарта");
	КонецЕсли;

	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоставХЭХ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СоставХЭХ", "Состав химикоэнергетических характеристик",
			ПечатьСоставХЭХ(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"Документ.питРецептура.ПФ_MXL_СоставХЭХ");
КонецЕсли;  
		
	//<< Каюмов А.А., ВиП, 25.09.2023, I-143. Печать этикеток из рецептур 
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВИП_ПФ_MXL_Этикетка") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВИП_ПФ_MXL_Этикетка", "Этикетка",
			ВИП_ПечатьЭтикетки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"Документ.питРецептура.ВИП_ПФ_MXL_Этикетка"); 
			
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВИП_ЭтикеткаПредпросмтор") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВИП_ЭтикеткаПредпросмтор", "Этикетка",
			ВИП_ПечатьЭтикетки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"Документ.питРецептура.ВИП_ПФ_MXL_Этикетка"); 
			
	КонецЕсли;
	//>>	
КонецПроцедуры

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Номенклатура");
	
	Возврат Результат;
	
КонецФункции

#Область Отчеты

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, НастройкиФормы) Экспорт
	
	питОтчеты.ДобавитьКомандуПоказатьУчетныеДокументы(КомандыОтчетов);
	
КонецПроцедуры
#КонецОбласти 

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.питАктПроработки.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Пересчет товаров".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, РежимЗаписи = "Проводить") Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.питРецептура) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.питРецептура.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.питРецептура);
		КомандаСоздатьНаОсновании.РежимЗаписи = РежимЗаписи;
		
		
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область ПобочныеИзделия

// Возвращает текст запроса для получениях доступных назначений.
//	Параметры:
//		ПараметрыФормированияЗапроса - Структура - параметры для формирования текстов запросов.
//	Возвращаемое значение:
//		Строка - текст запроса.
//
Функция ТекстЗапросаДоступныхНазначений(ПараметрыФормированияЗапроса) Экспорт
	
	Возврат Справочники.Назначения.ТекстЗапросаНазначенийРасширенный();
	
КонецФункции

#КонецОбласти

// --- 26.07.2024 Адель перенесено в начало модуля
//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом
// --- 26.07.2024 Адель перенесено в конец модуля
//#КонецЕсли

#Область ПараметризацияРецептур

Процедура РассчитатьКоличествоФормульныхСтрок(ОбъектРецептура, ОбновлятьОбъектРецептура) Экспорт
	
	ЭтоУправлениеПредприятием = питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "УправлениеПредприятием";
	
	ПереченьДанных = Новый Массив();
	ПереченьДанных.Добавить("Ингредиенты");
	
	ДанныеСпецификации					= Новый Структура("ОсновноеИзделие, Ингредиенты");
	ДанныеСпецификации.ОсновноеИзделие	= ДанныеОсновногоИзделияСпецификации(ОбъектРецептура);
	ДанныеСпецификации.Ингредиенты		= ОбъектРецептура.Ингредиенты.Выгрузить();
	
	ДанныеПоНоменклатуре = ДанныеПоНоменклатуреРасширенный();
	ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, ОбъектРецептура);
	ДанныеПоНоменклатуре.Рецептура = ОбъектРецептура.Ссылка;
	ДанныеПоНоменклатуре.Спецификация = ОбъектРецептура.Ссылка;
	
	ПартияВыпуска = Новый Структура("Значение,Числитель,Знаменатель",1,1,1);
	
	ПараметрыРасчета = ПараметрыРасчетаКоличества(
			ДанныеПоНоменклатуре,
			ДанныеСпецификации);
	ПараметрыРасчета.ИспользоватьОдновременноПроизводимоеКоличество = Ложь;
	
	НаборДанных = Новый Массив;
	ДанныеДляРасчета = Неопределено;
	Если ЭтоУправлениеПредприятием Тогда
		ДобавитьСтрокиДляРасчетаПоФормулам(НаборДанных, ДанныеСпецификации, ПереченьДанных);
		ДанныеДляРасчета = ДанныеДляРасчетаПоФормулам(НаборДанных, ПартияВыпуска, ПараметрыРасчета);
	КонецЕсли;
	
	
	Если ДанныеСпецификации.Свойство("Ингредиенты")
		И ПереченьДанных.Найти("Ингредиенты") <> Неопределено Тогда
		РассчитатьКоличество(
			ПартияВыпуска,
			ДанныеСпецификации.Ингредиенты,
			Истина,
			Истина,
			Истина,
			ДанныеДляРасчета);
	КонецЕсли;
	
	Если ОбновлятьОбъектРецептура Тогда
		ОбъектРецептура.Ингредиенты.Загрузить(ДанныеСпецификации.Ингредиенты);
	КонецЕсли;
	
КонецПроцедуры

#Область ИзЕРП

////////////////////////////////////////////
// Открытие формы параметризации

// %ИзЕРП%
// Справочник.РесурсныеСпецификации.ВыгрузитьДанныеДляКонструктораФормул
//
Функция ВыгрузитьДанныеДляКонструктораФормул(ОбъектИлиСсылка, ИмяТЧ, ДанныеСтроки = Неопределено) Экспорт
	
	//+пит
	ОписаниеИсточников = Документы.питРецептура.ОписаниеИсточниковДанныхОперандов();
	
	ОсновноеИзделие = ДанныеОсновногоИзделияСпецификации(ОбъектИлиСсылка);
	//-пит
	
	ОписаниеИсточников["ОсновноеИзделие"].ИсточникСвойствНоменклатуры = ОсновноеИзделие.Номенклатура;
	
	//+пит
	РазрешенныеКлючи = Новый Массив;
	РазрешенныеКлючи.Добавить("Ингредиент");
	РазрешенныеКлючи.Добавить("Ингредиенты");
	РазрешенныеКлючи.Добавить("ОсновноеИзделие");
	КлючиУдалить = Новый Массив;
	Для каждого ТекОписаниеИсточника Из ОписаниеИсточников Цикл
		Если РазрешенныеКлючи.Найти(ТекОписаниеИсточника.Ключ) = Неопределено Тогда
			КлючиУдалить.Добавить(ТекОписаниеИсточника.Ключ);
		КонецЕсли;
	КонецЦикла;
	Для каждого ТекКлючУдалить Из КлючиУдалить Цикл
		ОписаниеИсточников.Удалить(ТекКлючУдалить);
	КонецЦикла;
	//-пит
	
	УправлениеДаннымиОбИзделиях.ДополнитьОписаниеИсточниковСоставомОперандов(
		ОписаниеИсточников, ОбъектИлиСсылка, ИмяТЧ, ДанныеСтроки);
	
	Возврат ОписаниеИсточников;
	
КонецФункции

// %ИзЕРП%
// Справочник.РесурсныеСпецификации.ОписаниеИсточниковДанныхОперандов
//
Функция ОписаниеИсточниковДанныхОперандов(Объект = Неопределено) Экспорт
	
	Результат = Справочники.РесурсныеСпецификации.ОписаниеИсточниковДанныхОперандов();
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	// [Ингредиенты]
	ПредставлениеИсточника = НСтр("ru = 'Ингредиенты';
										|en = 'Ingredients'");
	Описание = УправлениеДаннымиОбИзделиях.СоздатьОписанияИсточникаДанныхОперандов("Ингредиенты", ПредставлениеИсточника);
	
	//+пит
	ПредставлениеИсточника = НСтр("ru = 'КоличествоБрутто';
										|en = 'Quantity'");
	НовыйРеквизит = УправлениеДаннымиОбИзделиях.СоздатьОписанияРеквизитаИсточникаДанныхОперандов("КоличествоБрутто", ОписаниеТипаЧисло, ПредставлениеИсточника);
	Описание.Реквизиты.Добавить(НовыйРеквизит);
	
	ПредставлениеИсточника = НСтр("ru = 'КоличествоНетто';
										|en = 'Quantity'");
	НовыйРеквизит = УправлениеДаннымиОбИзделиях.СоздатьОписанияРеквизитаИсточникаДанныхОперандов("КоличествоНетто", ОписаниеТипаЧисло, ПредставлениеИсточника);
	Описание.Реквизиты.Добавить(НовыйРеквизит);
	
	ПредставлениеИсточника = НСтр("ru = 'КоличествоВыход';
										|en = 'Quantity'");
	НовыйРеквизит = УправлениеДаннымиОбИзделиях.СоздатьОписанияРеквизитаИсточникаДанныхОперандов("КоличествоВыход", ОписаниеТипаЧисло, ПредставлениеИсточника);
	Описание.Реквизиты.Добавить(НовыйРеквизит);
	//-пит
	
	Описание.СодержитСвойстваНоменклатуры = Истина;
	Описание.Коллекция                    = Истина;
	
	Результат.Вставить("Ингредиенты", Описание);
	
	// [Ингредиент]
	Описание = УправлениеДаннымиОбИзделиях.СоздатьОписанияИсточникаДанныхОперандов(НСтр("ru = 'Ингредиент';
																						|en = 'Ingredient'"), НСтр("ru = 'Ингредиент (текущая строка)';
																												|en = 'Ingredient (current line)'"));
	
	Описание.СодержитСвойстваНоменклатуры = Истина;
	Описание.ИмяТЧ = "Ингредиенты";
	
	Результат.Вставить("Ингредиент", Описание);
	
	Возврат Результат;
	
КонецФункции

// %ИзЕРП%
// УправлениеДаннымиОбИзделияхКлиентСервер.ДанныеОсновногоИзделияСпецификации
//
Функция ДанныеОсновногоИзделияСпецификации(Объект) Экспорт
	
	Результат = Новый Структура(
		"Номенклатура,
		|Характеристика,
		|Упаковка,
		|КоличествоУпаковок,
		|Количество");
	ЗаполнитьЗначенияСвойств(Результат, Объект);
	
	Возврат Результат;
	
КонецФункции

//////////////////////////////////////////
// Расчет количества в формульных строках

Функция ДанныеДляРасчетаПоФормулам(НаборДанных, ПартияВыпуска, ПараметрыРасчета)
	
	Перем ДанныеДляРасчета;
	
	Если Не ЗначениеЗаполнено(НаборДанных) Тогда
		Возврат ДанныеДляРасчета;
	КонецЕсли;
	
	#Область ОписаниеИсточников
	
	ОписаниеИсточников = ОписаниеИсточниковДанныхОперандов();
	ИсточникиЗначенийПараметров       = УправлениеДаннымиОбИзделиях.СоздатьТаблицуИсточниковЗначенийПараметровДляРасчетаПоФормулам();
	
	#КонецОбласти
	
	#Область ДанныеСпецификаций
	
	СтруктураДанных = Новый Структура("ОсновноеИзделие,Ингредиенты");
	
	ДанныеПоНоменклатуре = ДанныеПоНоменклатуреРасширенный();
	ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, ПараметрыРасчета.ДанныеПоНоменклатуре);
	
	//+пит
	//Если (НЕ ЗначениеЗаполнено(ПараметрыРасчета.СтруктураДанных)
	//		ИЛИ ПараметрыДляРасчета.Найти("ОсновноеИзделие",  "Ключ")  <> Неопределено И НЕ ПараметрыРасчета.СтруктураДанных.Свойство("ОсновноеИзделие")
	//		ИЛИ ПараметрыДляРасчета.Найти("ВыходныеИзделия",  "Ключ")  <> Неопределено И НЕ ПараметрыРасчета.СтруктураДанных.Свойство("ВыходныеИзделия")
	//		ИЛИ ПараметрыДляРасчета.Найти("ВозвратныеОтходы", "Ключ")  <> Неопределено И НЕ ПараметрыРасчета.СтруктураДанных.Свойство("ВозвратныеОтходы")
	//		ИЛИ ПараметрыДляРасчета.Найти("МатериалыИУслуги", "Ключ")  <> Неопределено И НЕ ПараметрыРасчета.СтруктураДанных.Свойство("МатериалыИУслуги")
	//	) Тогда
	//	ПараметрыВыборки = ПараметрыВыборкиДанных("ВыходныеИзделия, ВозвратныеОтходы, МатериалыИУслуги");
	//	ЗаполнитьЗначенияСвойств(СтруктураДанных, ДанныеСпецификации(ДанныеПоНоменклатуре, ПараметрыВыборки));
	//Иначе
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ПараметрыРасчета.СтруктураДанных);
	//КонецЕсли;
	//-пит
	
	#КонецОбласти
	
	#Область ИсточникиДанных
	
	ИсточникиДанных = СтруктураИсточниковДляРасчетаПоФормулам();
	
	// данные распоряжения по номенклатуре
	ИсточникиДанных.ДанныеПоНоменклатуре = ДанныеПоНоменклатуре;
	
	// основное изделие спецификации
	ОсновноеИзделие = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураДанных.ОсновноеИзделие);
	//+пит
	//РассчитатьКоличествоВСтроке(
	//	ПартияВыпуска,
	//	ОсновноеИзделие,
	//	Истина,
	//	Ложь,
	//	Ложь);
	//-пит
	ИсточникиДанных.ОсновноеИзделие = ОсновноеИзделие;
	
	// табличная часть Ингредиенты
	Если СтруктураДанных.Ингредиенты <> Неопределено Тогда
		
		Для каждого Строка Из СтруктураДанных.Ингредиенты Цикл
			
			//+пит
			//РассчитатьКоличествоВСтроке(ПартияВыпуска, Строка, Истина, Ложь, Ложь);
			//-пит
			НовСтрокаИнгр = ИсточникиДанных.Ингредиенты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаИнгр, Строка);
			НовСтрокаИнгр.КоличествоБрутто = Строка.КоличествоУпаковокБрутто;
			НовСтрокаИнгр.КоличествоНетто = Строка.КоличествоУпаковокНетто;
			НовСтрокаИнгр.КоличествоВыход = Строка.КоличествоУпаковокВыход;
			
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыДляРасчета
	
	ПараметрыДляРасчета = УправлениеДаннымиОбИзделиях.ПараметрыДляРасчетаПоФормулам(ОписаниеИсточников, НаборДанных);
	Если ПараметрыДляРасчета.Количество() = 0 Тогда
		Возврат ДанныеДляРасчета;
	КонецЕсли;
	
	//СтруктураОтбора = Новый Структура("Идентификатор", ДанныеПоНоменклатуре.Идентификатор);
	//ИсточникиДанных = СтруктураИсточниковДляРасчетаПоФормулам();
	//Для каждого КлючИЗначение Из ИсточникиДанных Цикл
	//	Если СтруктураДанных.Свойство(КлючИЗначение.Ключ) Тогда
	//		ИсточникиДанных[КлючИЗначение.Ключ] = СтруктураДанных[КлючИЗначение.Ключ];
	//	ИначеЕсли Таблицы.Свойство(КлючИЗначение.Ключ) Тогда
	//		ИсточникиДанных[КлючИЗначение.Ключ] = Таблицы[КлючИЗначение.Ключ].Скопировать(СтруктураОтбора);
	//	КонецЕсли;
	//КонецЦикла;
	//ИсточникиДанных.ДанныеПоНоменклатуре = ПараметрыРасчета.ДанныеПоНоменклатуре;
	
	УправлениеДаннымиОбИзделиях.ДополнитьТаблицуИсточниковЗначенийПараметровДляРасчетаПоФормулам(
		Документы.питРецептура,
		ИсточникиЗначенийПараметров,
		ИсточникиДанных,
		ОписаниеИсточников,
		ПараметрыДляРасчета);
	
	//++ НЕ УТКА
	УправлениеДаннымиОбИзделиях.ЗаполнитьЗначенияПараметровДляРасчетаПоФормулам(ИсточникиЗначенийПараметров);
	//-- НЕ УТКА
	
	#КонецОбласти
	
	ДанныеДляРасчета = УправлениеДаннымиОбИзделиях.ДанныеДляРасчетаПоФормулам(Документы.питРецептура, ПараметрыДляРасчета, ОписаниеИсточников, ИсточникиДанных);
	Возврат ДанныеДляРасчета;
	
КонецФункции

Процедура РассчитатьКоличествоВСтроке(ПартияВыпуска, Строка, ЕстьУпаковки, ЕстьРасчетПоФормуле, ЕстьВероятность, ДанныеДляРасчета = Неопределено)
	
	//+пит
	ЭтоУправлениеПредприятием = питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "УправлениеПредприятием";
	
	ВидКоличествДляРасчета = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питКоличествоДляРасчетаПоФормулеВРецептурах");
	Если НЕ ЗначениеЗаполнено(ВидКоличествДляРасчета) Тогда
		ВидКоличествДляРасчета = Перечисления.питВидыКоличеств.КоличествоБрутто;
	КонецЕсли;
	СуффиксКолонкиКоличеств = питОбщегоНазначенияКлиентСервер.СуффиксКолонкиКоличествПоВидуКоличеств(ВидКоличествДляРасчета);
	
	Если ЭтоУправлениеПредприятием Тогда
		//++ НЕ УТКА
		Если ЕстьРасчетПоФормуле И НЕ ПустаяСтрока(Строка.АлгоритмРасчетаКоличества) Тогда
			
			УправлениеДаннымиОбИзделиях.РассчитатьКоличествоПоФормуле(Строка, ДанныеДляРасчета, "КоличествоУпаковок"+СуффиксКолонкиКоличеств);
			
			Если ЕстьУпаковки Тогда
				
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", Новый Структура("Суффикс, НужноОкруглять", СуффиксКолонкиКоличеств, Ложь));
				
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);
				
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		//-- НЕ УТКА
	КонецЕсли;
	//-пит
	
	//+пит
	Если ЕстьУпаковки Тогда
		//ИмяПоляБазаДляРасчета = "КоличествоУпаковокНаЕдиницуПартииВыпуска";
		ИмяПоляБазаДляРасчета = "КоличествоУпаковок"+СуффиксКолонкиКоличеств;
	Иначе
		//ИмяПоляБазаДляРасчета = "КоличествоНаЕдиницуПартииВыпуска";
		ИмяПоляБазаДляРасчета = "Количество"+СуффиксКолонкиКоличеств;
	КонецЕсли;
	//-пит
	
	РезультатРасчета = Строка[ИмяПоляБазаДляРасчета] * ПартияВыпуска.Числитель / ПартияВыпуска.Знаменатель;
	
	//+пит
	//Если ЕстьВероятность И Строка.КоэффициентВероятности <> 1 Тогда
	//	РезультатРасчета = Окр(РезультатРасчета * Строка.КоэффициентВероятности, ?(Строка.УпаковкаШтучная, 0, 3));
	//КонецЕсли;
	
	//Если ЕстьУпаковки Тогда
	//	Строка.КоличествоУпаковокБрутто = РезультатРасчета;
	//	Строка.КоличествоБрутто         = Строка.КоличествоУпаковокБрутто * Строка.КоэффициентУпаковки;
	//Иначе
	//	Строка.Количество = РезультатРасчета;
	//КонецЕсли;
	//-пит
	
КонецПроцедуры

Процедура РассчитатьКоличество(ПартияВыпуска, Коллекция, ЕстьУпаковки, ЕстьРасчетПоФормуле, ЕстьВероятность, ДанныеДляРасчета = Неопределено)
	
	Для каждого Строка Из Коллекция Цикл
		
		РассчитатьКоличествоВСтроке(
			ПартияВыпуска,
			Строка,
			ЕстьУпаковки,
			ЕстьРасчетПоФормуле,
			ЕстьВероятность,
			ДанныеДляРасчета);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СтруктураИсточниковДляРасчетаПоФормулам() Экспорт
	
	ИсточникиДанных = Новый Структура;
	
	ИсточникиДанных.Вставить("ОсновноеИзделие");
	
	ИсточникиДанных.Вставить("Ингредиенты", УправлениеДаннымиОбИзделиях.СоздатьТаблицуИсточниковДанныхДляРасчетаПоФормулам());
	//+пит
	ИсточникиДанных.Ингредиенты.Колонки.Добавить("КоличествоБрутто", Новый ОписаниеТипов("Число"));
	ИсточникиДанных.Ингредиенты.Колонки.Добавить("КоличествоНетто", Новый ОписаниеТипов("Число"));
	ИсточникиДанных.Ингредиенты.Колонки.Добавить("КоличествоВыход", Новый ОписаниеТипов("Число"));
	//-пит
	
	ИсточникиДанных.Вставить("ДанныеПоНоменклатуре"); // данные по номенклатуре распоряжения
	
	Возврат ИсточникиДанных;
	
КонецФункции

Процедура ЗаполнитьПереченьДанныхСпецификации(ПереченьДанных)
	
	ПереченьДанных = Новый Массив;
	ПереченьДанных.Добавить("Ингредиенты");
	
КонецПроцедуры

Функция ПереченьДанныхСпецификации(СписокСвойств = "", ИсключаяСвойства = "")
	
	ПереченьДанных = Новый Массив;
	ЗаполнитьПереченьДанныхСпецификации(ПереченьДанных);
	
	ЕстьСписокСвойств = НЕ ПустаяСтрока(СписокСвойств);
	Если ЕстьСписокСвойств ИЛИ НЕ ПустаяСтрока(ИсключаяСвойства) Тогда
	
		Для Индекс = -ПереченьДанных.ВГраница() По 0 Цикл
			
			Свойство = ПереченьДанных[-Индекс];
			
			Если ЕстьСписокСвойств И СтрНайти(СписокСвойств, Свойство) = 0
				ИЛИ СтрНайти(ИсключаяСвойства, Свойство) > 0 
				Тогда
				ПереченьДанных.Удалить(-Индекс);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПереченьДанных;
	
КонецФункции

// Функция - конструктор структуры параметров расчета количества данных спецификаций.
//
// Параметры:
//  ДанныеПоНоменклатуре - Структура - см. ДанныеПоНоменклатуреРасширенный()
//  СтруктураДанных		 - Структура - данные спецификации (кеш данных спецификации)
//  СписокСвойств		 - Строка	 - список свойств структуры ДанныеСпецификации, которые необходимо рассчитать
//  ИсключаяСвойства	 - Строка	 - список свойств структуры ДанныеСпецификации, которые необходимо исключить из расчета
// 
// Возвращаемое значение:
//  Структура - параметры расчета количества
//
Функция ПараметрыРасчетаКоличества(ДанныеПоНоменклатуре, СтруктураДанных = Неопределено, СписокСвойств = "", ИсключаяСвойства = "") Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеПоНоменклатуре", ДанныеПоНоменклатуре);
	
	Результат.Вставить("СтруктураДанных", СтруктураДанных);
	Результат.Вставить("ПереченьДанных", ПереченьДанныхСпецификации(СписокСвойств, ИсключаяСвойства));
	
	Результат.Вставить("ИспользоватьОдновременноПроизводимоеКоличество", Истина);
	
	Возврат Результат;
	
КонецФункции

// Функция - конструктор структуры для выборки данных ресурсной спецификации.
//
// Возвращаемое значение:
//  Структура - структура с параметрами выборки данных спецификации.
//
Функция ДанныеПоНоменклатуреРасширенный() Экспорт
	
	ДанныеПоНоменклатуре = Новый Структура;
	
	ДанныеПоНоменклатуре.Вставить("Номенклатура");
	ДанныеПоНоменклатуре.Вставить("Характеристика");
	ДанныеПоНоменклатуре.Вставить("Спецификация");
	ДанныеПоНоменклатуре.Вставить("Рецептура");
	ДанныеПоНоменклатуре.Вставить("Количество");
	ДанныеПоНоменклатуре.Вставить("КоличествоУпаковок");
	ДанныеПоНоменклатуре.Вставить("Идентификатор", 0);
	
	
	Возврат ДанныеПоНоменклатуре;
	
КонецФункции

Процедура ДобавитьСтрокиДляРасчетаПоФормулам(НаборДанных, ДанныеСпецификации, ПереченьДанных)
	
	Отбор = Новый Структура("АлгоритмРасчетаКоличества", "");
	
	//+пит
	СоставТЧ = 
		СтрРазделить("Ингредиенты",",");
	//-пит
	
	Для каждого ИмяТЧ Из СоставТЧ Цикл
		
		Если ПереченьДанных.Найти(ИмяТЧ) <> Неопределено Тогда
			
			Если ДанныеСпецификации.Свойство(ИмяТЧ)
				И ДанныеСпецификации[ИмяТЧ].НайтиСтроки(Отбор).Количество() <> ДанныеСпецификации[ИмяТЧ].Количество() Тогда
				
				Если ДанныеСпецификации[ИмяТЧ].Колонки.Найти("Формула") = Неопределено Тогда
					ДанныеСпецификации[ИмяТЧ].Колонки.Добавить("Формула", Новый ОписаниеТипов("Строка"));
				КонецЕсли;
				
				НаборДанных.Добавить(ДанныеСпецификации[ИмяТЧ]);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИсточникДанныхДляРасчетаПоФормулам(ПутьКДанным, ИсточникиДанных) Экспорт
	
	Источник = Неопределено;
	
	Если ПутьКДанным.Ключ = "ОсновноеИзделие" Тогда
		
		Источник = УправлениеДаннымиОбИзделиях.СоздатьСтруктуруДанныхИсточникаДляРасчетаПоФормулам();
		ЗаполнитьЗначенияСвойств(Источник, ИсточникиДанных.ОсновноеИзделие);
		
	ИначеЕсли ПутьКДанным.Ключ = "Ингредиенты" Тогда
		
		ДанныеСтроки = ИсточникиДанных[ПутьКДанным.Ключ].Найти(ПутьКДанным.НомерСтроки, "НомерСтроки");
		Если ДанныеСтроки <> Неопределено Тогда
			Источник = УправлениеДаннымиОбИзделиях.СоздатьСтруктуруДанныхИсточникаДляРасчетаПоФормулам();
			//+пит
			Источник.Вставить("КоличествоБрутто");
			Источник.Вставить("КоличествоНетто");
			Источник.Вставить("КоличествоВыход");
			//-пит
			ЗаполнитьЗначенияСвойств(Источник, ДанныеСтроки);
		КонецЕсли;
		
	ИначеЕсли ПутьКДанным.Ключ = "Ингредиент" Тогда
		
		Источник = УправлениеДаннымиОбИзделиях.СоздатьСтруктуруДанныхИсточникаДляРасчетаПоФормулам();
		//+пит
		Источник.Вставить("КоличествоБрутто");
		Источник.Вставить("КоличествоНетто");
		Источник.Вставить("КоличествоВыход");
		//-пит
		ЗаполнитьЗначенияСвойств(Источник, ПутьКДанным.ДанныеСтроки);
		
	КонецЕсли;
	
	Возврат Источник;
	
КонецФункции


//<<===ПорталЮгКрым, Плотникова Н.Ю. [Исправление ошибок обновления]  
Функция пл_ВернутьВесовойКоэффициент(Пар)

	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("Коэф",0);
	СтруктураВозврат.Вставить("ВесЕдиницаИзмерения",Пар.Номенклатура.ВесЕдиницаИзмерения);
	
	мКоличествоВыход = Пар.КоличествоВыход;
	
	Если мКоличествоВыход = 0 Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	питРецептураИнгредиенты.КоличествоВыход КАК КоличествоВыход,
			|	питРецептураИнгредиенты.НомерСтроки КАК НомерСтроки,
			|	питРецептураИнгредиенты.Номенклатура КАК Номенклатура
			|ИЗ
			|	Документ.питРецептура.Ингредиенты КАК питРецептураИнгредиенты
			|ГДЕ
			|	питРецептураИнгредиенты.НомерСтроки = &НомерСтроки
			|	И питРецептураИнгредиенты.Ссылка = &Ссылка
			|	И питРецептураИнгредиенты.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", Пар.Номенклатура);
		Запрос.УстановитьПараметр("НомерСтроки", Пар.НомерСтроки);
		Запрос.УстановитьПараметр("Ссылка", Пар.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			мКоличествоВыход = ВыборкаДетальныеЗаписи.КоличествоВыход;
		КонецЦикла;
	
	КонецЕсли; 
	

	    Запрос = Новый Запрос;
		Запрос.Текст ="	
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА НЕ Номенклатура.ВесИспользовать
			|			ТОГДА 0
			|		иначе	
			|			Выбор когда Номенклатура.ВесЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения 
			|				Тогда 1
			|			КОГДА &КоличествоУпаковокВыход = 0
			|				ТОГДА 0
			//<<===ПорталЮгКрым, Плотникова Н.Ю. 22.11.2021 [исправление количества нетто/брутто при пересчете из одной единицы в другую]   
			//|			ИНАЧЕ &КоличествоВыход * Номенклатура.ВесЧислитель / ВЫБОР
			//|					КОГДА Номенклатура.ВесЗнаменатель = 0
			//|						ТОГДА 1
			//|					ИНАЧЕ Номенклатура.ВесЗнаменатель
			|			ИНАЧЕ &РассчитываемоеКоличество * &КоличествоВыход * Номенклатура.ВесЧислитель / ВЫБОР
			|					КОГДА Номенклатура.ВесЗнаменатель = 0
			|						ТОГДА 1
			|					ИНАЧЕ Номенклатура.ВесЗнаменатель
			|			КОНЕЦ / &КоличествоУпаковокВыход
			|		КОНЕЦ		
			|	КОНЕЦ КАК Коэф,
			|	Номенклатура.ВесЕдиницаИзмерения.Представление КАК ВесЕдиницаИзмерения
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура",Пар.Номенклатура);
		Запрос.УстановитьПараметр("КоличествоУпаковокВыход",Пар.КоличествоУпаковокВыход);
		Запрос.УстановитьПараметр("КоличествоВыход",мКоличествоВыход);
		//<<===ПорталЮгКрым, Плотникова Н.Ю. 22.11.2021 [исправление количества нетто/брутто при пересчете из одной единицы в другую]   
		Запрос.УстановитьПараметр("РассчитываемоеКоличество",Пар.РассчитываемоеКоличество);
		//>>===ПорталЮгКрым === Плотникова Н.Ю. 22.11.2021  
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
		    ЗаполнитьЗначенияСвойств(СтруктураВозврат,Выборка);
		КонецЕсли; 
	возврат СтруктураВозврат;

КонецФункции 

//>>===ПорталЮгКрым === Плотникова Н.Ю. 01.10.2021  
//<< Швецов. 20.02.2023. Представление документа в отчетах
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если Данные.Ссылка = Неопределено Тогда
		СтандартнаяОбработка = ИСТИНА;
		Иначе
		СтандартнаяОбработка = Ложь;
		Представление = Данные.Ссылка.Номенклатура;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Документы.питРецептура.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.5.5";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("70a6a7b0-b83a-469a-9520-70ed16399bac");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.питРецептура.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет реквизит АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы.';
	|en = 'Fills in АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы attribute'");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Документы.питРецептура.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Документы.питРецептура.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Документ.питРецептура";
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Ссылка.Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	питРецептура.Ссылка
	|ИЗ
	|	Документ.питРецептура КАК питРецептура
	|ГДЕ
	|	НЕ питРецептура.ПометкаУдаления
	|");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Документ.питРецептура";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	ДополнительныеПараметры.ИмяВременнойТаблицы = "ВТСсылкиДляОбработки";
	
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуСсылокДляОбработки(
		Параметры.Очередь,
		ПолноеИмяОбъекта,
		МенеджерВременныхТаблиц,
		ДополнительныеПараметры);
	
	Если НЕ Результат.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	ПустойУИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТаблицаСсылок.Ссылка              КАК Ссылка,
	|	ТаблицаСсылок.Ссылка.ВерсияДанных КАК ВерсияДанных
	|ИЗ
	|	ВТСсылкиДляОбработки КАК ТаблицаСсылок
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			Блокировка.Добавить(ПолноеИмяОбъекта).УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			Объект = ОбновлениеИнформационнойБазыУТ.ПроверитьПолучитьОбъект(Выборка.Ссылка, Выборка.ВерсияДанных, Параметры.Очередь);
			
			Если Объект <> Неопределено Тогда
				
				ОбъектИзменен = Ложь;
				
				РаботаСФормулами.ПреобразоватьВФорматИдентификаторовВыражениеФормулОбъектаПланированияПроизводства(
					Объект, ОбъектИзменен);
				
				Если ОбъектИзменен Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
				Иначе
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				КонецЕсли;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Выборка.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

//+25
#Область Новое

// Получает значение основного реквизита по данным основного изделия спецификации
//
// Параметры:
//  Объект  - СправочникОбъект.РесурсныеСпецификации, Структура - спецификация.
//  ОсновноеИзделие - Структура - см. ДанныеОсновногоИзделияСпецификации
// 
// Возвращаемое значение:
//  Структура - данные основного реквизита
//
Функция ОсновнойРеквизитОсновногоИзделияСпецификации(Объект, ОсновноеИзделие = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Если ОсновноеИзделие = Неопределено Тогда
		ОсновноеИзделие = ДанныеОсновногоИзделияСпецификации(Объект);
	КонецЕсли;
	
	Если Объект.ВариантНазначения = ПредопределенноеЗначение("Перечисление.ВариантыНазначенияСпецификации.ВидНоменклатуры") Тогда
		Результат.Вставить("Имя", "ВидНоменклатуры");
	Иначе
		Результат.Вставить("Имя", "Номенклатура");
	КонецЕсли;
	
	Результат.Вставить("Значение", ОсновноеИзделие[Результат.Имя]);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Функция формирует печатную форму "Этикетка"
//
// Возвращаемое значение:
//  Сформированный табличный документ:
//
Функция ВИП_ПечатьЭтикетки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено)  
	
	//<< Каюмов А.А., ВиП, 25.09.2023, I-143. Печать этикеток из рецептур 	  
	
	УстановитьПривилегированныйРежим(Истина);
	ДатаЭтикетки = ПараметрыПечати.СтруктураПараметровЭтикетка.ДатаЭтикетки;
	КоличествоЭтикеток = ПараметрыПечати.СтруктураПараметровЭтикетка.КоличествоЭтикеток;
	 
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Этикетка"; 
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ВысотаСтраницы = 40;
	ТабличныйДокумент.ШиринаСтраницы = 60;
	ТабличныйДокумент.ИмяПринтера = "Zebra"; 
	
	Если КоличествоЭтикеток > 0 Тогда   
		ТабличныйДокумент.КоличествоЭкземпляров = КоличествоЭтикеток;
		
	КонецЕсли;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.питРецептура.ВИП_ПФ_MXL_Этикетка");
	ТЗ_Шапка = ВИП_ПолучитьДанныеПечати(МассивОбъектов); 
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
			
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		НайденныеРеквизитыШапки = ТЗ_Шапка.НайтиСтроки(Новый Структура("Ссылка",ДокументСсылка.Ссылка)); 
		Если НайденныеРеквизитыШапки.Количество() > 0 Тогда
			ОбластьШапка.Параметры.Заполнить(НайденныеРеквизитыШапки[0]);
		Иначе
			Продолжить;
		КонецЕсли; 
		
		ОбластьШапка.Параметры.ДатаВремя = ДатаЭтикетки;
		ТабличныйДокумент.Вывести(ОбластьШапка);

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	//>>  
	
КонецФункции	

Функция ВИП_ПолучитьДанныеПечати(МассивОбъектов) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	питРецептура.Ссылка КАК Ссылка,
	               |	питРецептура.ВИП_ЭтикеткаНаименование КАК ВИП_ЭтикеткаНаименование,
	               |	питРецептура.ВИП_ЭтикеткаГОСТ КАК ВИП_ЭтикеткаГОСТ,
	               |	питРецептура.ВИП_ЭтикеткаТемператураХранения КАК ВИП_ЭтикеткаТемператураХранения,
	               |	питРецептура.ВИП_ЭтикеткаСрокХранения КАК ВИП_ЭтикеткаСрокХранения,
	               |	питРецептура.ВИП_ЭтикеткаЖиры КАК ВИП_ЭтикеткаЖиры,
	               |	питРецептура.ВИП_ЭтикеткаБелки КАК ВИП_ЭтикеткаБелки,
	               |	питРецептура.ВИП_ЭтикеткаУглеводы КАК ВИП_ЭтикеткаУглеводы,
	               |	питРецептура.ВИП_ЭтикеткаКалорийность КАК ВИП_ЭтикеткаКалорийность,
	               |	питРецептура.ВИП_ЭтикеткаСостав КАК ВИП_ЭтикеткаСостав
	               |ИЗ
	               |	Документ.питРецептура КАК питРецептура
	               |ГДЕ
	               |	питРецептура.Ссылка В(&МассивОбъектов)"; 
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 
//-25

// --- 26.07.2024 Адель перенесено в конец модуля
#КонецЕсли
