#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.1.377");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "1.3";
	ПараметрыРегистрации.Информация = НСтр("ru = 'Сверка продаж с чеками (Портал)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());

	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецЕсли

