#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МодульАкцизныеМаркиЕГАИС = ОбщегоНазначения.ОбщийМодуль("АкцизныеМаркиЕГАИС");
	МодульИнтеграцияЕГАИСПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЕГАИСПереопределяемый");
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МодульАкцизныеМаркиЕГАИС.ПроверитьЗаполнениеАкцизныхМарок(ЭтотОбъект, Отказ, Истина);
	
	МодульИнтеграцияЕГАИСПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	МодульпитИнтеграцияЕГАИС = ОбщегоНазначения.ОбщийМодуль("питИнтеграцияЕГАИС");
	МодульИнтеграцияЕГАИСПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЕГАИСПереопределяемый");
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	МодульпитИнтеграцияЕГАИС.ЗаписатьСоответствиеНоменклатуры(ЭтотОбъект, Истина);
	
	МодульИнтеграцияЕГАИСПереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование       = Неопределено;
	Идентификатор           = "";
	ИдентификаторЕГАИС      = "";
	ДатаРегистрацииДвижений = '00010101';
	
	Если Товары.Количество() > 0 Тогда
		Товары.ЗагрузитьКолонку(Новый Массив(Товары.Количество()), "Справка2");
	КонецЕсли;
	АкцизныеМарки.Очистить();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированныйУчетПодсистемы") Тогда
		МодульЗаполнениеДокументов = ОбщегоНазначения.ОбщийМодуль("ЗаполнениеДокументов");
		МодульЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.АктВскрытияТарыАлкоПроудукции;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтруктураДополнительныеСвойства = Новый Структура;
	СтруктураДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	СтруктураДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("МоментВремени", МоментВремени());
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("МоментКонтроля", МоментВремени());
	
	Документы.питАктВскрытияТарыАлкогольнойПродукции.ИнициализироватьДанныеДокумента(ЭтотОбъект.Ссылка, СтруктураДополнительныеСвойства);
	
	Для каждого КлючИЗначение Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений Цикл
		ДвжиенияРегистр = Движения[КлючИЗначение.Ключ];
		ДвжиенияРегистр.Записывать = Истина;
		ДвжиенияРегистр.Загрузить(КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
