/////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ДОКУМЕНТАМИ ТИПОВЫХ КОНФИГУРАЦИЙ

#Область ПрограммныйИнтерфейс

// Процедура ищет типовой документ для документа пит
//
// Параметры:
//  вхДокументпит	 - ДокументСсылка	 - Ссылка на документ, для которого ищем типовой.
//  выхТиповойДокумент	 - ДокументСсылка	 - Найденный типовой документ.
//  выхПредупреждение	 - Строка			 - Текст предупреждения в случае ошибки
// 
// Возвращаемое значение:
//  Истина - Хотя бы один типовой документ найден.
//  Ложь - Ни одного типового документа не найдено.
//
Функция НайтиТиповойДокументДляДокументапит(вхДокументпит, выхТиповойДокумент = Неопределено, выхПредупреждение = "", СтруктураПараметров = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Инициализируем структуру параметров
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли;
	
	УпорядочитьПоДатеИНомеру = Истина;
	Если СтруктураПараметров.Свойство("УпорядочитьПоДатеИНомеру") Тогда
		УпорядочитьПоДатеИНомеру = СтруктураПараметров.УпорядочитьПоДатеИНомеру;
	КонецЕсли;
	
	УпорядочитьПоМоментуВремени = Истина; // Только если не упорядочиваем по дате и номеру.
	Если СтруктураПараметров.Свойство("УпорядочитьПоМоментуВремени") Тогда
		УпорядочитьПоМоментуВремени = СтруктураПараметров.УпорядочитьПоМоментуВремени;
	КонецЕсли;
	
	ФильтрПоТипу = "";
	Если СтруктураПараметров.Свойство("ФильтрПоТипу") Тогда
		ФильтрПоТипу = СтруктураПараметров.ФильтрПоТипу;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	%ФильтрПоДокументамОбщепит% ";
	
	Если ТипЗнч(ФильтрПоТипу) = Тип("Массив") И ФильтрПоТипу.Количество() Тогда
		Запрос.Текст = Запрос.Текст + "
		|И ( ";
		Итерация = 1;
		Для каждого ТекФильтр Из ФильтрПоТипу Цикл
			Запрос.Текст = Запрос.Текст + ?(Итерация = 1, "", " ИЛИ ");
			Запрос.Текст = Запрос.Текст + "
			| питТиповыеДокументы.ТиповойДокумент ССЫЛКА " + ТекФильтр + " ";
			Итерация = Итерация + 1;
		КонецЦикла;
		Запрос.Текст = Запрос.Текст + " )";
	ИначеЕсли ТипЗнч(ФильтрПоТипу) = Тип("Строка") И НЕ ПустаяСтрока(ФильтрПоТипу) Тогда
		Запрос.Текст = Запрос.Текст + "
		|И питТиповыеДокументы.ТиповойДокумент ССЫЛКА " + ФильтрПоТипу + " ";
	КонецЕсли;
	
	Если УпорядочитьПоДатеИНомеру Тогда
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО
		|	питТиповыеДокументы.ТиповойДокумент.Дата УБЫВ,
		|	питТиповыеДокументы.ТиповойДокумент.Номер УБЫВ";
	ИначеЕсли УпорядочитьПоМоментуВремени Тогда
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО
		|	питТиповыеДокументы.ТиповойДокумент.МоментВремени УБЫВ";
	КонецЕсли;
	
	// Если передали массив входных доков, то фильтр на "В".
	Если ТипЗнч(вхДокументпит) = Тип("Массив") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ФильтрПоДокументамОбщепит%", " питТиповыеДокументы.ДокументОбщепит В (&Документпит) ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ФильтрПоДокументамОбщепит%", " питТиповыеДокументы.ДокументОбщепит = &Документпит ");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документпит",вхДокументпит);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	выхТиповойДокумент = Новый Массив;
	Результат = Ложь;
	
	текстТиповыеДокументы = "";
	
	мВидДокумента = Неопределено;
	Пока РезультатЗапроса.Следующий() Цикл
		//Если мВидДокумента <> ТипЗнч(РезультатЗапроса.ТиповойДокумент) Тогда
			выхТиповойДокумент.Добавить(РезультатЗапроса.ТиповойДокумент);
			текстТиповыеДокументы = текстТиповыеДокументы + "
				|	- " + РезультатЗапроса.ТиповойДокумент + ";";
			Результат = Истина;
			//мВидДокумента = ТипЗнч(РезультатЗапроса.ТиповойДокумент);
		//КонецЕсли;
	КонецЦикла;
	
	Если текстТиповыеДокументы <> "" Тогда
		текстТиповыеДокументы = Лев(текстТиповыеДокументы, СтрДлина(текстТиповыеДокументы)-1);
	КонецЕсли;
	
	Если выхТиповойДокумент.Количество() = 0 Тогда
		выхТиповойДокумент = Неопределено;
	ИначеЕсли выхТиповойДокумент.Количество() = 1 Тогда
		выхТиповойДокумент = выхТиповойДокумент[0];
	КонецЕсли;
	
	Если выхТиповойДокумент <> Неопределено Тогда
		выхПредупреждение = "Для данного документа сформированы документы типовой конфигурации:" + текстТиповыеДокументы;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Процедура ищет документ пит для типового документа
//
// Параметры:
//  вхТиповойДокумент	 - ДокументСсылка	 - Ссылка на документ, для которого ищем документ "пит".
//  выхДокументпит	 - ДокументСсылка	 - Найденный документ "пит".
//  выхПредупреждение	 - Строка			 - Текст предупреждения в случае ошибки
// 
// Возвращаемое значение:
//  Истина - Хотя бы один документ найден.
//  Ложь - Ни одного документа не найдено.
//
Функция НайтиДокументпитДляТиповогоДокумента(вхТиповойДокумент, выхДокументпит = Неопределено, выхПредупреждение = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ТипЗнч(вхТиповойДокумент) = Тип("Массив") Тогда
		МассивТиповых = Новый Массив(1);
		МассивТиповых[0] = вхТиповойДокумент;
	Иначе
		МассивТиповых = вхТиповойДокумент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	питТиповыеДокументы.ДокументОбщепит
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ТиповойДокумент В (&МассивТиповых)
	|
	|УПОРЯДОЧИТЬ ПО
	|	питТиповыеДокументы.ДокументОбщепит.Дата УБЫВ,
	|	питТиповыеДокументы.ДокументОбщепит.Номер УБЫВ";
	
	Запрос.УстановитьПараметр("МассивТиповых", МассивТиповых);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	выхДокументпит = Новый Массив;
	Результат = Ложь;
	
	текстДокументыпит = "";
	
	мВидДокумента = Неопределено;
	Пока РезультатЗапроса.Следующий() Цикл
		Если мВидДокумента <> ТипЗнч(РезультатЗапроса.ДокументОбщепит) Тогда
			выхДокументпит.Добавить(РезультатЗапроса.ДокументОбщепит);
			текстДокументыпит = текстДокументыпит + РезультатЗапроса.ДокументОбщепит + ";";
			Результат = Истина;
			мВидДокумента = ТипЗнч(РезультатЗапроса.ДокументОбщепит);
		КонецЕсли;
	КонецЦикла;
	
	Если текстДокументыпит <> "" Тогда
		текстДокументыпит = Лев(текстДокументыпит, СтрДлина(текстДокументыпит)-1);
	КонецЕсли;
	
	Если выхДокументпит.Количество() = 0 Тогда
		выхДокументпит = Неопределено;
	ИначеЕсли выхДокументпит.Количество() = 1 Тогда
		выхДокументпит = выхДокументпит[0];
	КонецЕсли;
	
	Если выхДокументпит <> Неопределено Тогда
		выхПредупреждение = "Данный документ сформирован документом пит:" + текстДокументыпит + ".";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Функция создает типовые документы для переданного документа подсистемы "пит".
//  В случае, если типовые документы уже созданы, то функция обновит существующие.
//
// Параметры:
//  Документпит			 - ДокументСсылка	 - Ссылка на документ пита, по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументы(Документпит, СтруктураПараметров, тблСозданныеДокументы = Неопределено, ТекстОшибки = "") Экспорт
	
	ВсеОк = Истина;
	
	// Проверка допустимости текущего режима производства.
	РежимПроизводстваРазрешен = Истина;
	Если НЕ СтруктураПараметров.Свойство("РежимПроизводстваРазрешен") Тогда
		ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
		РежимПроизводстваРазрешен = питОбщегоНазначения.ПроверитьРежимПроизводстваERP(ФормироватьДокументыПроизводства22, ТекстОшибки);
	Иначе
		РежимПроизводстваРазрешен = СтруктураПараметров.РежимПроизводстваРазрешен;
	КонецЕсли;
	Если НЕ РежимПроизводстваРазрешен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//+БазовоеСмещение
	Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
		СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
	КонецЕсли;
	//-БазовоеСмещение
	
	// Создание описания результирующей таблицы.
	Если тблСозданныеДокументы = Неопределено Тогда
		тблСозданныеДокументы = Новый ТаблицаЗначений;
		тблСозданныеДокументы.Колонки.Добавить("ДокументОбщепит");
		тблСозданныеДокументы.Колонки.Добавить("ТиповойДокумент");
		тблСозданныеДокументы.Колонки.Добавить("ПричинаТиповогоДокумента"	, Новый ОписаниеТипов("Число"));
		тблСозданныеДокументы.Колонки.Добавить("Синхронизирован"			, Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Вызов функции непосредственного создания типовых документов, в зависимости от типа переданного документа пит.
	Если ТипЗнч(Документпит) = Тип("ДокументСсылка.питПланМеню") Тогда 
		ВсеОк = СформироватьТиповыеДокументыПоПлануМеню(Документпит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	ИначеЕсли ТипЗнч(Документпит) = Тип("ДокументСсылка.питРазделка") Тогда 
		ВсеОк = СформироватьТиповыеДокументыПоРазделке(Документпит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	ИначеЕсли ТипЗнч(Документпит) = Тип("ДокументСсылка.питВыпускБлюд") Тогда
		ВсеОк = СформироватьТиповыеДокументыПоВыпускуБлюд(Документпит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	ИначеЕсли ТипЗнч(Документпит) = Тип("ДокументСсылка.питРецептура") Тогда
		ВсеОк = СформироватьТиповыеДокументыПоРецептуре(Документпит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если ВсеОк И СтруктураПараметров.Свойство("питСообщениеПоРецептуре")
			И НЕ ПустаяСтрока(СтруктураПараметров.питСообщениеПоРецептуре) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.питСообщениеПоРецептуре, СтруктураПараметров.питСсылкаНаСпецификацию);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Документпит) = Тип("ДокументСсылка.питРегистрацияЗамен") Тогда
		ВсеОк = СформироватьТиповыеДокументыПоРегистрацииЗамен(Документпит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	ИначеЕсли ТипЗнч(Документпит) = Тип("ДокументСсылка.питИнвентаризацияТоваров") Тогда
		ВсеОк = СформироватьТиповыеДокументыПоИнвентаризацииТоваровОбщепит(Документпит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	ИначеЕсли ТипЗнч(Документпит) = Тип("ДокументСсылка.питПеремещениеНоменклатурыСкладаПроизводства") Тогда
		ВсеОк = СформироватьТиповыеДокументыПоПеремещениюНоменклатурыСкладаПроизводства(Документпит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	Иначе
		//...
	КонецЕсли;
	
	// Обновление регистра "Типовые документы".
	Если ВсеОк Тогда
		ВсеОк = ОбновитьРегистрТиповыеДокументы(тблСозданныеДокументы, ТекстОшибки);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВсеОк;
	
КонецФункции

// Функция устанавливает ресурс "Синхронизирован" в регистре "Типовые документы" для всех записей
//  с переданным значением "Документпит"
//
// Параметры:
//  Документпит	 - ДокументСсылка	 - Ссылка на документ "пит".
//  Синхронизирован	 - Булево			 - Значение флага синхронизации, которое будет установлено.
//  ТекстОшибки		 - Строка			 - Текст ошибки в случае возникновения ошибки выполнения.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция УстановитьСинхронизациюТиповыхДокументов(Документпит = Неопределено, ТиповойДокумент = Неопределено, Синхронизирован,ТекстОшибки = "") Экспорт
	
	// >> Швецов. ERP-5846. Ошибки при блокировке
	Возврат MRS_ЗагрузкаПродажСервер.УстановитьСинхронизациюТиповыхДокументов(Документпит, ТиповойДокумент, Синхронизирован, ТекстОшибки = "");
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗап = РегистрыСведений.питТиповыеДокументы.СоздатьНаборЗаписей();
	НаборЗап.Отбор.Сбросить();
	
	Запрос = Новый Запрос;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.питТиповыеДокументы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ТекстОтбор = "";
	
	Если НЕ Документпит = Неопределено Тогда
		НаборЗап.Отбор.ДокументОбщепит.Установить(Документпит, Истина);
		ЭлементБлокировки.УстановитьЗначение("ДокументОбщепит", Документпит);
		ТекстОтбор = ТекстОтбор + ?(ПустаяСтрока(ТекстОтбор), " ГДЕ ", " И ") + " питТиповыеДокументы.ДокументОбщепит = &ДокументОбщепит ";
		Запрос.УстановитьПараметр("ДокументОбщепит", Документпит);
	КонецЕсли;
	
	Если НЕ ТиповойДокумент = Неопределено Тогда
		НаборЗап.Отбор.ТиповойДокумент.Установить(ТиповойДокумент, Истина);
		ЭлементБлокировки.УстановитьЗначение("ТиповойДокумент", ТиповойДокумент);
		ТекстОтбор = ТекстОтбор + ?(ПустаяСтрока(ТекстОтбор), " ГДЕ ", " И ") + " питТиповыеДокументы.ТиповойДокумент = &ТиповойДокумент ";
		Запрос.УстановитьПараметр("ТиповойДокумент", ТиповойДокумент);
	КонецЕсли;
		
	Блокировка.Заблокировать();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ДокументОбщепит КАК ДокументОбщепит,
	|	питТиповыеДокументы.ТиповойДокумент КАК ТиповойДокумент,
	|	питТиповыеДокументы.Синхронизирован КАК Синхронизирован,
	|	питТиповыеДокументы.ПричинаТиповогоДокумента КАК ПричинаТиповогоДокумента
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|%ТекстОтбор%
	|";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТекстОтбор%", ТекстОтбор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяЗапись = НаборЗап.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Для каждого ТекЗапись Из НаборЗап Цикл
		ТекЗапись.Синхронизирован = Синхронизирован;
	КонецЦикла;
	
	Попытка
		НаборЗап.Записать();
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ТекстОшибки = "Ошибка записи! Не удалось обновить синхронизацию типовых документов по причине: 
		|< "+ ОписаниеОшибки() + " >";
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

// Функция получает массив типовых документов для переданного документа Общепит по режиму производства
//
// Параметры:
//  ДокументОбщепит	 - ДокументСсылка,ДокументОбъект - Ссылка на документ или объект документа Общепит, 
//   для которого требуется найти типовые документы.
//  Режим			 - Строка - Строка, определяющая режим производства. Корректные значения: "2.1", "2.2", "","Общие".
//   В случае передачи пустой строки возвращаются все найденные документы без учета режима.
//  ТекстСообщения	 - Строка - Переменная, в которую будет записано сообщение для вывода пользователю.
// 
// Возвращаемое значение:
//  Массив - Массив ссылок на типовые документы ERP, связанные с переданным документов Общепит.
//
Функция ПолучитьТиповыеДокументыДляДокументаПитПоРежимуПроизводства(ДокументОбщепит, Режим = "2.2", ТекстСообщения = "") Экспорт
	
	ИмяДокументаВнутреннееПотребление = питОбратнаяСовместимостьПовтИсп.ИмяДокументаВнутреннееПотребление();
	
	ТиповыеДокументы = Неопределено;
	
	ФильтрПоТипу = Новый Массив;
	Если ТипЗнч(ДокументОбщепит) = Тип("ДокументСсылка.питВыпускБлюд")
		ИЛИ ТипЗнч(ДокументОбщепит) = Тип("ДокументОбъект.питВыпускБлюд") Тогда
		
		Если Режим = "2.1" Тогда
			Если НЕ питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "ERPWE" Тогда
				ФильтрПоТипу.Добавить("Документ.СписаниеЗатратНаВыпуск");
				ФильтрПоТипу.Добавить("Документ.ВыпускПродукции");
				ФильтрПоТипу.Добавить("Документ.ПередачаМатериаловВПроизводство");
			КонецЕсли;
		ИначеЕсли Режим = "2.2" Тогда
			ФильтрПоТипу.Добавить("Документ.ПроизводствоБезЗаказа");
			ФильтрПоТипу.Добавить("Документ.ДвижениеПродукцииИМатериалов");
		ИначеЕсли Режим = "Общие" Тогда
			ФильтрПоТипу.Добавить("Документ.ПеремещениеТоваров");
			ФильтрПоТипу.Добавить("Документ.ОтчетОРозничныхПродажах");
			ФильтрПоТипу.Добавить("Документ.ОприходованиеИзлишковТоваров");
			ФильтрПоТипу.Добавить("Документ.СписаниеНедостачТоваров");
			ФильтрПоТипу.Добавить("Документ.ОрдерНаОтражениеНедостачТоваров");
			ФильтрПоТипу.Добавить(СтрШаблон("Документ.%1", ИмяДокументаВнутреннееПотребление));
			ФильтрПоТипу.Добавить("Документ.РеализацияТоваровУслуг");
			ФильтрПоТипу.Добавить("Документ.питКорректировкаОстатковИС");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОбщепит) = Тип("ДокументСсылка.питРазделка")
		ИЛИ ТипЗнч(ДокументОбщепит) = Тип("ДокументОбъект.питРазделка") Тогда
		
		Если Режим = "2.1" Тогда
			Если НЕ питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "ERPWE" Тогда
				ФильтрПоТипу.Добавить("Документ.СборкаТоваров");
				ФильтрПоТипу.Добавить("Документ.СписаниеЗатратНаВыпуск");
				ФильтрПоТипу.Добавить("Документ.ВыпускПродукции");
				ФильтрПоТипу.Добавить("Документ.ПередачаМатериаловВПроизводство");
			КонецЕсли;
		ИначеЕсли Режим = "2.2" Тогда
			ФильтрПоТипу.Добавить("Документ.ПроизводствоБезЗаказа");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОбщепит) = Тип("ДокументСсылка.питПланМеню")
		ИЛИ ТипЗнч(ДокументОбщепит) = Тип("ДокументОбъект.питПланМеню") Тогда
		
		Если Режим = "2.1" Тогда
			
		ИначеЕсли Режим = "2.2" Тогда
			
		ИначеЕсли Режим = "Общие" Тогда
			ФильтрПоТипу.Добавить("Документ.ЗаказМатериаловВПроизводство");
			ФильтрПоТипу.Добавить("Документ.ЗаказНаПеремещение");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОбщепит) = Тип("ДокументСсылка.питРецептура")
		ИЛИ ТипЗнч(ДокументОбщепит) = Тип("ДокументОбъект.питРецептура") Тогда
		
		Если Режим = "2.1" Тогда
			
		ИначеЕсли Режим = "2.2" Тогда
			
		ИначеЕсли Режим = "Общие" Тогда
			ФильтрПоТипу.Добавить("Справочник.РесурсныеСпецификации");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОбщепит) = Тип("ДокументСсылка.питРегистрацияЗамен")
		ИЛИ ТипЗнч(ДокументОбщепит) = Тип("ДокументОбъект.питРегистрацияЗамен") Тогда
		
		Если Режим = "2.1" Тогда
			
		ИначеЕсли Режим = "2.2" Тогда
			
		ИначеЕсли Режим = "Общие" Тогда
			ФильтрПоТипу.Добавить("Документ.питРегистрацияЗамен");
			ФильтрПоТипу.Добавить("Документ.РазрешениеНаЗаменуМатериалов");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОбщепит) = Тип("ДокументСсылка.питИнвентаризацияТоваров")
		ИЛИ ТипЗнч(ДокументОбщепит) = Тип("ДокументОбъект.питИнвентаризацияТоваров") Тогда
		
		Если Режим = "2.1" Тогда
			
		ИначеЕсли Режим = "2.2" Тогда
			
		ИначеЕсли Режим = "Общие" Тогда
			ФильтрПоТипу.Добавить("Документ.ПересчетТоваров");
			ФильтрПоТипу.Добавить("Документ.ОприходованиеИзлишковТоваров");
			ФильтрПоТипу.Добавить("Документ.СписаниеНедостачТоваров");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОбщепит) = Тип("ДокументСсылка.питПеремещениеНоменклатурыСкладаПроизводства")
		ИЛИ ТипЗнч(ДокументОбщепит) = Тип("ДокументОбъект.питПеремещениеНоменклатурыСкладаПроизводства") Тогда
		
		Если Режим = "2.1" Тогда
			
		ИначеЕсли Режим = "2.2" Тогда
			
		ИначеЕсли Режим = "Общие" Тогда
			ФильтрПоТипу.Добавить("Документ.ПроизводствоБезЗаказа");
			ФильтрПоТипу.Добавить("Документ.ДвижениеПродукцииИМатериалов");
			ФильтрПоТипу.Добавить("Документ.ПеремещениеТоваров");
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Режим) И НЕ ФильтрПоТипу.Количество() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	// Получение типовых документов с фильтром по типу.
	ПараметрыПолучения = Новый Структура("УпорядочитьПоДатеИНомеру, УпорядочитьПоМоментуВремени, ФильтрПоТипу", Ложь, Истина, ФильтрПоТипу);
	НайтиТиповойДокументДляДокументапит(ДокументОбщепит, ТиповыеДокументы, ТекстСообщения, ПараметрыПолучения);
	Если ТиповыеДокументы = Неопределено Тогда
		Возврат Новый Массив;
	ИначеЕсли НЕ ТипЗнч(ТиповыеДокументы) = Тип("Массив") Тогда
		МассивТиповых = Новый Массив(1);
		МассивТиповых[0] = ТиповыеДокументы;
		Возврат МассивТиповых;
	КонецЕсли;
	
	Возврат ТиповыеДокументы; // По умолчанию, если все хорошо и нашелся массив документов.
	
КонецФункции

// Процедура ищет типовой документ для документа пит
//
// Параметры:
//  вхДокументпит	 - ДокументСсылка	 - Ссылка на документ, для которого ищем типовой.
//  выхТиповойДокумент	 - ДокументСсылка	 - Найденный типовой документ.
//  выхПредупреждение	 - Строка			 - Текст предупреждения в случае ошибки
// 
// Возвращаемое значение:
//  Истина - Хотя бы один типовой документ найден.
//  Ложь - Ни одного типового документа не найдено.
//
Функция ЗапретитьРаспределениеЗапасов(НаборЗаписейРегистрПотребностей) Экспорт
	
	Результат = Ложь;
	
	ТиповойДокументСсылка = НаборЗаписейРегистрПотребностей.Отбор.Регистратор.Значение;
	ДополнительныеСвойства = НаборЗаписейРегистрПотребностей.ДополнительныеСвойства;
	
	Если ДополнительныеСвойства.Свойство("СвойстваДокумента") 
		И ДополнительныеСвойства.СвойстваДокумента.Свойство("питДокументОбщепитРаспределениеЗапасов") Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТипыДокументовОбщепит = Новый Массив;
	ТипыДокументовОбщепит.Добавить(Тип("ДокументСсылка.питПланМеню"));
	ТипыДокументовОбщепит.Добавить(Тип("ДокументСсылка.питВыпускБлюд"));
	ТипыДокументовОбщепит.Добавить(Тип("ДокументСсылка.питЗаказНаПеремещениеВНоменклатуруПроизводства"));
	ТипыДокументовОбщепит.Добавить(Тип("ДокументСсылка.питПеремещениеНоменклатурыСкладаПроизводства"));
	
	выхДокументпит = Неопределено;
	ПричинаТиповогоДокумента = -1;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	питТиповыеДокументы.ДокументОбщепит КАК ДокументОбщепит,
	|	питТиповыеДокументы.ПричинаТиповогоДокумента КАК ПричинаТиповогоДокумента
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ТиповойДокумент = &ТиповойДокументСсылка
	|";
	Запрос.УстановитьПараметр("ТиповойДокументСсылка", ТиповойДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		выхДокументпит = Выборка.ДокументОбщепит;
		ПричинаТиповогоДокумента = Выборка.ПричинаТиповогоДокумента;
	КонецЕсли;
	
	Если НЕ выхДокументпит = Неопределено Тогда
		Если ТипЗнч(выхДокументпит) = Тип("ДокументСсылка.питВыпускБлюд") Тогда
			ДокОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(выхДокументпит, "ДокументОснование");
			Результат = ЗначениеЗаполнено(ДокОснование) И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.питПланМеню")
				И (ТипЗнч(ТиповойДокументСсылка) = (ТипЗнч(ТиповойДокументСсылка) = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") И ПричинаТиповогоДокумента = 1)
				ИЛИ ТипЗнч(ТиповойДокументСсылка) = Тип("ДокументСсылка.ПроизводствоБезЗаказа")
				ИЛИ ТипЗнч(ТиповойДокументСсылка) = Тип("ДокументСсылка.ПеремещениеТоваров"));
		ИначеЕсли ТипЗнч(выхДокументпит) = Тип("ДокументСсылка.питПеремещениеНоменклатурыСкладаПроизводства") Тогда
			Результат = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(выхДокументпит, "ДокументИсточник"));
		Иначе
			Результат = ТипыДокументовОбщепит.Найти(ТипЗнч(выхДокументпит)) <> Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьСвойстваДокументаДляПроведения(Документ, РежимЗаписи, РежимПроведения, СвойстваДокумента) Экспорт
	
	Если Документ.ДополнительныеСвойства.Свойство("питДокументОбщепитРаспределениеЗапасов") Тогда
		СвойстваДокумента = Новый ФиксированнаяСтруктура("ЭтоНовый, РежимЗаписи, РежимПроведения, Проведен, питДокументОбщепитРаспределениеЗапасов",
			Документ.ЭтоНовый(),
			РежимЗаписи,
			РежимПроведения,
			Документ.Проведен,
			Документ.ДополнительныеСвойства.питДокументОбщепитРаспределениеЗапасов);
	КонецЕсли;
	
	// << MRS #ERP-5386 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 25.08.25, ()
	// << MRS #ERP-5695 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 27.02.26, (Перенесено отключение в ПРД)
	//Если ТипЗнч(Документ) = Тип("ДокументОбъект.ПрочееОприходованиеТоваров") Тогда
	//	 Документ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	//КонецЕсли;
	// >> MRS #ERP-5386 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 25.08.25, ()
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеТиповыхДокументовПоВыпускуБлюд

// Процедура формирования типовых документов по переданному выпуску блюд.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	Если СтруктураПараметров.Свойство("ФормироватьДокументыПроизводства22") Тогда
		ФормироватьДокументыПроизводства22 = СтруктураПараметров.ФормироватьДокументыПроизводства22;
	Иначе
		ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
	КонецЕсли;
	
	//+ОтложенноеПроведение
	Если НЕ СтруктураПараметров.Свойство("питИспользоватьОтложенноеПроведениеВыпускаБлюд") Тогда
		СтруктураПараметров.Вставить("питИспользоватьОтложенноеПроведениеВыпускаБлюд", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питИспользоватьОтложенноеПроведениеВыпускаБлюд"));
	КонецЕсли;
	//+debug
	//СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд = Ложь;
	//-debug
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд
		И НЕ СтруктураПараметров.Свойство("питТекущийПриоритетДействияОтложенногоПроведения") Тогда
		СтруктураПараметров.Вставить("питТекущийПриоритетДействияОтложенногоПроведения", ПолучитьТекущийПриоритетДействияОтложенногоПроведения(ДокументВыпускБлюд));
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Если НЕ СтруктураПараметров.Свойство("ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд") Тогда
		СтруктураПараметров.Вставить("ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд", ПолучитьТаблицуПорядокПроведенияТиповыхДокументовВыпускаБлюд(СтруктураПараметров, ДокументВыпускБлюд.Дата));
	КонецЕсли;
	
	ТиповыеДокументы = ПолучитьТиповыеДокументыДляДокументаПитПоРежимуПроизводства(ДокументВыпускБлюд, ?(ФормироватьДокументыПроизводства22,"2.1","2.2"));
	Если ТиповыеДокументы.Количество() Тогда
		
		УдалятьДокументыСтаройСхемыПроведения = Истина;
		Если СтруктураПараметров.Свойство("УдалятьДокументыСтаройСхемыПроведения") Тогда
			УдалятьДокументыСтаройСхемыПроведения = СтруктураПараметров.УдалятьДокументыСтаройСхемыПроведения;
		КонецЕсли;
		
		Если УдалятьДокументыСтаройСхемыПроведения Тогда
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				Для каждого ТекТиповойДокумент Из ТиповыеДокументы Цикл
					ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.ПометитьНаУдалениеТиповойДокумент	, ТекТиповойДокумент, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
					Если НЕ ВсеОк Тогда 
						Возврат ВсеОк;
					КонецЕсли;
					ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.ОтвязатьТиповойДокумент				, ТекТиповойДокумент, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
					Если НЕ ВсеОк Тогда 
						Возврат ВсеОк;
					КонецЕсли;
				КонецЦикла;
			Иначе
			//-ОтложенноеПроведение
				
				// "Обрываем" связь документов старой схемы производства!
				ВсеОк = ПометитьНаУдалениеИОтвязатьТиповыеДокументы(ДокументВыпускБлюд, ТиповыеДокументы, СтруктураПараметров, ТекстОшибки);
				
			КонецЕсли;
			
		Иначе
			
			ТекстОшибки = ТекстОшибки + "
			| Не выполнено формирование типовых документов производства "+?(ФормироватьДокументыПроизводства22,"2.2","2.1")+" по документу общепит <"+ДокументВыпускБлюд+"> !!
			| По данному документу уже созданы документы производства "+?(ФормироватьДокументыПроизводства22,"2.1","2.2")+"!";
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	//<<Загребалов И., Апрель-Софт, 28.11.2021.SD64997, Удаление документа выпуск
	// если удаляем выпуск блюд, удалим все связанные документы, если они остались
	Если ДокументВыпускБлюд.ПометкаУдаления Тогда
		ТиповыеДокументыДляПометки = Новый Массив;
		НайтиТиповойДокументДляДокументапит(ДокументВыпускБлюд, ТиповыеДокументыДляПометки, ТекстОшибки);
		
		//<<Загребалов И., Апрель-Софт, 02.12.2021.SD64997, Удаление документа выпуск
		Если ТипЗнч(ТиповыеДокументыДляПометки) <> Тип("Массив") Тогда
			МассивДокументов = Новый Массив;
			МассивДокументов.Добавить(ТиповыеДокументыДляПометки);
		Иначе
			МассивДокументов = ТиповыеДокументыДляПометки;
		КонецЕсли;
		//>>

		ВсеОк = ПометитьНаУдалениеТиповыеДокументы(ДокументВыпускБлюд, МассивДокументов, Неопределено , ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//>>
	
	///////////////////////////////////////////////////
	// ОТМЕНА ПРОВЕДЕНИЯ ВСЕХ ПОДКЛАДНЫХ
	Если (НЕ ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций 
		И Константы.КонтролироватьОстаткиТоваровОрганизаций.Получить())
		ИЛИ СтруктураПараметров.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ Документы.питВыпускБлюд.СодержитСерийнуюНоменклатуруДляСписания(ДокументВыпускБлюд) Тогда
		// Если есть контроль остатков то выполнить отмену проведения существующих документов.
		// Или если это режим отмены проведения.
		ВсеОк = ОтменитьПроведениеТиповыхДокументовПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	
	// При отмене проведения больше никаких действий не требуется.
	Если СтруктураПараметров.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат ВсеОк;
	КонецЕсли;
	
	// НалогообложениеНДС в выпуске блюд.
	// Автоопределение значения налогообложения НДС.
	РеквизитыВыпуска = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументВыпускБлюд, "Организация, Дата, НаправлениеДеятельности");
	РеквизитыВыпускаКэш = Новый Структура("Организация, Дата, НаправлениеДеятельности");
	ЗаполнитьЗначенияСвойств(РеквизитыВыпускаКэш, РеквизитыВыпуска,,"НаправлениеДеятельности");
	ПараметрыЗаполненияВидаДеятельностиНДС = Документы.ПроизводствоБезЗаказа.ПараметрыЗаполненияВидаДеятельностиНДС(РеквизитыВыпуска);
	СтарыеПараметрыЗаполненияВидаДеятельностиНДС = Новый Структура("ПараметрыЗаполненияВидаДеятельностиНДС", Документы.ПроизводствоБезЗаказа.ПараметрыЗаполненияВидаДеятельностиНДС(РеквизитыВыпускаКэш));
	НайденноеНалогообложениеНДС = Неопределено;
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(НайденноеНалогообложениеНДС, ПараметрыЗаполненияВидаДеятельностиНДС, СтарыеПараметрыЗаполненияВидаДеятельностиНДС);
	СтруктураПараметров.Вставить("НалогообложениеНДС", НайденноеНалогообложениеНДС);
	
	// 1
	Если ФормироватьДокументыПроизводства22 Тогда
		
		///////////////////////////////////////////////////
		// ФОРМИРОВАНИЕ ПЕРЕМЕЩЕНИЙ С РАЗРЕШЕННЫХ КЛАДОВЫХ
		ВсеОк = СформироватьДвижениеПродукцииИзРазрешенныхКладовыхПоВыпускуБлюд22(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
	КонецЕсли;
	
	// 2
	///////////////////////////////////////////////////
	// ФОРМИРОВАНИЕ ОПРИХОДОВАНИЯ ИЗЛИШКОВ
	ВсеОк = СформироватьОприходованиеИзлишковПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	Если НЕ ВсеОк Тогда 
		Возврат ВсеОк;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////
	// ПОМЕТКА УДАЛЕНИЯ НЕАКТУАЛЬНЫХ КОМПЛЕКСНЫХ ТИПОВЫХ ДОКУМЕНТОВ
	ВсеОк = ПометитьНаУдалениеНеиспользуемыеКомплексныеДокументыВыпускаБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	Если НЕ ВсеОк Тогда 
		Возврат ВсеОк;
	КонецЕсли;
	
	//22
	Если ФормироватьДокументыПроизводства22 Тогда
		
		///////////////////////////////////////////////////
		// ФОРМИРОВАНИЕ ПЕРЕДАЧИ МАТЕРИАЛОВ В ПРОИЗВОДСТВО
		ВсеОк = СформироватьПроизводствоБезЗаказа22ПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
	Иначе
		
		///////////////////////////////////////////////////
		// ФОРМИРОВАНИЕ ПЕРЕДАЧИ МАТЕРИАЛОВ В ПРОИЗВОДСТВО
		ВсеОк = СформироватьПередачуМатериаловПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
		//////////////////////////////////
		// ФОРМИРОВАНИЕ ВЫПУСКОВ ПРОДУКЦИИ
		//
		ВсеОк = СформироватьВыпускПродукцииПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда
			Возврат ВсеОк;
		КонецЕсли;
		
		//////////////////////////////////////////////////////////////////////////////
		// ФОРМИРОВАНИЕ СПИСАНИЙ ЗАТРАТ НА ВЫПУСК
		ВсеОк = СформироватьСписанияЗатратПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда
			Возврат ВсеОк;
		КонецЕсли;
		
	КонецЕсли; // Если формировать по версии 2.2
	
	///////////////////////////////////////////////////////////////////////////////////////
	// ДОКУМЕНТЫ ПО КОМПЛЕКСНЫМ ВЫПУСКАМ БЛЮД
	//
	
	Если ДокументВыпускБлюд.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРозничнойРеализацией Тогда
		
		///////////////////////////////////////////////////////////////////////////////////////
		// ФОРМИРОВАНИЕ "ОТЧЕТА О РОЗНИЧНЫХ ПРОДАЖАХ" ДЛЯ ВЫПУСКА С РОЗНИЧНОЙ РЕАЛИЗАЦИЕЙ
		ВсеОк = СформироватьОтчетОРозничныхПродажахПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		
	ИначеЕсли ДокументВыпускБлюд.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРеализацией Тогда
		
		///////////////////////////////////////////////////////////////////////////////////////
		// ФОРМИРОВАНИЕ "РЕАЛИЗАЦИИ ТОВАРОВ УСЛУГ" ДЛЯ ВЫПУСКА С РЕАЛИЗАЦИЕЙ
		ВсеОк = СформироватьРеализациюТоваровУслугПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		
	ИначеЕсли ДокументВыпускБлюд.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСПеремещением Тогда
		
		// Если исходный склад является цеховой кладовой, то создаем движение продукции и материалов с операцией "перемещение из кладовой"
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументВыпускБлюд, "Склад.ЦеховаяКладовая") Тогда
			
			///////////////////////////////////////////////////////////////////////////////////////
			// ФОРМИРОВАНИЕ ДОКУМЕНТА "ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ" ДЛЯ ВЫПУСКА С ПЕРЕМЕЩЕНИЕМ
			ВсеОк = СформироватьПеремещениеИзКладовойПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
			
		Иначе
			
			///////////////////////////////////////////////////////////////////////////////////////
			// ФОРМИРОВАНИЕ ДОКУМЕНТА "ПЕРЕМЕЩЕНИЕ ТОВАРОВ" ДЛЯ ВЫПУСКА С РОЗНИЧНОЙ РЕАЛИЗАЦИЕЙ
			ВсеОк = СформироватьПеремещениеТоваровПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
			
		КонецЕсли;
		
	ИначеЕсли ДокументВыпускБлюд.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСоСписанием Тогда
		
		///////////////////////////////////////////////////////////////////////////////////////
		// ФОРМИРОВАНИЕ ДОКУМЕНТА "СПИСАНИЕ НЕДОСТАЧ ТОВАРОВ" ДЛЯ ВЫПУСКА СО СПИСАНИЕМ
		ВсеОк = СформироватьВнутреннееПотреблениеТоваровПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
						
	ИначеЕсли ДокументВыпускБлюд.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукции Тогда
	КонецЕсли;
	
	///////////////////////////////////////////////////////////
	// Отложенное формирование типовых документов
	
	ФормироватьОтложенноОприходованияИзлишков = Ложь;
	Если СтруктураПараметров.Свойство("ОтложитьФормированиеОприходованияИзлишков", ФормироватьОтложенноОприходованияИзлишков) 
		И ФормироватьОтложенноОприходованияИзлишков Тогда
		
		///////////////////////////////////////////////////
		// ФОРМИРОВАНИЕ ОПРИХОДОВАНИЯ ИЗЛИШКОВ
		ВсеОк = СформироватьОприходованиеИзлишковПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, Истина);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
	КонецЕсли;
	
	//22
	Если ФормироватьДокументыПроизводства22 Тогда
		
		ФормироватьОтложенноДвижениеПродукцииИзРазрешенныхКладовых = Ложь;
		Если СтруктураПараметров.Свойство("ОтложитьФормированиеДвиженияПродукцииИзРазрешенныхКладовых", ФормироватьОтложенноДвижениеПродукцииИзРазрешенныхКладовых) 
			И ФормироватьОтложенноДвижениеПродукцииИзРазрешенныхКладовых Тогда
			
			///////////////////////////////////////////////////
			// ФОРМИРОВАНИЕ ОПРИХОДОВАНИЯ ИЗЛИШКОВ
			ВсеОк = СформироватьДвижениеПродукцииИзРазрешенныхКладовыхПоВыпускуБлюд22(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, Истина);
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//>>Швецов. 10.01.2025. Розничные продажи алкоголя
	///////////////////////////////////////////////////
	// ФОРМИРОВАНИЕ ОПРИХОДОВАНИЯ ИЗЛИШКОВ
	//ВсеОк = СформироватьКорректировкуОстатковИСПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	//Если НЕ ВсеОк Тогда 
	//	Возврат ВсеОк;
	//КонецЕсли;
	//<<Швецов. 10.01.2025. Розничные продажи алкоголя
	
	//>>Швецов. 29.05.2025 Создаем корректировку остатка вскрытого алкоголя по ингридиентам в производстве
	СоздатьДокументАктСписанияЕГАИС(ДокументВыпускБлюд,СтруктураПараметров, тблСозданныеДокументы);
	ВсеОк = MRS_СформироватьКорректировкуОстатковИСПоПроизводству(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	Если НЕ ВсеОк Тогда 
		Возврат ВсеОк;
	КонецЕсли;	
	//<<Швецов
	Возврат ВсеОк;
	
КонецФункции

Функция СформироватьВыпускПродукцииПоВыпускуБлюд(Знач ДокументВыпускБлюд, Знач СтруктураПараметров, Знач тблСозданныеДокументы, ТекстОшибки)
	
	// Получение документов-объектов "Выпуск продукции" с направлением "На склад" и "В подразделение".
	ДокВыпускПродукцииНаСклад	= Неопределено;
	ДокВыпускПродукцииВПодр		= Неопределено;
	ПолучитьВыпускиПродукцииДляВыпускаБлюд(ДокументВыпускБлюд, ДокВыпускПродукцииНаСклад, ДокВыпускПродукцииВПодр);
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
	ДокВыпускПродукцииНаСклад.Проведен,ДокВыпускПродукцииНаСклад.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ДокВыпускПродукцииНаСклад.Проведен И ДокВыпускПродукцииВПодр.Проведен Тогда
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(РежимЗаписиДокумента.ОтменаПроведения);
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ДокВыпускПродукцииНаСклад.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ДокВыпускПродукцииНаСклад.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ДокВыпускПродукцииНаСклад.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка отмены проведения документа """ + ДокВыпускПродукцииНаСклад.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(РежимЗаписиДокумента.ОтменаПроведения);
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ДокВыпускПродукцииВПодр.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ДокВыпускПродукцииВПодр.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ДокВыпускПродукцииВПодр.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка отмены проведения документа """ + ДокВыпускПродукцииВПодр.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ДокВыпускПродукцииВПодр.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ДокВыпускПродукцииВПодр.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ДокВыпускПродукцииВПодр.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ДокВыпускПродукцииВПодр.Метаданные().Представление() + """(в подр.)
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ДокВыпускПродукцииНаСклад.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ДокВыпускПродукцииНаСклад.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ДокВыпускПродукцииНаСклад.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ДокВыпускПродукцииНаСклад.Метаданные().Представление() + """(на склад)
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	
	мМетаданныеДокументапит	= ДокументВыпускБлюд.Метаданные();
	
	// Выпуск в подразделение
	ДокВыпускПродукцииВПодр.Дата						= ДокументВыпускБлюд.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ДокВыпускПродукцииВПодр.Организация					= ДокументВыпускБлюд.Организация;
	ДокВыпускПродукцииВПодр.Подразделение				= ДокументВыпускБлюд.Подразделение;
	ДокВыпускПродукцииВПодр.Склад						= Справочники.Склады.ПустаяСсылка();
	ДокВыпускПродукцииВПодр.ВидЦены						= ДокументВыпускБлюд.ТипЦен;
	ДокВыпускПродукцииВПодр.Ответственный				= ДокументВыпускБлюд.Ответственный;
	ДокВыпускПродукцииВПодр.Комментарий					= ДокументВыпускБлюд.Комментарий;
	ДокВыпускПродукцииВПодр.ВыпускПоРаспоряжениям		= Ложь;
	ДокВыпускПродукцииВПодр.НаправлениеВыпуска			= Перечисления.ХозяйственныеОперации.ВыпускПродукцииВПодразделение;
	// Автоопределение значения налогообложения НДС.
	ДокВыпускПродукцииВПодр.ВыпускПодДеятельность		= ?(СтруктураПараметров.Свойство("НалогообложениеНДС"), СтруктураПараметров.НалогообложениеНДС, Неопределено);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", мМетаданныеДокументапит) Тогда
		ДокВыпускПродукцииВПодр.Валюта				= ДокументВыпускБлюд.Валюта;
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", мМетаданныеДокументапит) Тогда
		ДокВыпускПродукцииВПодр.Валюта				= ДокументВыпускБлюд.ВалютаДокумента;
	КонецЕсли;
	
	//ДокВыпускПродукцииВПодр.НаправлениеДеятельности	= ДокументВыпускБлюд.;
	
	// Выпуск на склад
	ДокВыпускПродукцииНаСклад.Дата						= ДокументВыпускБлюд.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ДокВыпускПродукцииНаСклад.Организация				= ДокументВыпускБлюд.Организация;
	ДокВыпускПродукцииНаСклад.Подразделение				= ДокументВыпускБлюд.Подразделение;
	ДокВыпускПродукцииНаСклад.Склад						= ДокументВыпускБлюд.Склад;
	ДокВыпускПродукцииНаСклад.ВидЦены					= ДокументВыпускБлюд.ТипЦен;
	ДокВыпускПродукцииНаСклад.Ответственный				= ДокументВыпускБлюд.Ответственный;
	ДокВыпускПродукцииНаСклад.Комментарий				= ДокументВыпускБлюд.Комментарий;
	ДокВыпускПродукцииНаСклад.ВыпускПоРаспоряжениям		= Ложь;
	ДокВыпускПродукцииНаСклад.НаправлениеВыпуска		= Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад;
	// Автоопределение значения налогообложения НДС.
	ДокВыпускПродукцииНаСклад.ВыпускПодДеятельность		= ?(СтруктураПараметров.Свойство("НалогообложениеНДС"), СтруктураПараметров.НалогообложениеНДС, Неопределено);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", мМетаданныеДокументапит) Тогда
		ДокВыпускПродукцииНаСклад.Валюта				= ДокументВыпускБлюд.Валюта;
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", мМетаданныеДокументапит) Тогда
		ДокВыпускПродукцииНаСклад.Валюта				= ДокументВыпускБлюд.ВалютаДокумента;
	КонецЕсли;
	
	//ДокВыпускПродукцииНаСклад.НаправлениеДеятельности	= ДокументВыпускБлюд.;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ДокВыпускПродукцииВПодр.Товары.Очистить();
	ДокВыпускПродукцииВПодр.Серии.Очистить();
	ДокВыпускПродукцииВПодр.ДополнительныеРеквизиты.Очистить();
	
	ДокВыпускПродукцииНаСклад.Товары.Очистить();
	ДокВыпускПродукцииНаСклад.Серии.Очистить();
	ДокВыпускПродукцииНаСклад.ДополнительныеРеквизиты.Очистить();
	
	// Получение данных по табличной части "Производство" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	ТекстЗапроса=
	"ВЫБРАТЬ
	|	питВыпускБлюдБлюда.Номенклатура КАК Номенклатура,
	|	питВыпускБлюдБлюда.Автопередел КАК Автопередел,
	|	питВыпускБлюдБлюда.КоличествоУпаковокНоменклатуры КАК КоличествоУпаковокНоменклатуры,
	|	питВыпускБлюдБлюда.УпаковкаНоменклатуры,
	|	питВыпускБлюдБлюда.КоличествоНоменклатуры КАК КоличествоНоменклатуры
	|ИЗ
	|	Документ.питВыпускБлюд.Блюда КАК питВыпускБлюдБлюда
	|ГДЕ
	|	питВыпускБлюдБлюда.Ссылка = &Ссылка";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	
	// Обход таб. части и заполнение таб. частей "Товары" документов "Выпуск продукции".
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Автопередел Тогда
			НовСтрока = ДокВыпускПродукцииВПодр.Товары.Добавить();
			НовСтрока.Подразделение		= ДокументВыпускБлюд.Подразделение; // Дублируем из шапки.
			НовСтрока.Склад				= Справочники.Склады.ПустаяСсылка(); // Для данного направления выпуска не заполнен.
		Иначе
			НовСтрока = ДокВыпускПродукцииНаСклад.Товары.Добавить();
			НовСтрока.Подразделение		= Справочники.СтруктураПредприятия.ПустаяСсылка(); // Для данного направления выпуска не заполнен.
			НовСтрока.Склад				= ДокументВыпускБлюд.Склад; // Дублируем из шапки.
		КонецЕсли;
		
		НовСтрока.Номенклатура			= Выборка.Номенклатура;
		//НовСтрока.Характеристика		= Выборка.
		НовСтрока.Упаковка				= Выборка.УпаковкаНоменклатуры;
		НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковокНоменклатуры;
		НовСтрока.Количество			= Выборка.КоличествоНоменклатуры;;
		НовСтрока.ТипСтоимости			= Перечисления.ТипыСтоимостиВыходныхИзделий.Рассчитывается;
		//НовСтрока.Серия				= Выборка.;
		//НовСтрока.СтатьяРасходов		= Выборка.; // Необходимо добавить в выпуск.
		//НовСтрока.СписатьНаРасходы	= ; // Только если будет выпуск со списанием.
		//НовСтрока.Склад				= ; // .
		
	КонецЦикла;
	
	//////////////////////////////////
	// ЗАПИСЬ ВЫПУСКОВ ПРОДУКЦИИ
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ИсходныйРежимЗаписи	= ТекРежимЗаписи;
		ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Попытка
		ДокВыпускПродукцииВПодр.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ДокВыпускПродукцииВПодр.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ДокВыпускПродукцииВПодр.Метаданные().Представление() + """(в подр.)
		| по документу Общепит """+ДокументВыпускБлюд+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ДокВыпускПродукцииВПодр.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ДокВыпускПродукцииВПодр.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ИсходныйРежимЗаписи	= ТекРежимЗаписи;
		ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Попытка
		ДокВыпускПродукцииНаСклад.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ДокВыпускПродукцииНаСклад.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ДокВыпускПродукцииНаСклад.Метаданные().Представление() + """(на склад)
		| по документу Общепит """+ДокументВыпускБлюд+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ДокВыпускПродукцииНаСклад.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ДокВыпускПродукцииНаСклад.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//+ОтложенноеПроведение
	ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
	//-ОтложенноеПроведение
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ДокВыпускПродукцииНаСклад, тблСозданныеДокументы,,ТекСинхронизирован);
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ДокВыпускПродукцииВПодр, тблСозданныеДокументы,,ТекСинхронизирован);
	
	// Массив обновленных выпусков продукции, на которых будут ссылаться
	// документы "Списание затрат на выпуск".
	ДокументыВыпускаПродукции = Новый Массив;
	ДокументыВыпускаПродукции.Добавить(ДокВыпускПродукцииВПодр.Ссылка);
	ДокументыВыпускаПродукции.Добавить(ДокВыпускПродукцииНаСклад.Ссылка);
	СтруктураПараметров.Вставить("ДокументыВыпускаПродукции",ДокументыВыпускаПродукции);
	
	Возврат Истина;
	
КонецФункции

// Процедура по переданной ссылке на выпуск блюд ищет типовые документы "Выпуск продукции" с хоз. операцией
//  "В подразделение" или "На склад" возвращая ДокОбъект. Если не находит, то создает для них пустой объект.
//
// Параметры:
//  ДокументВыпускБлюд			 - ДокументСсылка	 - Ссылка на документ, для которого ищем "Выпуски продукции".
//  выхДокВыпускПродукцииНаСклад - ДокументОбъект	 - Документ "Выпуск продукции"(на склад).
//  выхДокВыпускПродукцииВПодр	 - ДокументОбъект	 - Документ "Выпуск продукции"(в подразделение).
//
Процедура ПолучитьВыпускиПродукцииДляВыпускаБлюд(ДокументВыпускБлюд, выхДокВыпускПродукцииНаСклад = Неопределено, выхДокВыпускПродукцииВПодр = Неопределено)
	
	Запрос = Новый Запрос;
	
	// Поиск всех выпусков продукции "В подразделение" или "На склад", 
	// связанных с текущим выпуском блюд.
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ВыпускПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВыпускПродукции.НаправлениеВыпуска,
	|	втДокументыВыпускПродукции.ТиповойДокумент КАК ВыпускПродукции
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ВыпускПродукции
	|		ПО (втДокументыВыпускПродукции.ТиповойДокумент = ВыпускПродукции.Ссылка)
	|ГДЕ
	|	ВыпускПродукции.НаправлениеВыпуска В(&НеобходимыеНаправленияВыпуска)";
	
	// Список хоз. операций, поиск будет производиться только для них.
	НаправленияВыпуска = Новый СписокЗначений;
	НаправленияВыпуска.Добавить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииВПодразделение);
	НаправленияВыпуска.Добавить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад);
	
	Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
	Запрос.УстановитьПараметр("НеобходимыеНаправленияВыпуска",	НаправленияВыпуска);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документы найдены, то инициализируем соответствующие переменные.
	Пока Выборка.Следующий() Цикл
		Если Выборка.НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииВПодразделение Тогда
			Если выхДокВыпускПродукцииВПодр = Неопределено Тогда
				выхДокВыпускПродукцииВПодр = Выборка.ВыпускПродукции.ПолучитьОбъект();
			Иначе
				// Случай, когда С "Выпуском блюд" связано более 1го "Выпуск продукции"(В подразделение).
			КонецЕсли;
		ИначеЕсли Выборка.НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад Тогда
			Если выхДокВыпускПродукцииНаСклад = Неопределено Тогда
				выхДокВыпускПродукцииНаСклад = Выборка.ВыпускПродукции.ПолучитьОбъект();
			Иначе
				// Случай, когда С "Выпуском блюд" связано более 1го "Выпуск продукции"(На склад).
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Если переменные не инициализированны, значит документы не были найдены
	// и необходимо создать пустые документы-объекты, которые далее будут заполняться.
	Если выхДокВыпускПродукцииВПодр = Неопределено Тогда
		выхДокВыпускПродукцииВПодр = Документы["ВыпускПродукции"].СоздатьДокумент();
	КонецЕсли;
	Если выхДокВыпускПродукцииНаСклад = Неопределено Тогда
		выхДокВыпускПродукцииНаСклад = Документы["ВыпускПродукции"].СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует документы "Списание затрат на выпуск" для каждой номенклатурной позиции
//  в ТЧ "Блюда" + ТЧ "Ингредиенты" переданного документа "Выпуск блюд" или обновляет существующие.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьСписанияЗатратПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	// Запрос:
	// 1. Получение ВТ с реквизитами шапки документа "Выпуск блюд".
	// 2. Выбор в ВТ всех "Списаний затрат на выпуск", связанных с переданным выпуском блюд.
	// 3. Выбор в ВТ необходимых реквизитов ТЧ Производство док. "Выпуск блюд" + реквизитов шапки из (1).
	// 4. Выбор номенклатуры и флагов проведения из документов "Списание затрат...", связанных с "Выпуск блюд"(2).
	// 5. Выбор данных из вт(3) с итогом по номенклатуре.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюд.Ссылка,
	|	питВыпускБлюд.ПометкаУдаления,
	|	питВыпускБлюд.Проведен,
	|	питВыпускБлюд.Организация,
	|	питВыпускБлюд.Ответственный,
	|	питВыпускБлюд.Комментарий,
	|	питВыпускБлюд.Подразделение,
	|	питВыпускБлюд.Дата,
	|	питВыпускБлюд.СтатьяКалькуляции
	|ПОМЕСТИТЬ втШапкаВыпускаБлюд
	|ИЗ
	|	Документ.питВыпускБлюд КАК питВыпускБлюд
	|ГДЕ
	|	питВыпускБлюд.Ссылка = &Документпит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыСписаниеЗатрат
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.СписаниеЗатратНаВыпуск
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка,
	|	ВЫБОР
	|		КОГДА ВыпускПродукции.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Автопередел
	|ПОМЕСТИТЬ втВыпускиПродукцииАвтопередел
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Ссылка В(&ДокументыВыпускаПродукции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыпускПродукцииТовары.Ссылка КАК Распоряжение,
	|	ВыпускПродукцииТовары.Номенклатура,
	|	ВыпускПродукцииТовары.КодСтроки,
	|	втВыпускиПродукцииАвтопередел.Автопередел
	|ПОМЕСТИТЬ втРаспоряжения
	|ИЗ
	|	Документ.ВыпускПродукции.Товары КАК ВыпускПродукцииТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВыпускиПродукцииАвтопередел КАК втВыпускиПродукцииАвтопередел
	|		ПО ВыпускПродукцииТовары.Ссылка = втВыпускиПродукцииАвтопередел.Ссылка
	|ГДЕ
	|	ВыпускПродукцииТовары.Ссылка В(&ДокументыВыпускаПродукции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдБлюда.Ссылка,
	|	питВыпускБлюдБлюда.Номенклатура,
	|	питВыпускБлюдБлюда.Автопередел,
	|	питВыпускБлюдБлюда.КоличествоУпаковокНоменклатуры,
	|	питВыпускБлюдБлюда.УпаковкаНоменклатуры,
	|	питВыпускБлюдБлюда.КоличествоНоменклатуры,
	|	питВыпускБлюдИнгредиенты.УпаковкаИнгредиента,
	|	питВыпускБлюдИнгредиенты.КоличествоУпаковокИнгредиентаФакт,
	|	питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт,
	|	питВыпускБлюдИнгредиенты.Ингредиент
	|ПОМЕСТИТЬ втПроизводство
	|ИЗ
	|	Документ.питВыпускБлюд.Блюда КАК питВыпускБлюдБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд.Ингредиенты КАК питВыпускБлюдИнгредиенты
	|		ПО питВыпускБлюдБлюда.ИдентификаторСтроки = питВыпускБлюдИнгредиенты.ИдентификаторБлюда
	|ГДЕ
	|	питВыпускБлюдБлюда.Ссылка = &Документпит
	|	И питВыпускБлюдИнгредиенты.Ссылка = &Документпит
	|	И НЕ питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт = 0
	|	И НЕ питВыпускБлюдИнгредиенты.Ингредиент.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	питВыпускБлюдБлюда.Ссылка,
	|	питВыпускБлюдБлюда.Номенклатура,
	|	питВыпускБлюдБлюда.Автопередел,
	|	питВыпускБлюдБлюда.КоличествоУпаковокНоменклатуры,
	|	питВыпускБлюдБлюда.УпаковкаНоменклатуры,
	|	питВыпускБлюдБлюда.КоличествоНоменклатуры,
	|	питВыпускБлюдЗамены.УпаковкаИнгредиентаЗамена,
	|	питВыпускБлюдЗамены.КоличествоУпаковокИнгредиентаЗамена,
	|	питВыпускБлюдЗамены.КоличествоИнгредиентаЗамена,
	|	питВыпускБлюдЗамены.ИнгредиентЗамена
	|ИЗ
	|	Документ.питВыпускБлюд.Блюда КАК питВыпускБлюдБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд.Замены КАК питВыпускБлюдЗамены
	|		ПО питВыпускБлюдБлюда.Номенклатура = питВыпускБлюдЗамены.Блюдо
	|			И питВыпускБлюдБлюда.Рецептура = питВыпускБлюдЗамены.Рецептура
	|			И питВыпускБлюдБлюда.Автопередел = питВыпускБлюдЗамены.Автопередел
	|ГДЕ
	|	питВыпускБлюдБлюда.Ссылка = &Документпит
	|	И питВыпускБлюдЗамены.Ссылка = &Документпит
	|	И НЕ питВыпускБлюдЗамены.ИнгредиентЗамена.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПроизводство.Ссылка,
	|	втПроизводство.Номенклатура,
	|	втПроизводство.Автопередел,
	|	втПроизводство.КоличествоУпаковокНоменклатуры,
	|	втПроизводство.УпаковкаНоменклатуры,
	|	втПроизводство.КоличествоНоменклатуры,
	|	втПроизводство.Ингредиент,
	|	втПроизводство.УпаковкаИнгредиента,
	|	СУММА(втПроизводство.КоличествоУпаковокИнгредиентаФакт) КАК КоличествоУпаковокИнгредиентаФакт,
	|	СУММА(втПроизводство.КоличествоИнгредиентаФакт) КАК КоличествоИнгредиентаФакт
	|ПОМЕСТИТЬ втПроизводствоВсе
	|ИЗ
	|	втПроизводство КАК втПроизводство
	|ГДЕ
	|	втПроизводство.Ссылка = &Документпит
	|
	|СГРУППИРОВАТЬ ПО
	|	втПроизводство.КоличествоНоменклатуры,
	|	втПроизводство.КоличествоУпаковокНоменклатуры,
	|	втПроизводство.Ссылка,
	|	втПроизводство.Номенклатура,
	|	втПроизводство.Автопередел,
	|	втПроизводство.УпаковкаНоменклатуры,
	|	втПроизводство.Ингредиент,
	|	втПроизводство.УпаковкаИнгредиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПроизводствоВсе.Номенклатура,
	|	втПроизводствоВсе.Ссылка КАК ДокументВыпускБлюд,
	|	втПроизводствоВсе.КоличествоНоменклатуры,
	|	втПроизводствоВсе.УпаковкаНоменклатуры,
	|	втПроизводствоВсе.КоличествоУпаковокНоменклатуры,
	|	втПроизводствоВсе.Ингредиент,
	|	втПроизводствоВсе.УпаковкаИнгредиента,
	|	втПроизводствоВсе.КоличествоИнгредиентаФакт,
	|	втПроизводствоВсе.КоличествоУпаковокИнгредиентаФакт,
	|	втШапкаВыпускаБлюд.ПометкаУдаления,
	|	втШапкаВыпускаБлюд.Проведен,
	|	втШапкаВыпускаБлюд.Организация,
	|	втШапкаВыпускаБлюд.Ответственный,
	|	втШапкаВыпускаБлюд.Комментарий,
	|	втШапкаВыпускаБлюд.Подразделение,
	|	втШапкаВыпускаБлюд.Дата,
	|	втШапкаВыпускаБлюд.СтатьяКалькуляции,
	|	ЕСТЬNULL(втРаспоряжения.Распоряжение, ЗНАЧЕНИЕ(Документ.ВыпускПродукции.ПустаяСсылка)) КАК Распоряжение,
	|	ЕСТЬNULL(втРаспоряжения.КодСтроки, 0) КАК КодСтроки,
	|	втПроизводствоВсе.Автопередел
	|ПОМЕСТИТЬ втНоменклатураВПроизводстве
	|ИЗ
	|	втШапкаВыпускаБлюд КАК втШапкаВыпускаБлюд
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПроизводствоВсе КАК втПроизводствоВсе
	|			ЛЕВОЕ СОЕДИНЕНИЕ втРаспоряжения КАК втРаспоряжения
	|			ПО втПроизводствоВсе.Номенклатура = втРаспоряжения.Номенклатура
	|				И втПроизводствоВсе.Автопередел = втРаспоряжения.Автопередел
	|		ПО втШапкаВыпускаБлюд.Ссылка = втПроизводствоВсе.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыСписаниеЗатрат.ТиповойДокумент КАК СписаниеЗатрат,
	|	СписаниеЗатратНаВыпуск.ПометкаУдаления,
	|	СписаниеЗатратНаВыпуск.Проведен
	|ИЗ
	|	втДокументыСписаниеЗатрат КАК втДокументыСписаниеЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеЗатратНаВыпуск КАК СписаниеЗатратНаВыпуск
	|		ПО втДокументыСписаниеЗатрат.ТиповойДокумент = СписаниеЗатратНаВыпуск.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатураВПроизводстве.Номенклатура КАК Номенклатура,
	|	втНоменклатураВПроизводстве.ДокументВыпускБлюд,
	|	втНоменклатураВПроизводстве.КоличествоНоменклатуры,
	|	втНоменклатураВПроизводстве.УпаковкаНоменклатуры,
	|	втНоменклатураВПроизводстве.КоличествоУпаковокНоменклатуры,
	|	втНоменклатураВПроизводстве.Ингредиент,
	|	втНоменклатураВПроизводстве.УпаковкаИнгредиента,
	|	втНоменклатураВПроизводстве.КоличествоИнгредиентаФакт,
	|	втНоменклатураВПроизводстве.КоличествоУпаковокИнгредиентаФакт,
	|	втНоменклатураВПроизводстве.ПометкаУдаления,
	|	втНоменклатураВПроизводстве.Проведен,
	|	втНоменклатураВПроизводстве.Организация,
	|	втНоменклатураВПроизводстве.Ответственный,
	|	втНоменклатураВПроизводстве.Комментарий,
	|	втНоменклатураВПроизводстве.Подразделение,
	|	втНоменклатураВПроизводстве.Дата,
	|	втНоменклатураВПроизводстве.СтатьяКалькуляции,
	|	втНоменклатураВПроизводстве.Распоряжение,
	|	втНоменклатураВПроизводстве.КодСтроки,
	|	втНоменклатураВПроизводстве.Автопередел КАК Автопередел
	|ИЗ
	|	втНоменклатураВПроизводстве КАК втНоменклатураВПроизводстве
	|ИТОГИ ПО
	|	Номенклатура,
	|	Автопередел";
	
	// Если документы "Выпуск продукции" не заданы, то инициализируем их как пустой массив.
	Если СтруктураПараметров.Свойство("ДокументыВыпускаПродукции") И НЕ СтруктураПараметров.ДокументыВыпускаПродукции = Неопределено Тогда
		ДокументыВыпускаПродукции = СтруктураПараметров.ДокументыВыпускаПродукции;
	Иначе
		ДокументыВыпускаПродукции = Новый Массив;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документпит",			ДокументВыпускБлюд);
	Запрос.УстановитьПараметр("ДокументыВыпускаПродукции",	ДокументыВыпускаПродукции);
	
	// Выполнение запроса и получение 2х выборок:
	// - Основная выборка с данными по номенклатуре и ее ингридиентам
	// - Доп. выборка существующих документов "Списание затрат" по текущему документу "пит".
	РезультатПакет = Запрос.ВыполнитьПакет();
	Выборка								= РезультатПакет[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСуществующиеСписания			= РезультатПакет[7].Выбрать();
	
	// Структура текущего "Списания затрат".
	ТекСписаниеЗатрат = Новый Структура("СписаниеЗатрат,ПометкаУдаления,Проведен");
	
	// Обход основной выборки
	Пока Выборка.Следующий() Цикл
		
		ВыборкаАвтопередел = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаАвтопередел.Следующий() Цикл
			
			ВыборкаДетальная = ВыборкаАвтопередел.Выбрать();
			
			// Выборка по списаниям затрат.
			// Если документ существует, тогда заполняем его данными структуру тек. списания,
			// иначе - заполняем значениями по умолчанию.
			Если ВыборкаСуществующиеСписания.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ТекСписаниеЗатрат,ВыборкаСуществующиеСписания);
			Иначе
				ТекСписаниеЗатрат.СписаниеЗатрат = Документы["СписаниеЗатратНаВыпуск"].ПустаяСсылка();
				ТекСписаниеЗатрат.ПометкаУдаления = Ложь;
				ТекСписаниеЗатрат.Проведен = Ложь;
			КонецЕсли;
			
			// "Обнуление" переменной текущего объекта
			ТекДокументОбъект = Неопределено;
			
			ПерваяДетальнаяСтрока = Истина; // В момент обхода первой строки детальной выборки заполняем шапку.
			
			// Детальный обход основной выборки
			Пока ВыборкаДетальная.Следующий() Цикл
				
				Если ПерваяДетальнаяСтрока Тогда
					
					////////////////////////////
					// Определение режима записи
					ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ВыборкаДетальная.Проведен,ВыборкаДетальная.ПометкаУдаления
					,ТекСписаниеЗатрат.Проведен,ТекСписаниеЗатрат.ПометкаУдаления,СтруктураПараметров);
					ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
					////////////////////////////
					
					// Если тек списание затрат не было найдено, то создаем новый объект.
					Если ТекСписаниеЗатрат.СписаниеЗатрат = Документы["СписаниеЗатратНаВыпуск"].ПустаяСсылка() Тогда
						ТекДокументОбъект = Документы["СписаниеЗатратНаВыпуск"].СоздатьДокумент();
					Иначе
						ТекДокументОбъект = ТекСписаниеЗатрат.СписаниеЗатрат.ПолучитьОбъект();
						
						// Если нужно установить пометку удаления, то перед синхронизацией сделаем это.
						Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
							
							//+ОтложенноеПроведение
							Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
								ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
								СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
								Если НЕ ВсеОк Тогда 
									Возврат ВсеОк;
								КонецЕсли;
							Иначе
							//-ОтложенноеПроведение
								
								// Помечаем на удаление / снимаем пометку в док. "Списание затрат...".
								Попытка
									ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
									ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
								Исключение
									ТекстОшибки = ТекстОшибки + "
									|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
									| по документу Общепит """+ДокументВыпускБлюд+"""
									|по причине: <"+ОписаниеОшибки()+">";
									Возврат Ложь;
								КонецПопытки;
								
							КонецЕсли;
							
						КонецЕсли;
						
						// Очистка табличных частей для избежания дублирования информации.
						ТекДокументОбъект.ВыходныеИзделия.Очистить();
						ТекДокументОбъект.МатериалыИУслуги.Очистить();
						ТекДокументОбъект.ВозвратныеОтходы.Очистить();
						ТекДокументОбъект.Трудозатраты.Очистить();
						ТекДокументОбъект.Серии.Очистить();
						
					КонецЕсли;
					
					// Заполнение шапки.
					ТекДокументОбъект.Дата			= ВыборкаДетальная.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
					ТекДокументОбъект.Организация	= ВыборкаДетальная.Организация;
					ТекДокументОбъект.Номенклатура	= ВыборкаДетальная.Номенклатура;
					ТекДокументОбъект.Ответственный	= ВыборкаДетальная.Ответственный;
					ТекДокументОбъект.Комментарий	= ВыборкаДетальная.Комментарий;
					ТекДокументОбъект.Количество	= ВыборкаДетальная.КоличествоНоменклатуры;
					ТекДокументОбъект.Подразделение	= ВыборкаДетальная.Подразделение;
					
					// Заполнение табличной части "Выходные изделия".
					НовСтрокаТЧ						= ТекДокументОбъект.ВыходныеИзделия.Добавить();
					НовСтрокаТЧ.Номенклатура		= ВыборкаДетальная.Номенклатура;
					НовСтрокаТЧ.КоличествоУпаковок	= ВыборкаДетальная.КоличествоУпаковокНоменклатуры;
					НовСтрокаТЧ.Количество			= ВыборкаДетальная.КоличествоНоменклатуры;
					НовСтрокаТЧ.Упаковка			= ВыборкаДетальная.УпаковкаНоменклатуры;
					НовСтрокаТЧ.Подразделение		= ВыборкаДетальная.Подразделение;
					НовСтрокаТЧ.Распоряжение		= ВыборкаДетальная.Распоряжение;
					НовСтрокаТЧ.КодСтроки			= ВыборкаДетальная.КодСтроки;
					
					ПерваяДетальнаяСтрока = Ложь;
				КонецЕсли;
				
				// Заполнение табличной части "Материалы и услуги".
				НовСтрокаТЧ							= ТекДокументОбъект.МатериалыИУслуги.Добавить();
				НовСтрокаТЧ.Номенклатура			= ВыборкаДетальная.Ингредиент;
				НовСтрокаТЧ.СтатьяКалькуляции		= ВыборкаДетальная.СтатьяКалькуляции;
				НовСтрокаТЧ.Количество				= ВыборкаДетальная.КоличествоИнгредиентаФакт;
				НовСтрокаТЧ.Упаковка				= ВыборкаДетальная.УпаковкаИнгредиента;
				НовСтрокаТЧ.КоличествоУпаковок		= ВыборкаДетальная.КоличествоУпаковокИнгредиентаФакт;
				НовСтрокаТЧ.Подразделение			= ВыборкаДетальная.Подразделение;
				
			КонецЦикла;
			
			Если НЕ ТекДокументОбъект = Неопределено Тогда
				
				//+ОтложенноеПроведение
				Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
					ИсходныйРежимЗаписи	= ТекРежимЗаписи;
					ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
				КонецЕсли;
				//-ОтложенноеПроведение
				
				// Запись заполненного документа "Списание затрат".
				Попытка
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокументОбъект.Записать(ТекРежимЗаписи);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
				//+ОтложенноеПроведение
				Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
					ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
					ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
					Если НЕ ВсеОк Тогда 
						Возврат ВсеОк;
					КонецЕсли;
					ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
					Если НЕ ВсеОк Тогда 
						Возврат ВсеОк;
					КонецЕсли;
				КонецЕсли;
				//-ОтложенноеПроведение
				
			КонецЕсли;
			
			//+ОтложенноеПроведение
			ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
			//-ОтложенноеПроведение
			
			// Добавление записи в результирующую таблицу в случае успешной записи документов.
			ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// "Обнуление" переменной текущего объекта.
	ТекДокументОбъект = Неопределено;
	
	// Если остались лишние документы "Списания затрат", то нужно пометить их на удаление.
	Пока ВыборкаСуществующиеСписания.Следующий() Цикл
		
		ТекДокументОбъект = ВыборкаСуществующиеСписания.СписаниеЗатрат.ПолучитьОбъект();
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(Истина), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			// Помечаем на удаление "Списание затрат...", если он еще не помечен.
			Если НЕ ВыборкаСуществующиеСписания.ПометкаУдаления Тогда
				Попытка
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокументОбъект.УстановитьПометкуУдаления(Истина);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		//+ОтложенноеПроведение
		ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
		//-ОтложенноеПроведение
		
		// Добавление записи в результирующую таблицу.
		ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документы "Производство без заказа" для каждой номенклатурной позиции
//  в ТЧ "Блюда" + ТЧ "Ингредиенты" переданного документа "Выпуск блюд" или обновляет существующие.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьПроизводствоБезЗаказа22ПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	//+БазовоеСмещение
	Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
		СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
	КонецЕсли;
	БазовоеСмещениеПроизводстваБезЗаказов = 0;
	БазовоеСмещениеДвиженияПродукцииИМатериалов = 0;
	Если СтруктураПараметров.питСмещатьДатыТиповыхДокументов Тогда
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", "ПроизводствоБезЗаказа", 0));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещениеПроизводстваБезЗаказов = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", "ДвижениеПродукцииИМатериалов", 0));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещениеДвиженияПродукцииИМатериалов = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
	КонецЕсли;
	//-БазовоеСмещение
	
	// Где производим полуфабрикаты
	ПодразделениеПроизводстваПолуфабрикатов = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питПодразделениеПроизводстваПолуфабрикатов");
	
	// Запрос:
	// 1. Формирование таблицы производства с данными по Блюдам и Ингредиентам/Заменам
	//  с упорядочиванием по полю "Порядок" и итогами по "Порядок" и "Номенклатура" 
	//  для разделения таблицы на несколько типовых документов.
	// 2. Выборка всех существующих "Производств без заказов" и данных по ним.
	// 3. Выборка данных шапки текущего выпуска блюд.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюдБлюда.Ссылка КАК Ссылка,
	|	питВыпускБлюдБлюда.Номенклатура КАК Номенклатура,
	|	питВыпускБлюдБлюда.Характеристика КАК Характеристика,
	|	питВыпускБлюдБлюда.Серия КАК Серия,
	|	питВыпускБлюдБлюда.Назначение КАК Назначение,
	|	питВыпускБлюдБлюда.Автопередел КАК Автопередел,
	|	питВыпускБлюдБлюда.КоличествоУпаковокНоменклатуры КАК КоличествоУпаковокНоменклатуры,
	|	питВыпускБлюдБлюда.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
	|	питВыпускБлюдБлюда.КоличествоНоменклатуры КАК КоличествоНоменклатуры,
	|	питВыпускБлюдБлюда.Рецептура КАК РецептураБлюда,
	|	ЕСТЬNULL(питВыпускБлюдИнгредиенты.УпаковкаИнгредиента, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК УпаковкаИнгредиента,
	|	ЕСТЬNULL(питВыпускБлюдИнгредиенты.КоличествоУпаковокИнгредиентаФакт, 0) КАК КоличествоУпаковокИнгредиентаФакт,
	|	ЕСТЬNULL(питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт, 0) КАК КоличествоИнгредиентаФакт,
	|	ЕСТЬNULL(питВыпускБлюдИнгредиенты.Ингредиент, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Ингредиент,
	|	ЕСТЬNULL(питВыпускБлюдИнгредиенты.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаИнгредиента,
	|	ЕСТЬNULL(питВыпускБлюдИнгредиенты.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК НазначениеИнгредиента,
	|	ЕСТЬNULL(питВыпускБлюдИнгредиенты.Серия,ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияИнгредиента,
	|	ЕСТЬNULL(питВыпускБлюдИнгредиенты.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)) КАК СтатьяКалькуляции,
	|	питВыпускБлюдБлюда.Порядок КАК Порядок,
	|	питВыпускБлюдБлюда.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА &ПодразделениеПроизводстваПолуфабрикатов = ЗНАЧЕНИЕ(Перечисление.питПодразделенияПроизводстваПолуфабрикатов.ПодразделениеРецептуры)
	|				И питВыпускБлюдБлюда.Автопередел = ИСТИНА
	|			ТОГДА питРецептура.Подразделение
	|		ИНАЧЕ питВыпускБлюд.Подразделение
	|	КОНЕЦ КАК ПодразделениеПроизводства,
	|	ВЫБОР
	|		КОГДА &ПодразделениеПроизводстваПолуфабрикатов = ЗНАЧЕНИЕ(Перечисление.питПодразделенияПроизводстваПолуфабрикатов.ПодразделениеРецептуры)
	|				И питВыпускБлюдБлюда.Автопередел = ИСТИНА
	|			ТОГДА питРецептура.ЦеховаяКладовая
	|		ИНАЧЕ питВыпускБлюд.Склад
	|	КОНЕЦ КАК ЦеховаяКладовая
	|ПОМЕСТИТЬ втПроизводствоПред
	|ИЗ
	|	Документ.питВыпускБлюд.Блюда КАК питВыпускБлюдБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд.Ингредиенты КАК питВыпускБлюдИнгредиенты
	|		ПО питВыпускБлюдБлюда.ИдентификаторСтроки = питВыпускБлюдИнгредиенты.ИдентификаторБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд КАК питВыпускБлюд
	|		ПО питВыпускБлюдБлюда.Ссылка = питВыпускБлюд.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питРецептура КАК питРецептура
	|		ПО питВыпускБлюдБлюда.Рецептура = питРецептура.Ссылка
	|ГДЕ
	|	питВыпускБлюдБлюда.Ссылка = &Документпит
	|	И питВыпускБлюдИнгредиенты.Ссылка = &Документпит
	//|	И НЕ питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт = 0
	//|	И НЕ питВыпускБлюдИнгредиенты.Ингредиент.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	питВыпускБлюдБлюда.Ссылка,
	|	питВыпускБлюдБлюда.Номенклатура,
	|	питВыпускБлюдБлюда.Характеристика,
	|	питВыпускБлюдБлюда.Серия,
	|	питВыпускБлюдБлюда.Назначение,
	|	питВыпускБлюдБлюда.Автопередел,
	|	питВыпускБлюдБлюда.КоличествоУпаковокНоменклатуры,
	|	питВыпускБлюдБлюда.УпаковкаНоменклатуры,
	|	питВыпускБлюдБлюда.КоличествоНоменклатуры,
	|	питВыпускБлюдБлюда.Рецептура,
	|	ЕСТЬNULL(питВыпускБлюдЗамены.УпаковкаИнгредиентаЗамена, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)),
	|	ЕСТЬNULL(питВыпускБлюдЗамены.КоличествоУпаковокИнгредиентаЗамена, 0),
	|	ЕСТЬNULL(питВыпускБлюдЗамены.КоличествоИнгредиентаЗамена, 0),
	|	ЕСТЬNULL(питВыпускБлюдЗамены.ИнгредиентЗамена, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ЕСТЬNULL(питВыпускБлюдЗамены.ХарактеристикаИнгредиентаЗамена, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|	ЕСТЬNULL(питВыпускБлюдЗамены.НазначениеИнгредиентаЗамена, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЕСТЬNULL(питВыпускБлюдЗамены.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)),
	|	питВыпускБлюдБлюда.Порядок,
	|	питВыпускБлюдБлюда.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА &ПодразделениеПроизводстваПолуфабрикатов = ЗНАЧЕНИЕ(Перечисление.питПодразделенияПроизводстваПолуфабрикатов.ПодразделениеРецептуры)
	|				И питВыпускБлюдБлюда.Автопередел = ИСТИНА
	|			ТОГДА питРецептура.Подразделение
	|		ИНАЧЕ питВыпускБлюд.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ПодразделениеПроизводстваПолуфабрикатов = ЗНАЧЕНИЕ(Перечисление.питПодразделенияПроизводстваПолуфабрикатов.ПодразделениеРецептуры)
	|				И питВыпускБлюдБлюда.Автопередел = ИСТИНА
	|			ТОГДА питРецептура.ЦеховаяКладовая
	|		ИНАЧЕ питВыпускБлюд.Склад
	|	КОНЕЦ
	|ИЗ
	|	Документ.питВыпускБлюд.Блюда КАК питВыпускБлюдБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд.Замены КАК питВыпускБлюдЗамены
	|		ПО питВыпускБлюдБлюда.Номенклатура = питВыпускБлюдЗамены.Блюдо
	|			И питВыпускБлюдБлюда.Характеристика = питВыпускБлюдЗамены.ХарактеристикаБлюда
	|			И питВыпускБлюдБлюда.Рецептура = питВыпускБлюдЗамены.Рецептура
	|			И питВыпускБлюдБлюда.Автопередел = питВыпускБлюдЗамены.Автопередел
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питРецептура КАК питРецептура
	|		ПО питВыпускБлюдБлюда.Рецептура = питРецептура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд КАК питВыпускБлюд
	|		ПО питВыпускБлюдБлюда.Ссылка = питВыпускБлюд.Ссылка
	|ГДЕ
	|	питВыпускБлюдБлюда.Ссылка = &Документпит
	|	И питВыпускБлюдЗамены.Ссылка = &Документпит
	//|	И НЕ питВыпускБлюдЗамены.ИнгредиентЗамена.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(Склады.Ссылка) КАК Ссылка,
	|	Склады.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ втЦеховыеКладовые
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.ЦеховаяКладовая = ИСТИНА
	|	И Склады.Подразделение В
	|			(ВЫБРАТЬ
	|				вт.ПодразделениеПроизводства
	|			ИЗ
	|				втПроизводствоПред КАК вт)
	|
	|СГРУППИРОВАТЬ ПО
	|	Склады.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПроизводствоПред.Ссылка,
	|	втПроизводствоПред.Номенклатура,
	|	втПроизводствоПред.Характеристика,
	|	втПроизводствоПред.Серия,
	|	втПроизводствоПред.Назначение,
	|	втПроизводствоПред.Автопередел,
	|	втПроизводствоПред.КоличествоУпаковокНоменклатуры,
	|	втПроизводствоПред.УпаковкаНоменклатуры,
	|	втПроизводствоПред.КоличествоНоменклатуры,
	//<< Портал-Юг, Гребенюк, 29.05.2023, [Обновление 2.5, некорректно присваивается псевдоним в схеме запроса]
	//|	втПроизводствоПред.УпаковкаИнгредиента,
	|	втПроизводствоПред.УпаковкаИнгредиента КАК УпаковкаИнгредиента,
	//>> Портал-Юг, Гребенюк, 29.05.2023	
	|	втПроизводствоПред.КоличествоУпаковокИнгредиентаФакт,
	|	втПроизводствоПред.КоличествоИнгредиентаФакт,
	|	втПроизводствоПред.Ингредиент,
	|	втПроизводствоПред.ХарактеристикаИнгредиента,
	|	втПроизводствоПред.НазначениеИнгредиента,
	|	втПроизводствоПред.СерияИнгредиента,
	|	втПроизводствоПред.СтатьяКалькуляции,
	|	втПроизводствоПред.Порядок,
	|	втПроизводствоПред.ИдентификаторСтроки,
	|	втПроизводствоПред.ПодразделениеПроизводства,
	|	втПроизводствоПред.РецептураБлюда,
	|	ВЫБОР
	|		КОГДА втПроизводствоПред.ЦеховаяКладовая = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА втЦеховыеКладовые.Ссылка
	|		ИНАЧЕ втПроизводствоПред.ЦеховаяКладовая
	|	КОНЕЦ КАК ЦеховаяКладовая
	|ПОМЕСТИТЬ втПроизводство
	|ИЗ
	|	втПроизводствоПред КАК втПроизводствоПред
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеховыеКладовые КАК втЦеховыеКладовые
	|		ПО втПроизводствоПред.ПодразделениеПроизводства = втЦеховыеКладовые.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПроизводство.Ссылка КАК Ссылка,
	|	втПроизводство.Номенклатура КАК Номенклатура,
	|	втПроизводство.Ингредиент.питВидНоменклатуры КАК питВидНоменклатурыИнгредиента,
	|	втПроизводство.Характеристика КАК Характеристика,
	|	втПроизводство.Серия КАК Серия,
	|	втПроизводство.Назначение КАК Назначение,
	|	втПроизводство.Автопередел КАК Автопередел,
	|	втПроизводство.КоличествоУпаковокНоменклатуры КАК КоличествоУпаковокНоменклатуры,
	|	втПроизводство.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
	|	втПроизводство.КоличествоНоменклатуры КАК КоличествоНоменклатуры,
	|	втПроизводство.Ингредиент КАК Ингредиент,
	|	втПроизводство.ХарактеристикаИнгредиента КАК ХарактеристикаИнгредиента,
	|	втПроизводство.НазначениеИнгредиента КАК НазначениеИнгредиента,
	|	втПроизводство.СерияИнгредиента КАК СерияИнгредиента,
	|	втПроизводство.УпаковкаИнгредиента КАК УпаковкаИнгредиента,
	|	СУММА(втПроизводство.КоличествоУпаковокИнгредиентаФакт) КАК КоличествоУпаковокИнгредиентаФакт,
	|	СУММА(втПроизводство.КоличествоИнгредиентаФакт) КАК КоличествоИнгредиентаФакт,
	|	втПроизводство.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	втПроизводство.Порядок КАК Порядок,
	|	втПроизводство.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втПроизводство.ПодразделениеПроизводства КАК ПодразделениеПроизводства,
	|	втПроизводство.ЦеховаяКладовая КАК ЦеховаяКладовая,
	|	втПроизводство.РецептураБлюда КАК РецептураБлюда,
	|	НоменклатураСпр.ГруппаАналитическогоУчета
	|ИЗ
	|	втПроизводство КАК втПроизводство
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО втПроизводство.Номенклатура = НоменклатураСпр.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	втПроизводство.КоличествоНоменклатуры,
	|	втПроизводство.КоличествоУпаковокНоменклатуры,
	|	втПроизводство.Ссылка,
	|	втПроизводство.Номенклатура,
	|	втПроизводство.Характеристика,
	|	втПроизводство.Серия,
	|	втПроизводство.Назначение,
	|	втПроизводство.Автопередел,
	|	втПроизводство.УпаковкаНоменклатуры,
	|	втПроизводство.Ингредиент,
	|	втПроизводство.ХарактеристикаИнгредиента,
	|	втПроизводство.НазначениеИнгредиента,
	|	втПроизводство.СерияИнгредиента,
	|	втПроизводство.УпаковкаИнгредиента,
	|	втПроизводство.СтатьяКалькуляции,
	|	втПроизводство.Порядок,
	|	втПроизводство.ИдентификаторСтроки,
	|	втПроизводство.ПодразделениеПроизводства,
	|	втПроизводство.ЦеховаяКладовая,
	|	втПроизводство.РецептураБлюда,
	|	НоменклатураСпр.ГруппаАналитическогоУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	втПроизводство.Порядок УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(КоличествоУпаковокНоменклатуры),
	|	МАКСИМУМ(УпаковкаНоменклатуры),
	|	МАКСИМУМ(КоличествоНоменклатуры),
	|	МАКСИМУМ(ИдентификаторСтроки),
	|	МАКСИМУМ(РецептураБлюда),
	|	МАКСИМУМ(ГруппаАналитическогоУчета),
	|	МАКСИМУМ(Серия),
	|	МАКСИМУМ(Назначение)
	|ПО
	|	Порядок,
	|	ПодразделениеПроизводства,
	|	ЦеховаяКладовая,
	|	Номенклатура,
	|	Характеристика,
	|	УпаковкаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент КАК ТиповойДокумент,
	|	питТиповыеДокументы.ДокументОбщепит,
	|	питТиповыеДокументы.ПричинаТиповогоДокумента
	|ПОМЕСТИТЬ втВсеТиповыеДокументы
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыПроизводствоБезЗаказов
	|ИЗ
	|	втВсеТиповыеДокументы КАК втВсеТиповыеДокументы
	|ГДЕ
	|	втВсеТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ПроизводствоБезЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыПроизводствоБезЗаказов.ТиповойДокумент КАК ПроизводствоБезЗаказа,
	|	ДокПроизводствоБезЗаказа.Проведен,
	|	ДокПроизводствоБезЗаказа.ПометкаУдаления
	|ИЗ
	|	втДокументыПроизводствоБезЗаказов КАК втДокументыПроизводствоБезЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ДокПроизводствоБезЗаказа
	|		ПО втДокументыПроизводствоБезЗаказов.ТиповойДокумент = ДокПроизводствоБезЗаказа.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	втДокументыПроизводствоБезЗаказов.ТиповойДокумент.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюд.Ссылка,
	|	питВыпускБлюд.ПометкаУдаления,
	|	питВыпускБлюд.Проведен,
	|	питВыпускБлюд.Дата,
	|	питВыпускБлюд.Номер,
	|	питВыпускБлюд.ДокументОснование,
	|	питВыпускБлюд.ХозяйственнаяОперация,
	|	питВыпускБлюд.Организация,
	|	питВыпускБлюд.Подразделение,
	|	питВыпускБлюд.Склад,
	|	питВыпускБлюд.Валюта,
	|	питВыпускБлюд.ТипЦен,
	|	питВыпускБлюд.СтатьяКалькуляции,
	|	питВыпускБлюд.Ответственный,
	|	питВыпускБлюд.Комментарий,
	|	питВыпускБлюд.ИсполнительТрудозатрат,
	|	питВыпускБлюд.НаправлениеДеятельности
	|ИЗ
	|	Документ.питВыпускБлюд КАК питВыпускБлюд
	|ГДЕ
	|	питВыпускБлюд.Ссылка = &Документпит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеТиповыеДокументы.ТиповойДокумент,
	|	втВсеТиповыеДокументы.ДокументОбщепит
	|ПОМЕСТИТЬ втДокументыДвижениеПродукции
	|ИЗ
	|	втВсеТиповыеДокументы КАК втВсеТиповыеДокументы
	|ГДЕ
	|	втВсеТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|	И втВсеТиповыеДокументы.ПричинаТиповогоДокумента = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыДвижениеПродукции.ТиповойДокумент КАК ДокументСсылка,
	|	ДокДвижениеПродукции.Проведен,
	|	ДокДвижениеПродукции.ПометкаУдаления
	|ИЗ
	|	втДокументыДвижениеПродукции КАК втДокументыДвижениеПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов КАК ДокДвижениеПродукции
	|		ПО втДокументыДвижениеПродукции.ТиповойДокумент = ДокДвижениеПродукции.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд КАК ДокВыпускБлюд
	|		ПО втДокументыДвижениеПродукции.ДокументОбщепит = ДокВыпускБлюд.Ссылка
	|ГДЕ
	|	ДокДвижениеПродукции.Получатель = ДокВыпускБлюд.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдТрудозатраты.ИдентификаторБлюда,
	|	питВыпускБлюдТрудозатраты.Подразделение,
	|	питВыпускБлюдТрудозатраты.ВидРабот,
	|	питВыпускБлюдТрудозатраты.Количество,
	|	питВыпускБлюдТрудозатраты.СтатьяКалькуляции
	|ИЗ
	|	Документ.питВыпускБлюд.Трудозатраты КАК питВыпускБлюдТрудозатраты
	|ГДЕ
	|	питВыпускБлюдТрудозатраты.Ссылка = &Документпит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдПобочныеИзделия.ИдентификаторБлюда,
	|	питВыпускБлюдПобочныеИзделия.Подразделение,
	|	питВыпускБлюдПобочныеИзделия.Получатель,
	|	питВыпускБлюдПобочныеИзделия.Номенклатура,
	|	питВыпускБлюдПобочныеИзделия.Характеристика,
	|	питВыпускБлюдПобочныеИзделия.Серия,
	|	питВыпускБлюдПобочныеИзделия.Назначение,
	|	питВыпускБлюдПобочныеИзделия.СтатусУказанияСерий,
	|	питВыпускБлюдПобочныеИзделия.КоличествоУпаковок,
	|	питВыпускБлюдПобочныеИзделия.Количество,
	|	питВыпускБлюдПобочныеИзделия.Упаковка,
	|	питВыпускБлюдПобочныеИзделия.Цена,
	|	питВыпускБлюдПобочныеИзделия.Сумма,
	|	питВыпускБлюдПобочныеИзделия.СтатьяКалькуляции
	|ИЗ
	|	Документ.питВыпускБлюд.ПобочныеИзделия КАК питВыпускБлюдПобочныеИзделия
	|ГДЕ
	|	питВыпускБлюдПобочныеИзделия.Ссылка = &Документпит";
	
	//<<Портал-Юг, Давиденко 2019.03.11 [4.2.11 Использование услуг и работ в документе «Выпуск блюд»]
	// услуги и ингредиенты по ним не должны попадать в документ
	ПЛ_СхемаЗапроса = Новый СхемаЗапроса;
	ПЛ_СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		
	// добавление отбора по НЕ услугам в первый запрос первого пакета	
	ПЛ_вт_ПроизводствоПред = ПЛ_СхемаЗапроса.ПакетЗапросов[0];
	ПЛ_Операторы_втПроизводствоПред1 = ПЛ_вт_ПроизводствоПред.Операторы.Получить(0);
	ПЛ_Операторы_втПроизводствоПред1.Отбор.Добавить("НЕ питВыпускБлюдБлюда.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)");
	
	// добавление отбора по НЕ услугам во второй запрос первого пакета	
	ПЛ_Операторы_втПроизводствоПред2 = ПЛ_вт_ПроизводствоПред.Операторы.Получить(1);
	ПЛ_Операторы_втПроизводствоПред2.Отбор.Добавить("НЕ питВыпускБлюдБлюда.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)");
	
	ПЛ_Пакет3 = ПЛ_СхемаЗапроса.ПакетЗапросов[3];
	// добавление поля ТипНоменклатуры и группировка по нему в итогах ув
	ПЛ_ОператорыПакет3 = ПЛ_Пакет3.Операторы.Получить(0);
	ПЛ_ОператорыПакет3.ВыбираемыеПоля.Добавить("НоменклатураСпр.ТипНоменклатуры");
	ПЛ_Пакет3.ВыраженияИтогов.Добавить("МАКСИМУМ(ТипНоменклатуры)", "ТипНоменклатуры");
	
	//<<Портал-Юг, Давиденко 2019.03.16 [6.2.10 Отражение производства услуг по СКЛ]
	// добавление пакета с выборкой из ТЧ товары
	ПЛ_втТовары = ПЛ_СхемаЗапроса.ПакетЗапросов.Добавить();	
	// перемещение пакета на позицию перед основным результатом запроса
	ПЛ_СхемаЗапроса.ПакетЗапросов.Переместить(12, 3);
	ПЛ_втТовары.ТаблицаДляПомещения = "ПЛ_ВтТовары";
	
	ПЛ_ОператорВыбрать = ПЛ_втТовары.Операторы[0];
	ПЛ_Источник = ПЛ_ОператорВыбрать.Источники.Добавить("Документ.питВыпускБлюд.Товары","питВыпускБлюдТовары");
	
	//добавление выбранных полей
	ПЛ_ОператорВыбрать.ВыбираемыеПоля.Добавить("питВыпускБлюдТовары.Номенклатура");
	ПЛ_ОператорВыбрать.ВыбираемыеПоля.Добавить("питВыпускБлюдТовары.Характеристика");
	ПЛ_ОператорВыбрать.ВыбираемыеПоля.Добавить("питВыпускБлюдТовары.Серия");
	ПЛ_ОператорВыбрать.ВыбираемыеПоля.Добавить("СУММА(питВыпускБлюдТовары.КоличествоУпаковок)");
	ПЛ_ОператорВыбрать.ВыбираемыеПоля.Добавить("питВыпускБлюдТовары.Назначение");
	//<< Портал-Юг, Баринов, 2019.10.03 [6.2.10 Отражение производства услуг по СКЛ]
	//ПЛ_ОператорВыбрать.ВыбираемыеПоля.Добавить("питВыпускБлюдТовары.ПЛ_Договор.ПЛ_ЗначениеАналитикиПродаж");
	ПЛ_ОператорВыбрать.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ВЫРАЗИТЬ(питВыпускБлюдТовары.ПЛ_Договор.ПЛ_ЗначениеАналитикиПродаж КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры), питВыпускБлюдТовары.Номенклатура.ГруппаФинансовогоУчета)");
	ПЛ_втТовары.Колонки[5].Псевдоним = "ГруппаФинансовогоУчета";
	//>> Портал-Юг, Баринов, 2019.10.03
	ПЛ_ОператорВыбрать.ВыбираемыеПоля.Добавить("СУММА(питВыпускБлюдТовары.Количество)");
	
	//добавление условия в конструкцию "ГДЕ"
	ПЛ_ОператорВыбрать.Отбор.Добавить("питВыпускБлюдТовары.Ссылка = &Документпит");
	
	// редактирование результирующего пакета
	ПЛ_ПакетРезультат = ПЛ_СхемаЗапроса.ПакетЗапросов[4];
	ПЛ_ОператорыПакетРезультат = ПЛ_ПакетРезультат.Операторы.Получить(0);
	ПЛ_Источник = ПЛ_ОператорыПакетРезультат.Источники.Добавить("ПЛ_ВтТовары","ПЛ_ВтТовары");
	
	//<< ПЛ Татаринов, 24.05.2022 После обновления на 2.4.14.115 стало появляться не нужное соединение с таблицей ПЛ_ВтТовары
	ПЛ_ОператорыПакетРезультат.Источники[2].Соединения.Удалить(0);
	//>> ПЛ Татаринов, 24.05.2022
	
	// добавление полей с пересчетом количества и аналитикой
	ПЛ_ОператорыПакетРезультат.ВыбираемыеПоля.Добавить("ВЫРАЗИТЬ(СУММА(ВЫБОР
	|			КОГДА НЕ втПроизводство.Автопередел
	|				ТОГДА ПЛ_ВтТовары.КоличествоУпаковок
	|			ИНАЧЕ втПроизводство.КоличествоУпаковокНоменклатуры
	|		КОНЕЦ) КАК ЧИСЛО (15,3))");
	
	//<< Портал-Юг, Гребенюк, 29.05.2023, [Обновление 2.5, изменилось количество пакетов]
	//ПЛ_ПакетРезультат.Колонки[24].Псевдоним = "ПЛ_КоличествоУпаковокНоменклатуры";
	ПЛ_ПакетРезультат.Колонки[ПЛ_ПакетРезультат.Колонки.Количество() - 1].Псевдоним = "ПЛ_КоличествоУпаковокНоменклатуры";
	//>> Портал-Юг, Гребенюк, 29.05.2023
	
	ПЛ_ОператорыПакетРезультат.ВыбираемыеПоля.Добавить("ВЫБОР
	|			КОГДА НЕ втПроизводство.Автопередел
	|				ТОГДА ПЛ_ВтТовары.КоличествоУпаковок / втПроизводство.КоличествоУпаковокНоменклатуры * СУММА(втПроизводство.КоличествоУпаковокИнгредиентаФакт)
	|			ИНАЧЕ втПроизводство.КоличествоУпаковокИнгредиентаФакт
	|		КОНЕЦ ");
	
	//<< Портал-Юг, Гребенюк, 29.05.2023, [Обновление 2.5, изменилось количество пакетов]
	//ПЛ_ПакетРезультат.Колонки[25].Псевдоним = "ПЛ_КоличествоУпаковокИнгредиента";
	ПЛ_ПакетРезультат.Колонки[ПЛ_ПакетРезультат.Колонки.Количество() - 1].Псевдоним = "ПЛ_КоличествоУпаковокИнгредиента";
	//>> Портал-Юг, Гребенюк, 29.05.2023

	ПЛ_ОператорыПакетРезультат.ВыбираемыеПоля.Добавить("ВЫРАЗИТЬ(СУММА(ВЫБОР
	|			КОГДА НЕ втПроизводство.Автопередел
	|				ТОГДА ПЛ_ВтТовары.Количество
	|			ИНАЧЕ втПроизводство.КоличествоНоменклатуры
	|		КОНЕЦ) КАК ЧИСЛО (15,3))");
	
	//<< Портал-Юг, Гребенюк, 29.05.2023, [Обновление 2.5, изменилось количество пакетов]
	//ПЛ_ПакетРезультат.Колонки[26].Псевдоним = "ПЛ_КоличествоНоменклатуры";
	ПЛ_ПакетРезультат.Колонки[ПЛ_ПакетРезультат.Колонки.Количество() - 1].Псевдоним = "ПЛ_КоличествоНоменклатуры";
	//>> Портал-Юг, Гребенюк, 29.05.2023
	
	ПЛ_ОператорыПакетРезультат.ВыбираемыеПоля.Добавить("ВЫБОР
	|		КОГДА НЕ втПроизводство.Автопередел
	|			ТОГДА ПЛ_ВтТовары.Количество / втПроизводство.КоличествоНоменклатуры * СУММА(втПроизводство.КоличествоИнгредиентаФакт)
	|		ИНАЧЕ втПроизводство.КоличествоИнгредиентаФакт
	|	КОНЕЦ ");
	
	//<< Портал-Юг, Гребенюк, 29.05.2023, [Обновление 2.5, изменилось количество пакетов]	
	//ПЛ_ПакетРезультат.Колонки[27].Псевдоним = "ПЛ_КоличествоИнгредиента";  
	ПЛ_ПакетРезультат.Колонки[ПЛ_ПакетРезультат.Колонки.Количество() - 1].Псевдоним = "ПЛ_КоличествоИнгредиента";
    //>> Портал-Юг, Гребенюк, 29.05.2023
	
	//<< Портал-Юг, Баринов, 2019.08.13 [6.2.9 Изменения правил выгрузки данных для БП]
	//ПЛ_ОператорыПакетРезультат.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ВЫРАЗИТЬ(ПЛ_ВтТовары.ПЛ_ДоговорПЛ_ЗначениеАналитикиПродаж КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры), ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка))");
	//<< Портал-Юг, Баринов, 2019.10.03 [6.2.10 Отражение производства услуг по СКЛ]
	//ПЛ_ОператорыПакетРезультат.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ВЫРАЗИТЬ(ПЛ_ВтТовары.ПЛ_ДоговорПЛ_ЗначениеАналитикиПродаж КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры), ПЛ_ВтТовары.Номенклатура.ГруппаФинансовогоУчета)");
	ПЛ_ОператорыПакетРезультат.ВыбираемыеПоля.Добавить("ПЛ_ВтТовары.ГруппаФинансовогоУчета");
	//>> Портал-Юг, Баринов, 2019.10.03
	//>> Портал-Юг, Баринов, 2019.08.13
	//<< Портал-Юг, Гребенюк, 29.05.2023, [Обновление 2.5, изменилось количество пакетов]
	//ПЛ_ПакетРезультат.Колонки[28].Псевдоним = "ПЛ_ЗначениеАналитикиПродаж"; 
	ПЛ_ПакетРезультат.Колонки[ПЛ_ПакетРезультат.Колонки.Количество() - 1].Псевдоним = "ПЛ_ЗначениеАналитикиПродаж";
	//>> Портал-Юг, Гребенюк, 29.05.2023
	
	// добавление соединения с таблицей ПЛ_ВтТовары
	ПЛ_ИсточникВтПроизводство = ПЛ_ОператорыПакетРезультат.Источники[0];
	ПЛ_ИсточникВтПроизводство.Соединения.Добавить("ПЛ_ВтТовары", "втПроизводство.Номенклатура = ПЛ_ВтТовары.Номенклатура");
	ПЛ_ИсточникВтПроизводство.Соединения.Добавить("ПЛ_ВтТовары", "втПроизводство.Характеристика = ПЛ_ВтТовары.Характеристика");
	ПЛ_ИсточникВтПроизводство.Соединения.Добавить("ПЛ_ВтТовары", "втПроизводство.Серия = ПЛ_ВтТовары.Серия");
	ПЛ_ИсточникВтПроизводство.Соединения.Добавить("ПЛ_ВтТовары", "втПроизводство.Назначение = ПЛ_ВтТовары.Назначение");
	ПЛ_ИсточникВтПроизводство.Соединения.Добавить("ПЛ_ВтТовары", "НЕ втПроизводство.Автопередел");
	
	// добавление группировочных полей в итогах
	ПЛ_ИтогГруппаФинУчета = ПЛ_ПакетРезультат.КонтрольныеТочкиИтогов.Добавить("ПЛ_ЗначениеАналитикиПродаж");
	
	// добавление итоговых полей
	ПЛ_ПакетРезультат.ВыраженияИтогов.Добавить("МАКСИМУМ(ПЛ_КоличествоУпаковокНоменклатуры)");
	ПЛ_ПакетРезультат.ВыраженияИтогов.Добавить("МАКСИМУМ(ПЛ_КоличествоНоменклатуры)");
	ПЛ_ПакетРезультат.ВыраженияИтогов.Добавить("МАКСИМУМ(ПЛ_КоличествоИнгредиента)");
	ПЛ_ПакетРезультат.ВыраженияИтогов.Добавить("МАКСИМУМ(ПЛ_КоличествоУпаковокИнгредиента)");
	
	//<< Портал-Юг, Гребенюк, 29.05.2023, [Обновление 2.5, изменилось количество пакетов]
	//ПЛ_ПакетРезультат.Операторы[0].ВыбираемыеПоля.Удалить(15);
	//ПЛ_ПакетРезультат.Операторы[0].ВыбираемыеПоля.Удалить(14);
	ПЛ_ПакетРезультат.Операторы[0].ВыбираемыеПоля.Удалить(16);
	ПЛ_ПакетРезультат.Операторы[0].ВыбираемыеПоля.Удалить(15);
	//>> Портал-Юг, Гребенюк, 29.05.2023
	ПЛ_ПакетРезультат.Операторы[0].ВыбираемыеПоля.Добавить("втПроизводство.КоличествоУпаковокИнгредиентаФакт");
	ПЛ_ПакетРезультат.Операторы[0].ВыбираемыеПоля.Добавить("втПроизводство.КоличествоИнгредиентаФакт");
	//>>Портал-Юг, Давиденко 2019.03.16
	
	Запрос.Текст = ПЛ_СхемаЗапроса.ПолучитьТекстЗапроса();
	//>>Портал-Юг, Давиденко 2019.03.11
	
	Запрос.УстановитьПараметр("Документпит", ДокументВыпускБлюд);
	Запрос.УстановитьПараметр("ПодразделениеПроизводстваПолуфабрикатов", ПодразделениеПроизводстваПолуфабрикатов);
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	//<<Портал-Юг, Давиденко 2019.03.16 [6.2.10 Отражение производства услуг по СКЛ]
	// после редактирования запроса пакеты смещены
	
	//РезультатЗапроса								= РезультатЗапросаПакет[3];
	//РезультатЗапросаТиповыеДокументы				= РезультатЗапросаПакет[6];
	//РезультатЗапросаШапкаВыпуска					= РезультатЗапросаПакет[7];
	//РезультатЗапросаДвижениеПродукцииИМатериалов	= РезультатЗапросаПакет[9];
	//РезультатЗапросаТрудозатраты					= РезультатЗапросаПакет[10];
	//РезультатЗапросаПобочныеИзделия					= РезультатЗапросаПакет[11];

	РезультатЗапроса								= РезультатЗапросаПакет[4];
	РезультатЗапросаТиповыеДокументы				= РезультатЗапросаПакет[7];
	РезультатЗапросаШапкаВыпуска					= РезультатЗапросаПакет[8];
	РезультатЗапросаДвижениеПродукцииИМатериалов	= РезультатЗапросаПакет[10];
	РезультатЗапросаТрудозатраты					= РезультатЗапросаПакет[11];
	РезультатЗапросаПобочныеИзделия					= РезультатЗапросаПакет[12];
	//>>Портал-Юг, Давиденко 2019.03.16 	
	
	// Получение данных шапки.
	ШапкаВыпуска = РезультатЗапросаШапкаВыпуска.Выбрать();
	ШапкаВыпуска.Следующий();
	
	// Существующие выпуски без заказа.
	ВыборкаСуществующиеПроизводстваБезЗаказа = РезультатЗапросаТиповыеДокументы.Выбрать();
	
	// Существующие движения продукции и материалов.
	ВыборкаСуществующиеДвиженияПродукцииИМатериалов = РезультатЗапросаДвижениеПродукцииИМатериалов.Выбрать();
	
	//<<Портал-Юг, Давиденко 2019.03.23 [6.2.10 Отражение производства услуг по СКЛ]
	// таблица для расчета отклонения в количестве ингредиентов
	ПЛ_ТЗДляКонтроляКоличества = Новый ТаблицаЗначений;
	
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("Номенклатура");
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("Ингредиент");
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3, ДопустимыйЗнак.Любой)));
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3, ДопустимыйЗнак.Любой)));
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("ГруппаФинансовогоУчета");
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("КоличествоКонтроль", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3, ДопустимыйЗнак.Любой)));
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("КоличествоУпаковокКонтроль", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3, ДопустимыйЗнак.Любой)));
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("Характеристика");
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("Серия");
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("Назначение");
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("РецептураБлюда");
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("ХарактеристикаИнгредиента");
	ПЛ_ТЗДляКонтроляКоличества.Колонки.Добавить("СерияИнгредиента");
	//>>Портал-Юг, Давиденко 2019.03.23	
	// Нет производственной части.
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаПорядок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВыборкаТрудозатраты = РезультатЗапросаТрудозатраты.Выбрать();
		ПоискПоТрудозатратам = Новый Структура("ИдентификаторБлюда");
		
		ВыборкаПобочныеИзделия = РезультатЗапросаПобочныеИзделия.Выбрать();
		ПоискПоПобочнымИзделиям = Новый Структура("ИдентификаторБлюда");
		
		// Структура текущего "Производство без заказа".
		ТекПроизводствоБезЗаказа = Новый Структура("ПроизводствоБезЗаказа,ПометкаУдаления,Проведен");
		
		// Структура текущего "Производство без заказа".
		ТекДвижениеПродукцииИМатериалов = Новый Структура("ДокументСсылка,ПометкаУдаления,Проведен");
		МассивТекДокументовДвижениеПродукции = Новый Массив;
		
		Пока ВыборкаПорядок.Следующий() Цикл 
			// Выборка по полю "Порядок".
			
			Выборка = ВыборкаПорядок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				// Выборка по полю "Подразделение производства", для каждого порядка и подразделения свой док. "Производство без заказа".
				
				ТекДокументОбъект = Неопределено;
				
				// Выборка производствам без заказа.
				// Если документ существует, тогда заполняем его данными структуру,
				// иначе - заполняем значениями по умолчанию.
				Если ВыборкаСуществующиеПроизводстваБезЗаказа.Следующий() Тогда
					ЗаполнитьЗначенияСвойств(ТекПроизводствоБезЗаказа,ВыборкаСуществующиеПроизводстваБезЗаказа);
				Иначе
					ТекПроизводствоБезЗаказа.ПроизводствоБезЗаказа = Документы.ПроизводствоБезЗаказа.ПустаяСсылка();
					ТекПроизводствоБезЗаказа.ПометкаУдаления = Ложь;
					ТекПроизводствоБезЗаказа.Проведен = Ложь;
				КонецЕсли;
				
				////////////////////////////
				// Определение режима записи
				ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления
				,ТекПроизводствоБезЗаказа.Проведен,ТекПроизводствоБезЗаказа.ПометкаУдаления,СтруктураПараметров);
				ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
				////////////////////////////
				
				// Если тек списание затрат не было найдено, то создаем новый объект.
				Если ТекПроизводствоБезЗаказа.ПроизводствоБезЗаказа = Документы.ПроизводствоБезЗаказа.ПустаяСсылка() Тогда
					ТекДокументОбъект = Документы.ПроизводствоБезЗаказа.СоздатьДокумент();
				Иначе
					ТекДокументОбъект = ТекПроизводствоБезЗаказа.ПроизводствоБезЗаказа.ПолучитьОбъект();
					
					// Если нужно установить пометку удаления, то перед синхронизацией сделаем это.
					Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
						
						//+ОтложенноеПроведение
						Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
							ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
							СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
							Если НЕ ВсеОк Тогда 
								Возврат ВсеОк;
							КонецЕсли;
						Иначе
						//-ОтложенноеПроведение
							
							Попытка
								ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
								Если ЗначениеЗаполнено(ШапкаВыпуска.ДокументОснование) И ТипЗнч(ШапкаВыпуска.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
									ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
								КонецЕсли;
								ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
							Исключение
								ТекстОшибки = ТекстОшибки + "
								|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
								| по документу Общепит """+ДокументВыпускБлюд+"""
								|по причине: <"+ОписаниеОшибки()+">";
								Возврат Ложь;
							КонецПопытки;
							
						КонецЕсли;
						
					КонецЕсли;
					
					// Очистка табличных частей для избежания дублирования информации.
					ТекДокументОбъект.ВыходныеИзделия.Очистить();
					ТекДокументОбъект.МатериалыИРаботы.Очистить();
					ТекДокументОбъект.Трудозатраты.Очистить();
					ТекДокументОбъект.ПобочныеИзделия.Очистить();
					ТекДокументОбъект.ВыходныеИзделияСерии.Очистить();
					ТекДокументОбъект.ПобочныеИзделияСерии.Очистить();
					
				КонецЕсли;
				
				// Заполнение шапки.
				ТекДокументОбъект.Дата					= ШапкаВыпуска.Дата 
				+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0)
				- БазовоеСмещениеПроизводстваБезЗаказов;
				ТекДокументОбъект.Организация			= ШапкаВыпуска.Организация;
				ТекДокументОбъект.Подразделение			= Выборка.ПодразделениеПроизводства;
				ТекДокументОбъект.ГруппировкаЗатрат		= Перечисления.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукции;
				ТекДокументОбъект.Ответственный			= ШапкаВыпуска.Ответственный;
				ТекДокументОбъект.Комментарий			= ШапкаВыпуска.Комментарий;
				ТекДокументОбъект.Валюта				= ШапкаВыпуска.Валюта;
				ТекДокументОбъект.НаправлениеДеятельности	= ШапкаВыпуска.НаправлениеДеятельности;
				// Автоопределение значения налогообложения НДС.
				ТекДокументОбъект.ВыпускПодДеятельность	= ?(СтруктураПараметров.Свойство("НалогообложениеНДС"), СтруктураПараметров.НалогообложениеНДС, Неопределено);
				
				//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
				МассивТекДокументовДвижениеПродукции.Очистить();
				//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
				
				ТекНомерГруппыЗатрат = 1; // номер, по которому сопоставляются ТЧ "ВыходныеИзделия" и ТЧ "МатериалыИРаботы"в док "Производство без заказа"
				
				ВыборкаПоЦехам = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоЦехам.Следующий() Цикл
					
					
					//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
					
					ТекДокументОбъектДвижениеПродукцииИМатериалов = Неопределено;
					Если ВыборкаПоЦехам.ЦеховаяКладовая <> ШапкаВыпуска.Склад Тогда
						
						// Выборка по движениям продукции и материалов.
						// Если документ существует, тогда заполняем его данными структуру,
						// иначе - заполняем значениями по умолчанию.
						Если ВыборкаСуществующиеДвиженияПродукцииИМатериалов.Следующий() Тогда
							ЗаполнитьЗначенияСвойств(ТекДвижениеПродукцииИМатериалов,ВыборкаСуществующиеДвиженияПродукцииИМатериалов);
						Иначе
							ТекДвижениеПродукцииИМатериалов.ДокументСсылка = Документы.ДвижениеПродукцииИМатериалов.ПустаяСсылка();
							ТекДвижениеПродукцииИМатериалов.ПометкаУдаления = Ложь;
							ТекДвижениеПродукцииИМатериалов.Проведен = Ложь;
						КонецЕсли;
						
						////////////////////////////
						// Определение режима записи
						ПараметрыЗаписиДвижениеПродукцииИМатериалов = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления
						,ТекДвижениеПродукцииИМатериалов.Проведен,ТекДвижениеПродукцииИМатериалов.ПометкаУдаления,Новый Структура);
						ТекРежимЗаписиДвижениеПродукцииИМатериалов = ПараметрыЗаписиДвижениеПродукцииИМатериалов.РежимЗаписи;
						////////////////////////////
						
						// Если тек списание затрат не было найдено, то создаем новый объект.
						Если ТекДвижениеПродукцииИМатериалов.ДокументСсылка = Документы.ДвижениеПродукцииИМатериалов.ПустаяСсылка() Тогда
							ТекДокументОбъектДвижениеПродукцииИМатериалов = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
						Иначе
							ТекДокументОбъектДвижениеПродукцииИМатериалов = ТекДвижениеПродукцииИМатериалов.ДокументСсылка.ПолучитьОбъект();
							
							// Если нужно установить пометку удаления, то перед синхронизацией сделаем это.
							Если ПараметрыЗаписиДвижениеПродукцииИМатериалов.НужнаУстановкаПометкиУдаления Тогда
								
								//+ОтложенноеПроведение
								Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
									ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписиДвижениеПродукцииИМатериалов.ПометкаУдаления), ТекДокументОбъектДвижениеПродукцииИМатериалов.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
									СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
									Если НЕ ВсеОк Тогда 
										Возврат ВсеОк;
									КонецЕсли;
								Иначе
								//-ОтложенноеПроведение
									
									Попытка
										ТекДокументОбъектДвижениеПродукцииИМатериалов.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
										ТекДокументОбъектДвижениеПродукцииИМатериалов.УстановитьПометкуУдаления(ПараметрыЗаписиДвижениеПродукцииИМатериалов.ПометкаУдаления);
									Исключение
										ТекстОшибки = ТекстОшибки + "
										|Ошибка при установке пометки удаления """ + ТекДокументОбъектДвижениеПродукцииИМатериалов.Метаданные().Представление() + """
										| по документу Общепит """+ДокументВыпускБлюд+"""
										|по причине: <"+ОписаниеОшибки()+">";
										Возврат Ложь;
									КонецПопытки;
									
								КонецЕсли;
								
							КонецЕсли;
							
							// Очистка табличных частей для избежания дублирования информации.
							ТекДокументОбъектДвижениеПродукцииИМатериалов.Товары.Очистить();
							ТекДокументОбъектДвижениеПродукцииИМатериалов.Серии.Очистить();
							ТекДокументОбъектДвижениеПродукцииИМатериалов.ВидыЗапасов.Очистить();
							ТекДокументОбъектДвижениеПродукцииИМатериалов.ДополнительныеРеквизиты.Очистить();
							
						КонецЕсли;
						
						// Заполнение шапки.
						ТекДокументОбъектДвижениеПродукцииИМатериалов.Дата					= ШапкаВыпуска.Дата 
						+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0)
						- БазовоеСмещениеДвиженияПродукцииИМатериалов;
						ТекДокументОбъектДвижениеПродукцииИМатериалов.Организация			= ШапкаВыпуска.Организация;
						ТекДокументОбъектДвижениеПродукцииИМатериалов.Отправитель			= ВыборкаПоЦехам.ЦеховаяКладовая;
						ТекДокументОбъектДвижениеПродукцииИМатериалов.Получатель			= ШапкаВыпуска.Склад;
						ТекДокументОбъектДвижениеПродукцииИМатериалов.Ответственный			= ШапкаВыпуска.Ответственный;
						ТекДокументОбъектДвижениеПродукцииИМатериалов.Комментарий			= ШапкаВыпуска.Комментарий;
						ТекДокументОбъектДвижениеПродукцииИМатериалов.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой;
						ТекДокументОбъектДвижениеПродукцииИМатериалов.Статус				= Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
						ПараметрыУчетаПоОрганизации = УчетНДСУП.ПараметрыУчетаПоОрганизации(ТекДокументОбъектДвижениеПродукцииИМатериалов.Организация, 
							ТекДокументОбъектДвижениеПродукцииИМатериалов.Дата,
							ТекДокументОбъектДвижениеПродукцииИМатериалов.Отправитель);
						ТекДокументОбъектДвижениеПродукцииИМатериалов.НаправлениеДеятельности = ШапкаВыпуска.НаправлениеДеятельности;
						// Автоопределение значения налогообложения НДС.
						ТекДокументОбъектДвижениеПродукцииИМатериалов.НалогообложениеНДС	= ?(СтруктураПараметров.Свойство("НалогообложениеНДС"), СтруктураПараметров.НалогообложениеНДС, Неопределено);
						//+25
						ТекДокументОбъектДвижениеПродукцииИМатериалов.Валюта				= ?(ЗначениеЗаполнено(ШапкаВыпуска.Валюта), ШапкаВыпуска.Валюта, Константы.ВалютаРегламентированногоУчета.Получить());
						ТекДокументОбъектДвижениеПродукцииИМатериалов.ВариантПриемкиТоваров	= Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
						//-25
					КонецЕсли;
					
					//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
					
					ВыборкаБлюдаБезХарактеристик = ВыборкаПоЦехам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаБлюдаБезХарактеристик.Следующий() Цикл
					ВыборкаБлюдаБезУпаковок = ВыборкаБлюдаБезХарактеристик.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаБлюдаБезУпаковок.Следующий() Цикл
					ВыборкаБлюда = ВыборкаБлюдаБезУпаковок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаБлюда.Следующий() Цикл
						
						// Выборка по полю "Номенклатура", заполняются выходные изделия(Блюда).
						
						Если ВыборкаБлюда.КоличествоНоменклатуры = 0 Тогда
							// Возможно меняли количество в режиме по факту и получилась нулевая строка, не добавляем.
							Продолжить;
						КонецЕсли;
						
						
						//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
						Если НЕ ТекДокументОбъектДвижениеПродукцииИМатериалов = Неопределено Тогда
							НовСтрокаДвижениеПродукцииИМатериалов = ТекДокументОбъектДвижениеПродукцииИМатериалов.Товары.Добавить();
							НовСтрокаДвижениеПродукцииИМатериалов.Номенклатура				= ВыборкаБлюда.Номенклатура;
							НовСтрокаДвижениеПродукцииИМатериалов.Характеристика			= ВыборкаБлюда.Характеристика;
							НовСтрокаДвижениеПродукцииИМатериалов.Серия						= ВыборкаБлюда.Серия;
							НовСтрокаДвижениеПродукцииИМатериалов.Назначение				= ВыборкаБлюда.Назначение;
							НовСтрокаДвижениеПродукцииИМатериалов.НазначениеОтправителя		= ВыборкаБлюда.Назначение;
							НовСтрокаДвижениеПродукцииИМатериалов.КоличествоУпаковок		= ВыборкаБлюда.КоличествоУпаковокНоменклатуры;
							НовСтрокаДвижениеПродукцииИМатериалов.Количество				= ВыборкаБлюда.КоличествоНоменклатуры;
							НовСтрокаДвижениеПродукцииИМатериалов.Упаковка					= ВыборкаБлюда.УпаковкаНоменклатуры;
							НовСтрокаДвижениеПродукцииИМатериалов.ИдентификаторСтроки		= Новый УникальныйИдентификатор;
							НовСтрокаДвижениеПродукцииИМатериалов.ГруппаПродукции			= ВыборкаБлюда.ГруппаАналитическогоУчета;
							
							Если НЕ ЗначениеЗаполнено(ВыборкаПоЦехам.ЦеховаяКладовая) Тогда
								ТекстОшибки = ТекстОшибки + "
								| Не удалось определить цеховую кладовую производства полуфабриката <"+ВыборкаБлюда.Номенклатура+"> по рецептуре <"+ВыборкаБлюда.РецептураБлюда+">!
								| Необходимо заполнить реквизит ""Цеховая кладовая"" в вышеуказанной рецептуре!";
								Возврат Ложь;
							КонецЕсли;
							
						КонецЕсли;
						//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
						
						//<<Портал-Юг, Давиденко 2019.03.15 [6.2.10 Отражение производства услуг по СКЛ]
							// сохранение выборки для верхнего уровня цикла
							ПЛ_ВыборкаБлюда = ВыборкаБлюда;
							
							ВыборкаБлюда = ВыборкаБлюда.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаБлюда.Следующий() Цикл
						//>>Портал-Юг, Давиденко 2019.03.15
							
						// Заполнение табличной части "Выходные изделия".
						НовСтрокаТЧ							= ТекДокументОбъект.ВыходныеИзделия.Добавить();
						НовСтрокаТЧ.НаправлениеВыпуска		= Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад;
						НовСтрокаТЧ.Получатель				= ВыборкаБлюда.ЦеховаяКладовая; // получатель - кладовая цеха подразделения из шапки(берется либо из рецептуры либо из выпуска в запросе выше).
						//<<Портал-Юг, Давиденко 2019.03.11 [4.2.11 Использование услуг и работ в документе «Выпуск блюд»]
							Если ВыборкаБлюда.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
								НовСтрокаТЧ.НаправлениеВыпуска	= ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение");
								НовСтрокаТЧ.Получатель 			= ВыборкаБлюда.ПодразделениеПроизводства;
							КонецЕсли;
							//>>Портал-Юг, Давиденко 2019.03.11
						НовСтрокаТЧ.Номенклатура			= ВыборкаБлюда.Номенклатура;
						НовСтрокаТЧ.Характеристика			= ВыборкаБлюда.Характеристика;
						НовСтрокаТЧ.Серия					= ВыборкаБлюда.Серия;
						НовСтрокаТЧ.Назначение				= ВыборкаБлюда.Назначение;
						НовСтрокаТЧ.КоличествоУпаковок		= ВыборкаБлюда.КоличествоУпаковокНоменклатуры;
						НовСтрокаТЧ.Количество				= ВыборкаБлюда.КоличествоНоменклатуры;
						//<<Портал-Юг, Давиденко 2019.03.15 [6.2.10 Отражение производства услуг по СКЛ]
						НовСтрокаТЧ.КоличествоУпаковок		= ВыборкаБлюда.ПЛ_КоличествоУпаковокНоменклатуры;
						НовСтрокаТЧ.Количество				= ВыборкаБлюда.ПЛ_КоличествоНоменклатуры;
						//>>Портал-Юг, Давиденко 2019.03.15
						НовСтрокаТЧ.Упаковка				= ВыборкаБлюда.УпаковкаНоменклатуры;
						НовСтрокаТЧ.ИдентификаторСтроки		= Новый УникальныйИдентификатор;
						НовСтрокаТЧ.НомерГруппыЗатрат		= ТекНомерГруппыЗатрат;
						НовСтрокаТЧ.Подразделение			= ВыборкаБлюда.ПодразделениеПроизводства;
						
						//<<Портал-Юг, Давиденко 2019.03.15 [6.2.10 Отражение производства услуг по СКЛ]
						НовСтрокаТЧ.ПЛ_ГруппаФинансовогоУчетаНоменклатуры			= ВыборкаБлюда.ПЛ_ЗначениеАналитикиПродаж;
						//>>Портал-Юг, Давиденко 2019.03.15
							
						//ВидЗапасов
						
						ВыборкаДетальная = ВыборкаБлюда.Выбрать();
						Пока ВыборкаДетальная.Следующий() Цикл
							// Детальная выборка, заполнение ТЧ "МатериалыИРаботы".
							
							Если ВыборкаДетальная.КоличествоИнгредиентаФакт < 0.001 Тогда
								// Ситуация, когда затраченного ингредиента оказалось менее 0,001.
								// Такая строка в ТЧ не добавляется.
								Продолжить;
							КонецЕсли;
							
							Если ВыборкаДетальная.питВидНоменклатурыИнгредиента = Перечисления.питВидыНоменклатуры.ТехнологическийИнгредиент Тогда
								// Технологические ингредиенты в производство не добавляем.
								Продолжить;
							КонецЕсли;
							
							НовСтрокаТЧ						= ТекДокументОбъект.МатериалыИРаботы.Добавить();
							НовСтрокаТЧ.Склад				= ШапкаВыпуска.Склад;			// Отправитель всегда склад из шапки выпуска, потому что мы именно его обеспечиваем.
							НовСтрокаТЧ.Подразделение		= ШапкаВыпуска.Подразделение;	// Отправитель всегда подразделение из шапки выпуска, потому что мы именно его обеспечиваем.
							НовСтрокаТЧ.Номенклатура		= ВыборкаДетальная.Ингредиент;
							НовСтрокаТЧ.Характеристика		= ВыборкаДетальная.ХарактеристикаИнгредиента;
							НовСтрокаТЧ.Назначение			= ВыборкаДетальная.НазначениеИнгредиента;
							//НовСтрокаТЧ.Серия				= ВыборкаДетальная.СерияИнгредиента;
							НовСтрокаТЧ.КоличествоУпаковок	= ВыборкаДетальная.КоличествоУпаковокИнгредиентаФакт;
							НовСтрокаТЧ.Количество			= ВыборкаДетальная.КоличествоИнгредиентаФакт;
							//<<Портал-Юг, Давиденко 2019.03.15 [6.2.10 Отражение производства услуг по СКЛ]   
							НовСтрокаТЧ.КоличествоУпаковок	= ВыборкаДетальная.ПЛ_КоличествоУпаковокИнгредиента;
							НовСтрокаТЧ.Количество			= ВыборкаДетальная.ПЛ_КоличествоИнгредиента;
							//>>Портал-Юг, Давиденко 2019.03.15
							НовСтрокаТЧ.Упаковка			= ВыборкаДетальная.УпаковкаИнгредиента;
							НовСтрокаТЧ.СтатьяКалькуляции	= ?(ЗначениеЗаполнено(ВыборкаДетальная.СтатьяКалькуляции), ВыборкаДетальная.СтатьяКалькуляции,ШапкаВыпуска.СтатьяКалькуляции);
							НовСтрокаТЧ.НомерГруппыЗатрат	= ТекНомерГруппыЗатрат;
							//+25
							НовСтрокаТЧ.ИдентификаторСтроки	= Новый УникальныйИдентификатор;
							//-25
							//<<Портал-Юг, Давиденко 2019.03.24 [6.2.10 Отражение производства услуг по СКЛ]
								// наполнение таблицы всеми ингредиентами 
								ПЛ_НоваяСтрокаТЗ = ПЛ_ТЗДляКонтроляКоличества.Добавить();
								ЗаполнитьЗначенияСвойств(ПЛ_НоваяСтрокаТЗ, ВыборкаДетальная);
								
								ПЛ_НоваяСтрокаТЗ.ГруппаФинансовогоУчета = ВыборкаДетальная.ПЛ_ЗначениеАналитикиПродаж;
								ПЛ_НоваяСтрокаТЗ.Серия = ВыборкаДетальная.Серия;
								ПЛ_НоваяСтрокаТЗ.Количество = ВыборкаДетальная.КоличествоИнгредиентаФакт;
								ПЛ_НоваяСтрокаТЗ.КоличествоУпаковок = ВыборкаДетальная.КоличествоУпаковокИнгредиентаФакт;
								ПЛ_НоваяСтрокаТЗ.КоличествоКонтроль = ВыборкаДетальная.ПЛ_КоличествоИнгредиента;
								ПЛ_НоваяСтрокаТЗ.КоличествоУпаковокКонтроль = ВыборкаДетальная.ПЛ_КоличествоУпаковокИнгредиента;
								//>>Портал-Юг, Давиденко 2019.03.24							
						КонецЦикла;
						
						// ТРУДОЗАТРАТЫ
						ПоискПоТрудозатратам.ИдентификаторБлюда = ВыборкаБлюда.ИдентификаторСтроки;
						Пока ВыборкаТрудозатраты.НайтиСледующий(ПоискПоТрудозатратам) Цикл
							
							ТекДокументОбъект.РаспоряжениеДляТрудозатрат = ЗначениеЗаполнено(ШапкаВыпуска.ИсполнительТрудозатрат);
							
							// Заполнение ТЧ "Трудозатраты".
							НовСтрокаТЧ						= ТекДокументОбъект.Трудозатраты.Добавить();
							НовСтрокаТЧ.Подразделение		= ВыборкаТрудозатраты.Подразделение;
							НовСтрокаТЧ.ВидРабот			= ВыборкаТрудозатраты.ВидРабот;
							НовСтрокаТЧ.Количество			= ВыборкаТрудозатраты.Количество;
							НовСтрокаТЧ.СтатьяКалькуляции	= ВыборкаТрудозатраты.СтатьяКалькуляции;
							НовСтрокаТЧ.НомерГруппыЗатрат	= ТекНомерГруппыЗатрат;
							НовСтрокаТЧ.Исполнитель			= ШапкаВыпуска.ИсполнительТрудозатрат;
							
						КонецЦикла;
						ВыборкаТрудозатраты.Сбросить();
						
						// Побочные изделия
						ПоискПоПобочнымИзделиям.ИдентификаторБлюда = ВыборкаБлюда.ИдентификаторСтроки;
						Пока ВыборкаПобочныеИзделия.НайтиСледующий(ПоискПоПобочнымИзделиям) Цикл
							
							// Заполнение ТЧ "Трудозатраты".
							НовСтрокаТЧ						= ТекДокументОбъект.ПобочныеИзделия.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, ВыборкаПобочныеИзделия);
							НовСтрокаТЧ.НомерГруппыЗатрат	= ТекНомерГруппыЗатрат;
							НовСтрокаТЧ.НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад;
							НовСтрокаТЧ.ПодразделениеПолучатель = ВыборкаПобочныеИзделия.Подразделение;
							//+25
							НовСтрокаТЧ.ИдентификаторСтроки	= Новый УникальныйИдентификатор;
							//-25
							
						КонецЦикла;
						ВыборкаПобочныеИзделия.Сбросить();
						
						ТекНомерГруппыЗатрат = ТекНомерГруппыЗатрат + 1;
						
						//<<Портал-Юг, Давиденко 2019.03.15 [6.2.10 Отражение производства услуг по СКЛ]
						КонецЦикла;
						ВыборкаБлюда = ПЛ_ВыборкаБлюда;
						//>>Портал-Юг, Давиденко 2019.03.15
						
					КонецЦикла;
					КонецЦикла;
					КонецЦикла;
					
					//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
					Если НЕ ТекДокументОбъектДвижениеПродукцииИМатериалов = Неопределено Тогда
						МассивТекДокументовДвижениеПродукции.Добавить(Новый Структура("ТекДокументОбъектДвижениеПродукцииИМатериалов,ТекРежимЗаписиДвижениеПродукцииИМатериалов"
						,ТекДокументОбъектДвижениеПродукцииИМатериалов,ТекРежимЗаписиДвижениеПродукцииИМатериалов));
					КонецЕсли;
					//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
					
				КонецЦикла;
				
				Если НЕ ТекДокументОбъект = Неопределено Тогда
					
					//<<Портал-Юг, Давиденко 2019.03.24 [6.2.10 Отражение производства услуг по СКЛ]
				ПЛ_ТЗСАналитикой = ПЛ_ТЗДляКонтроляКоличества.Скопировать();
				Если НЕ ТекДокументОбъект = Неопределено Тогда
					// сохраним ТЗ отдельно для поиска аналитики по полной таблице
					
					ПЛ_ТЗДляКонтроляКоличества.Свернуть("Номенклатура, Характеристика, Серия, Назначение, Ингредиент, РецептураБлюда, ХарактеристикаИнгредиента, СерияИнгредиента, Количество, КоличествоУпаковок", "КоличествоКонтроль, КоличествоУпаковокКонтроль"); 
					
					ПЛ_СтруктураПоиска = Новый Структура;
					
					Для Каждого ПЛ_СтрокаТЗ Из ПЛ_ТЗДляКонтроляКоличества Цикл
						
						Если ПЛ_СтрокаТЗ.Количество - ПЛ_СтрокаТЗ.КоличествоКонтроль = 0
							И ПЛ_СтрокаТЗ.КоличествоУпаковок - ПЛ_СтрокаТЗ.КоличествоУпаковокКонтроль = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						ПЛ_СтруктураПоиска.Вставить("Номенклатура", ПЛ_СтрокаТЗ.Номенклатура);
						ПЛ_СтруктураПоиска.Вставить("Ингредиент", ПЛ_СтрокаТЗ.Ингредиент);
						ПЛ_СтруктураПоиска.Вставить("Характеристика", ПЛ_СтрокаТЗ.Характеристика);
						ПЛ_СтруктураПоиска.Вставить("Серия", ПЛ_СтрокаТЗ.Серия);
						ПЛ_СтруктураПоиска.Вставить("Назначение", ПЛ_СтрокаТЗ.Назначение);
						ПЛ_СтруктураПоиска.Вставить("РецептураБлюда", ПЛ_СтрокаТЗ.РецептураБлюда);
						ПЛ_СтруктураПоиска.Вставить("ХарактеристикаИнгредиента", ПЛ_СтрокаТЗ.ХарактеристикаИнгредиента);
						ПЛ_СтруктураПоиска.Вставить("СерияИнгредиента", ПЛ_СтрокаТЗ.СерияИнгредиента);
						
						// поиск аналитики по ключам из таблицы с отклонением количества
						ПЛ_СтрокиСАналитикой = ПЛ_ТЗСАналитикой.НайтиСтроки(ПЛ_СтруктураПоиска);
						
						Если ПЛ_СтрокиСАналитикой.Количество() > 0 Тогда
							ПЛ_СтруктураПоиска.Вставить("ПЛ_ГруппаФинансовогоУчетаНоменклатуры", ПЛ_СтрокиСАналитикой[0].ГруппаФинансовогоУчета);
						КонецЕсли;
						
						ПЛ_СтруктураПоиска.Номенклатура = ПЛ_СтруктураПоиска.Ингредиент;
						ПЛ_СтруктураПоиска.Удалить("Ингредиент");
						ПЛ_СтруктураПоиска.Удалить("РецептураБлюда");
						ПЛ_СтруктураПоиска.Удалить("ХарактеристикаИнгредиента");
						ПЛ_СтруктураПоиска.Удалить("СерияИнгредиента");
						// поиск в документе строки, которую необходимо скорректировать
						ПЛ_СтрокиДляКорректировки = ТекДокументОбъект.МатериалыИРаботы.НайтиСтроки(ПЛ_СтруктураПоиска);
						
						// корректируем количество в документе на разницу между итоговым количеством ингридиента по блюду и количеством после деления по аналитикам
						Если ПЛ_СтрокиДляКорректировки.Количество() > 0 Тогда
							ПЛ_СтрокиДляКорректировки[0].Количество = ПЛ_СтрокиДляКорректировки[0].Количество + ПЛ_СтрокаТЗ.Количество - ПЛ_СтрокаТЗ.КоличествоКонтроль;
							ПЛ_СтрокиДляКорректировки[0].КоличествоУпаковок = ПЛ_СтрокиДляКорректировки[0].КоличествоУпаковок + ПЛ_СтрокаТЗ.КоличествоУпаковок - ПЛ_СтрокаТЗ.КоличествоУпаковокКонтроль;
						КонецЕсли;
						ПЛ_СтруктураПоиска.Очистить();
					КонецЦикла;
				КонецЕсли;
				ПЛ_ТЗСАналитикой.Очистить();
				
				ПЛ_ТЗДляКонтроляКоличества.Очистить();
				ПЛ_ТЗДляКонтроляКоличества = ПЛ_ТЗСАналитикой.Скопировать();
				//>>Портал-Юг, Давиденко 2019.03.24
				
					//+Серии
					Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
						ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументВыпускБлюд , тблСозданныеДокументы);
					КонецЕсли;
					//-Серии
					
					//+ОтложенноеПроведение
					Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
						ИсходныйРежимЗаписи	= ТекРежимЗаписи;
						ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
					КонецЕсли;
					//-ОтложенноеПроведение
					
					// Запись заполненного документа "Производство без заказа".
					Попытка
						Если НЕ ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения // Отмена проведения произошла ранее
							И НЕ (ТекДокументОбъект.ЭтоНовый() И НЕ ТекДокументОбъект.ВыходныеИзделия.Количество()) Тогда // Пустой новый документ не записываем.
							ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
							Если ЗначениеЗаполнено(ШапкаВыпуска.ДокументОснование) И ТипЗнч(ШапкаВыпуска.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
								ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
							КонецЕсли;
							ТекДокументОбъект.Записать(ТекРежимЗаписи);
						КонецЕсли;
					Исключение
						ТекстОшибки = ТекстОшибки + "
						|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
						| по документу Общепит """+ДокументВыпускБлюд+"""
						|по причине: <"+ОписаниеОшибки()+">";
						Возврат Ложь;
					КонецПопытки;
					
					//+ОтложенноеПроведение
					Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
						ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
						ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
						СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
						Если НЕ ВсеОк Тогда 
							Возврат ВсеОк;
						КонецЕсли;
						ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
						СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
						Если НЕ ВсеОк Тогда 
							Возврат ВсеОк;
						КонецЕсли;
					КонецЕсли;
					//-ОтложенноеПроведение
					
				КонецЕсли;
				
				//+ОтложенноеПроведение
				ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
				//-ОтложенноеПроведение
				
				// Добавление записи в результирующую таблицу в случае успешной записи документов.
				ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
				
				//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
				
				Для каждого ТекДокументДвижениеПродукции Из МассивТекДокументовДвижениеПродукции Цикл
					
					ТекДокДвижениеПродукции = ТекДокументДвижениеПродукции.ТекДокументОбъектДвижениеПродукцииИМатериалов;
					ТекРежимЗаписиДвижениеПродукции = ТекДокументДвижениеПродукции.ТекРежимЗаписиДвижениеПродукцииИМатериалов;
					
					Если НЕ ТекДокДвижениеПродукции = Неопределено Тогда
						//И Не ПустаяСтрока(ТекДокДвижениеПродукции.ВерсияДанных)
						
						//+Серии
						Если НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
							ЗаполнитьСерииТиповогоДокумента(ТекДокДвижениеПродукции, ДокументВыпускБлюд, 0);
						КонецЕсли;
						//-Серии
						
						//+ОтложенноеПроведение
						Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
							ИсходныйРежимЗаписиДвижениеПродукции	= ТекРежимЗаписиДвижениеПродукции;
							ТекРежимЗаписиДвижениеПродукции			= РежимЗаписиДокумента.Запись;
						КонецЕсли;
						//-ОтложенноеПроведение
						
						Попытка
							ТекДокДвижениеПродукции.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
							ТекДокДвижениеПродукции.Записать(ТекРежимЗаписиДвижениеПродукции);
						Исключение
							ТекстОшибки = ТекстОшибки + "
							|Ошибка записи документа """ + ТекДокДвижениеПродукции.Метаданные().Представление() + """
							| по документу Общепит """+ДокументВыпускБлюд+"""
							|по причине: <"+ОписаниеОшибки()+">";
							Возврат Ложь;
						КонецПопытки;
						
						//+ОтложенноеПроведение
						Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
							ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписиДвижениеПродукции);
							ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокДвижениеПродукции.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
							СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
							Если НЕ ВсеОк Тогда 
								Возврат ВсеОк;
							КонецЕсли;
							ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокДвижениеПродукции.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
							СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
							Если НЕ ВсеОк Тогда 
								Возврат ВсеОк;
							КонецЕсли;
						КонецЕсли;
						//-ОтложенноеПроведение
						
					КонецЕсли;
					
					//+ОтложенноеПроведение
					ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
					//-ОтложенноеПроведение
					
					// Добавление записи в результирующую таблицу в случае успешной записи документов.
					ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокДвижениеПродукции, тблСозданныеДокументы,,ТекСинхронизирован);
					
				КонецЦикла;
				
				//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли; // Если НЕ РезультатЗапроса.Пустой() Тогда
	
	// "Обнуление" переменной текущего объекта.
	ТекДокументОбъект = Неопределено;
	
	// Если остались лишние типовые документы, то нужно пометить их на удаление.
	Пока ВыборкаСуществующиеПроизводстваБезЗаказа.Следующий() Цикл
		
		ТекДокументОбъект = ВыборкаСуществующиеПроизводстваБезЗаказа.ПроизводствоБезЗаказа.ПолучитьОбъект();
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(Истина), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Если НЕ ВыборкаСуществующиеПроизводстваБезЗаказа.ПометкаУдаления Тогда
				Попытка
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					Если ЗначениеЗаполнено(ШапкаВыпуска.ДокументОснование) И ТипЗнч(ШапкаВыпуска.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
						ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
					КонецЕсли;
					ТекДокументОбъект.УстановитьПометкуУдаления(Истина);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		//+ОтложенноеПроведение
		ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
		//-ОтложенноеПроведение
		
		// Добавление записи в результирующую таблицу.
		ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
		
	КонецЦикла;
	
	//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
	
	// "Обнуление" переменной .
	ТекДокументДвижениеПродукции = Неопределено;
	
	// Если остались лишние типовые документы, то нужно пометить их на удаление.
	Пока ВыборкаСуществующиеДвиженияПродукцииИМатериалов.Следующий() Цикл
		
		ТекДокументДвижениеПродукции = ВыборкаСуществующиеДвиженияПродукцииИМатериалов.ДокументСсылка.ПолучитьОбъект();
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(Истина), ТекДокументДвижениеПродукции.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументДвижениеПродукции.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			Если НЕ ВыборкаСуществующиеДвиженияПродукцииИМатериалов.ПометкаУдаления Тогда
				Попытка
					ТекДокументДвижениеПродукции.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокументДвижениеПродукции.УстановитьПометкуУдаления(Истина);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументДвижениеПродукции.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		//+ОтложенноеПроведение
		ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
		//-ОтложенноеПроведение
		
		// Добавление записи в результирующую таблицу.
		ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументДвижениеПродукции, тблСозданныеДокументы,,ТекСинхронизирован);
		
	КонецЦикла;
	
	//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ В ОСНОВНОЙ ЦЕХ
	
	
	Возврат Истина;
	
КонецФункции // СформироватьПроизводствоБезЗаказа22ПоВыпускуБлюд()

// Функция формирует документ "Передача материалов в производство" для всех ингредиентов не из автопеределов
//  в ТЧ "Ингредиенты" переданного документа "Выпуск блюд" или обновляет существующие.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьПередачуМатериаловПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Передача материалов в производство",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ПередачаМатериаловВПроизводство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаМатериаловВПроизводство КАК ПередачаМатериаловВПроизводство
	|		ПО (втДокументыВыпускПродукции.ТиповойДокумент = ПередачаМатериаловВПроизводство.Ссылка)
	|";
	Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
	Иначе
		ТекДокументОбъект = Документы["ПередачаМатериаловВПроизводство"].СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	
	ТекДокументОбъект.Дата					= ДокументВыпускБлюд.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.Организация			= ДокументВыпускБлюд.Организация;
	ТекДокументОбъект.Склад					= ДокументВыпускБлюд.Склад;
	ТекДокументОбъект.Подразделение			= ДокументВыпускБлюд.Подразделение;
	ТекДокументОбъект.Ответственный			= ДокументВыпускБлюд.Ответственный;
	ТекДокументОбъект.Комментарий			= ДокументВыпускБлюд.Комментарий;
	ТекДокументОбъект.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ПередачаВПроизводство;
	ТекДокументОбъект.Статус				= Перечисления.СтатусыПередачМатериаловВПроизводство.Принято;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.Серии.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
	
	// Получение данных по табличной части "Ингредиенты" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питВыпускБлюдИнгредиенты.Ингредиент,
	|	питВыпускБлюдИнгредиенты.УпаковкаИнгредиента,
	|	питВыпускБлюдИнгредиенты.КоличествоУпаковокИнгредиентаФакт КАК КоличествоУпаковокИнгредиентаФакт,
	|	питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт КАК КоличествоИнгредиентаФакт
	|ПОМЕСТИТЬ втИнгредиенты
	|ИЗ
	|	Документ.питВыпускБлюд.Ингредиенты КАК питВыпускБлюдИнгредиенты
	|ГДЕ
	|	питВыпускБлюдИнгредиенты.Ссылка = &Ссылка
	|	И питВыпускБлюдИнгредиенты.ИзАвтопеределов = ЛОЖЬ
	|	И НЕ питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт = 0
	|	И НЕ питВыпускБлюдИнгредиенты.Ингредиент.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	питВыпускБлюдЗамены.ИнгредиентЗамена,
	|	питВыпускБлюдЗамены.УпаковкаИнгредиентаЗамена,
	|	питВыпускБлюдЗамены.КоличествоУпаковокИнгредиентаЗамена,
	|	питВыпускБлюдЗамены.КоличествоИнгредиентаЗамена
	|ИЗ
	|	Документ.питВыпускБлюд.Замены КАК питВыпускБлюдЗамены
	|ГДЕ
	|	питВыпускБлюдЗамены.Ссылка = &Ссылка
	|	И НЕ питВыпускБлюдЗамены.ИнгредиентЗамена.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИнгредиенты.Ингредиент,
	|	втИнгредиенты.УпаковкаИнгредиента,
	|	СУММА(втИнгредиенты.КоличествоУпаковокИнгредиентаФакт) КАК КоличествоУпаковокИнгредиентаФакт,
	|	СУММА(втИнгредиенты.КоличествоИнгредиентаФакт) КАК КоличествоИнгредиентаФакт
	|ИЗ
	|	втИнгредиенты КАК втИнгредиенты
	|
	|СГРУППИРОВАТЬ ПО
	|	втИнгредиенты.Ингредиент,
	|	втИнгредиенты.УпаковкаИнгредиента";
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	
	// Обход таб. части и заполнение таб. частей "Товары" документа "Передача материалов в производство".
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовСтрока						= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура			= Выборка.Ингредиент;
		НовСтрока.Упаковка				= Выборка.УпаковкаИнгредиента;
		НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковокИнгредиентаФакт;
		НовСтрока.Количество			= Выборка.КоличествоИнгредиентаФакт;
		
	КонецЦикла;
	
	////////////////////////////////////////////////////////
	// Если выпуск блюд создан на основании плана меню, то ищем связанный с планом меню
	// заказ материалов в производство и пытаемся его связать построчно с текущим создаваемым\обновляемым
	// документом "Передача материалов в производство".
	ОснованиеВыпуска = ДокументВыпускБлюд.ДокументОснование;
	Если НЕ ОснованиеВыпуска = Неопределено
		И ЗначениеЗаполнено(ОснованиеВыпуска) 
		И ТипЗнч(ОснованиеВыпуска) = Тип("ДокументСсылка.питПланМеню") Тогда
		
		// Пишем параметры записи текущего синхронизируемого документа "Передача метариалов в производство" в структуру параметров.
		Если НЕ СтруктураПараметров.Свойство("ПараметрыЗаписиПередачаМатериалов") Тогда
			СтруктураПараметров.Вставить("ПараметрыЗаписиПередачаМатериалов", ПараметрыЗаписи);
		КонецЕсли;
		
		// Попытка выполнить привязку/отвязку "Передачи материалов в производство" и "Заказа материалов в производство" - подкладного 
		// документа от "План меню", на основании которого создан текущий выпуск продукции.
		ВсеОк = СвязатьОтвязатьПередачуВПроизводствоСЗаказомНаПроизводство(ТекДокументОбъект, ОснованиеВыпуска, СтруктураПараметров, ТекстОшибки);
		Если НЕ ВсеОк Тогда
			// Что-то пошло не так.
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА "ПЕРЕДАЧА МАТЕРИАЛОВ В ПРОИЗВОДСТВО"
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ИсходныйРежимЗаписи	= ТекРежимЗаписи;
		ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Попытка
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументВыпускБлюд+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	// Если была произведена отвязка "Передачи материалов в производство" от "Заказа материалов в производство", то
	// будет инициализирован флаг "Дописать заказ", который означает, что необходимо провести ИЗМЕНЕННЫЙ документ заказа после записи
	// документа передачи материалов.
	ДозаписатьЗаказ = Ложь;
	Если СтруктураПараметров.Свойство("ДозаписатьЗаказ") Тогда
		ДозаписатьЗаказ = СтруктураПараметров.ДозаписатьЗаказ;
	КонецЕсли;
	
	Если ДозаписатьЗаказ Тогда
		
		// Получаем объект измененного документа заказа материалов в производство.
		ДокЗаказОбъект = Неопределено;
		Если СтруктураПараметров.Свойство("ДокЗаказОбъект") Тогда
			ДокЗаказОбъект = СтруктураПараметров.ДокЗаказОбъект;
		КонецЕсли;
		
		Если ДокЗаказОбъект = Неопределено Тогда
			// Не нашли документ заказ.
			ТекстОшибки = ТекстОшибки + "
			|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументВыпускБлюд+"""
			|по причине: <Не удалось отвязать документ ""Заказ материалов в производство"" от записываемого документа ""Передача материалов в производство"">";
			Возврат Ложь;
		КонецЕсли;
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ИсходныйРежимЗаписиЗаказ	= РежимЗаписиДокумента.Проведение;
			ТекРежимЗаписиЗаказ			= РежимЗаписиДокумента.Запись;
		КонецЕсли;
		//-ОтложенноеПроведение
		
		// Проведение документа заказ.
		Попытка
			ДокЗаказОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ДокЗаказОбъект.Записать(ТекРежимЗаписиЗаказ);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументВыпускБлюд+"""
			|по причине: <Не удалось отвязать документ ""Заказ материалов в производство"" от записываемого документа ""Передача материалов в производство"">";
			Возврат Ложь;
		КонецПопытки;
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписиЗаказ);
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ДокЗаказОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ДокЗаказОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		КонецЕсли;
		//-ОтложенноеПроведение
		
	КонецЕсли;
	
	//+ОтложенноеПроведение
	ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
	//-ОтложенноеПроведение
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "Оприходование излишков товаров" или обновляет существующие.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьОприходованиеИзлишковПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, ОтложенноеФормирование = Ложь)
	
	Если НЕ СтруктураПараметров.Свойство("ФормироватьИзлишки") Тогда
		ФормироватьИзлишки = Константы.питФормироватьОприходованиеИзлишковПоВыпускуБлюд.Получить();
		СтруктураПараметров.Вставить("ФормироватьИзлишки", ФормироватьИзлишки);
	Иначе
		ФормироватьИзлишки = СтруктураПараметров.ФормироватьИзлишки;
	КонецЕсли;
	
	//+БазовоеСмещение
	Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
		СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
	КонецЕсли;
	БазовоеСмещение = 0;
	Если СтруктураПараметров.питСмещатьДатыТиповыхДокументов Тогда
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", "ОприходованиеИзлишковТоваров", 0));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещение = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
	КонецЕсли;
	//-БазовоеСмещение
	
	НовыйДокументИзлишков = Ложь;
	
	Если СтруктураПараметров.Свойство("ДокументОбъектИзлишков") Тогда
		
		// Уже ранее получали документ излишков и запомнили его, чтобы не делать еще раз запрос.
		ТекДокументОбъект = СтруктураПараметров.ДокументОбъектИзлишков;
		
	Иначе
		
		Запрос = Новый Запрос;
		
		// Поиск существующего документа "Оприходование излишков товаров",
		// связанного с текущим "Выпуском блюд".
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	питТиповыеДокументы.ТиповойДокумент
		|ПОМЕСТИТЬ втДокументыВыпускПродукции
		|ИЗ
		|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
		|ГДЕ
		|	питТиповыеДокументы.ДокументОбщепит = &Документпит
		|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ОприходованиеИзлишковТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДокументыВыпускПродукции.ТиповойДокумент
		|ИЗ
		|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеИзлишковТоваров КАК ОприходованиеИзлишковТоваров
		|		ПО втДокументыВыпускПродукции.ТиповойДокумент = ОприходованиеИзлишковТоваров.Ссылка";
		Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если ФормироватьИзлишки Тогда
			// Если документ найден, то получаем объект иначе создаем новый.
			Если Выборка.Следующий() Тогда
				ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
			ИначеЕсли НЕ ДокументВыпускБлюд.Проведен Тогда
				Возврат Истина; // Для непроведенного выпуска, если раньше не было оприходования, то не создаем.
			Иначе
				ТекДокументОбъект = Документы.ОприходованиеИзлишковТоваров.СоздатьДокумент();
				НовыйДокументИзлишков = Истина;
			КонецЕсли;
		Иначе
			Если Выборка.Следующий() Тогда
				// Сейчас не формируем излишки, но уже ранее был создан такой документ
				ТекДокументСсылка = Выборка.ТиповойДокумент;
				
				//+ОтложенноеПроведение
				Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
					ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.ОтвязатьТиповойДокумент, ТекДокументСсылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
					Возврат ВсеОк;
				Иначе
				//-ОтложенноеПроведение
					Возврат УдалитьСвязьТиповогоДокументаСДокументомПит(ТекДокументСсылка, ДокументВыпускБлюд, ТекстОшибки);
				КонецЕсли;
				
			Иначе
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если НЕ ОтложенноеФормирование И ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если НЕ НовыйДокументИзлишков Тогда
			// В случае отмены проведения оприходованием занимаемся позже, в самую последнюю очередь, 
			// т.к. он делаем движения в плюс по свободным остаткам и отменять их нужно после отмены всех остальных типовых документов.
			СтруктураПараметров.Вставить("ОтложитьФормированиеОприходованияИзлишков", Истина); 
			// Запоминаем, чтобы потом второй раз не получать
			СтруктураПараметров.Вставить("ДокументОбъектИзлишков", ТекДокументОбъект); 
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления И НЕ НовыйДокументИзлишков Тогда
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Получение данных по табличной части "Ингредиенты" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	втИнгредиенты.Ингредиент КАК Номенклатура,
	|	втИнгредиенты.Характеристика КАК Характеристика,
	|	втИнгредиенты.Назначение КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	СУММА(втИнгредиенты.КоличествоИнгредиентаФакт) КАК КоличествоИнгредиентаФакт
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.питВыпускБлюд.Ингредиенты КАК втИнгредиенты
	|ГДЕ
	|	втИнгредиенты.Ссылка = &Ссылка
	|	И НЕ втИнгредиенты.ИзАвтопеределов
	|	И НЕ втИнгредиенты.Ингредиент.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|	И втИнгредиенты.Ингредиент.ТипНоменклатуры В (&СкладскиеТипыНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	втИнгредиенты.Ингредиент,
	|	втИнгредиенты.Характеристика,
	|	втИнгредиенты.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	питВыпускБлюдТовары.Номенклатура,
	|	питВыпускБлюдТовары.Характеристика,
	|	питВыпускБлюдТовары.Назначение,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	СУММА(питВыпускБлюдТовары.Количество)
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	|ГДЕ
	|	питВыпускБлюдТовары.Ссылка = &Ссылка
	|	И (питВыпускБлюдТовары.ПриготовлениеЗапрещено = ИСТИНА
	|	ИЛИ питВыпускБлюдТовары.Рецептура = ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка))
	|	И НЕ питВыпускБлюдТовары.Номенклатура.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.БизнесЛанч)
	|	И питВыпускБлюдТовары.Номенклатура.ТипНоменклатуры В (&СкладскиеТипыНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|питВыпускБлюдТовары.Номенклатура,
	|питВыпускБлюдТовары.Характеристика,
	|питВыпускБлюдТовары.Назначение
	|;
	|"+питОбщегоНазначенияСервер.ПолучитьТекстЗапросаДляВычетаДвиженийРегистратора()+"
	|;
	|"+питОбщегоНазначенияСервер.ПолучитьТекстЗапросаСвободныеОстатки("втТовары","втОстаткиБезВычета")+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент КАК ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыТиповые
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &ДокументОбщепит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|	И питТиповыеДокументы.ПричинаТиповогоДокумента = 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК Номенклатура,
	|	ДвижениеПродукцииИМатериаловТовары.Характеристика КАК Характеристика,
	|	ДвижениеПродукцииИМатериаловТовары.Назначение КАК Назначение,
	|	&Склад КАК Склад,
	|	ДвижениеПродукцииИМатериаловТовары.Серия КАК Серия,
	|	ДвижениеПродукцииИМатериаловТовары.Количество КАК Количество
	|ПОМЕСТИТЬ втОстаткиБезГруппировки
	|ИЗ
	|	втДокументыТиповые КАК втДокументыТиповые
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
	|		ПО втДокументыТиповые.ТиповойДокумент = ДвижениеПродукцииИМатериаловТовары.Ссылка
	|ГДЕ
	|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОстаткиБезВычета.Номенклатура КАК Номенклатура,
	|	втОстаткиБезВычета.Характеристика КАК Характеристика,
	|	втОстаткиБезВычета.Назначение КАК Назначение,
	|	втОстаткиБезВычета.Склад КАК Склад,
	|	втОстаткиБезВычета.Серия КАК Серия,
	|	втОстаткиБезВычета.Количество КАК Количество
	|ИЗ
	|	втОстаткиБезВычета КАК втОстаткиБезВычета
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстаткиБезГруппировки.Номенклатура КАК Номенклатура,
	|	втОстаткиБезГруппировки.Характеристика КАК Характеристика,
	|	втОстаткиБезГруппировки.Назначение КАК Назначение,
	|	втОстаткиБезГруппировки.Склад КАК Склад,
	|	втОстаткиБезГруппировки.Серия КАК Серия,
	|	СУММА(втОстаткиБезГруппировки.Количество) КАК Количество
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	втОстаткиБезГруппировки КАК втОстаткиБезГруппировки
	|СГРУППИРОВАТЬ ПО
	|	втОстаткиБезГруппировки.Номенклатура,
	|	втОстаткиБезГруппировки.Характеристика,
	|	втОстаткиБезГруппировки.Назначение,
	|	втОстаткиБезГруппировки.Склад,
	|	втОстаткиБезГруппировки.Серия
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Ингредиент,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Назначение КАК Назначение,
	|	(втТовары.КоличествоИнгредиентаФакт - isnull(втОстатки.Количество,0)) КАК Количество
	|ИЗ 
	|	втТовары ЛЕВОЕ СОЕДИНЕНИЕ втОстатки 
	|		ПО втТовары.Номенклатура = втОстатки.Номенклатура
	|			И втТовары.Характеристика = втОстатки.Характеристика
	|			И втТовары.Назначение = втОстатки.Назначение
	|ГДЕ isnull(втОстатки.Количество,0) < втТовары.КоличествоИнгредиентаФакт
	|";
	
	Запрос.УстановитьПараметр("ДокументОбщепит", ДокументВыпускБлюд.Ссылка);
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	Запрос.УстановитьПараметр("НаДату", КонецМесяца(ДокументВыпускБлюд.Дата));
	Запрос.УстановитьПараметр("НаДатуДата", КонецМесяца(ДокументВыпускБлюд.Дата));
	Запрос.УстановитьПараметр("Склад", ДокументВыпускБлюд.Склад);
	
	СкладскиеТипыНоменклатуры = питОбщегоНазначения.ПолучитьСкладскиеТипыНоменклатуры();
	Запрос.УстановитьПараметр("СкладскиеТипыНоменклатуры", СкладскиеТипыНоменклатуры);
	
	Если ЗначениеЗаполнено(ДокументВыпускБлюд.Склад) Тогда
		ОрдерПоИзлишкам = питОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументВыпускБлюд.Склад,"ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач");
	Иначе
		ОрдерПоИзлишкам = Ложь; // По умолчанию
	КонецЕсли;
	
	// Обход таб. части и заполнение таб. частей "Товары".
	Если НЕ ОрдерПоИзлишкам Тогда
		РезультатЗапроса = Запрос.Выполнить();
	Иначе
		РезультатЗапроса = Неопределено;
	КонецЕсли;
	
	Если ОрдерПоИзлишкам ИЛИ РезультатЗапроса.Пустой() Тогда
		
		// Нечего оприходовать, всего хватает. Документ не нужен! Существующий пометим на удаление
		Если НЕ ПустаяСтрока(ТекДокументОбъект.ВерсияДанных) Тогда
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(Истина), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				
				Попытка
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокументОбъект.УстановитьПометкуУдаления(Истина);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
			//+ОтложенноеПроведение
			ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
			//-ОтложенноеПроведение
			
			// Добавление записи в результирующую таблицу в случае успешной записи документов.
			ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
			
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	
	ТекДокументОбъект.Дата					= ДокументВыпускБлюд.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0) - БазовоеСмещение;
	ТекДокументОбъект.Ответственный			= ДокументВыпускБлюд.Ответственный;
	ТекДокументОбъект.Комментарий			= ДокументВыпускБлюд.Комментарий;
	ТекДокументОбъект.Организация			= ДокументВыпускБлюд.Организация;
	ТекДокументОбъект.Ответственный			= ДокументВыпускБлюд.Ответственный;
	ТекДокументОбъект.Подразделение			= ДокументВыпускБлюд.Подразделение;
	ТекДокументОбъект.Склад					= ДокументВыпускБлюд.Склад;
	ТекДокументОбъект.ВидЦены				= питОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументВыпускБлюд.Склад,"УчетныйВидЦены");
	ТекДокументОбъект.СтатьяДоходов			= питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСтатьяОприходованияИзлишков");
	ТекДокументОбъект.Валюта = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(
		Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(ТекДокументОбъект.ВидЦены).ВалютаЦены);
	ТекДокументОбъект.НаправлениеДеятельности = ДокументВыпускБлюд.НаправлениеДеятельности;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Для того, чтобы случайно не оприходовать нулевое количество
		Если Окр(Выборка.Количество, 3) = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НовСтрока						= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура			= Выборка.Ингредиент;
		НовСтрока.Характеристика		= Выборка.Характеристика;
		НовСтрока.Назначение			= Выборка.Назначение;
		НовСтрока.Количество			= Выборка.Количество;
		
	КонецЦикла;
	
	// Заполнение ЦЕН
	Если ЗначениеЗаполнено(ТекДокументОбъект.ВидЦены) Тогда
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
		КолонкиПоЗначению = Новый Структура("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Дата", ТекДокументОбъект.Дата);
		ПараметрыЗаполнения.Вставить("Организация", ТекДокументОбъект.Организация);
		ПараметрыЗаполнения.Вставить("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
		ПараметрыЗаполнения.Вставить("ВидЦены", ТекДокументОбъект.ВидЦены);
		ПараметрыЗаполнения.Вставить("КолонкиПоЗначению", КолонкиПоЗначению);
		ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
			ТекДокументОбъект.Товары, // Табличная часть
			, // Выделенные строки (заполнять во всех строках)
			ПараметрыЗаполнения,
			СтруктураДействий);
		
		// Если цена заполнилась, а сумма меньше 1 копейки, тогда количество подгоняем под 1 копейку.
		Для каждого ТекСтрокаТовары Из ТекДокументОбъект.Товары Цикл
			Если ТекСтрокаТовары.Цена <> 0 И ТекСтрокаТовары.Сумма = 0 Тогда
				МинимальноМожноОприходовать = 0.01 / ТекСтрокаТовары.Цена;
				СтоимостьМинимальноОприходованного = 0.01;
				Если МинимальноМожноОприходовать < 0.001 Тогда
					СтоимостьМинимальноОприходованного = 0.001 * 0.01 / МинимальноМожноОприходовать;
					МинимальноМожноОприходовать = 0.001;
				КонецЕсли;
				ТекСтрокаТовары.Количество	= МинимальноМожноОприходовать;
				ТекСтрокаТовары.Сумма		= СтоимостьМинимальноОприходованного;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Проверка на заполненность цен, отсутствие цен критично и это ошибка!
	ТоварыСНезаполненнымиЦенами = Новый Массив;
	Для каждого ТекСтрокаТовары Из ТекДокументОбъект.Товары Цикл
		Если ТекСтрокаТовары.Цена = 0 ИЛИ ТекСтрокаТовары.Сумма = 0 Тогда
			ТоварыСНезаполненнымиЦенами.Добавить(ТекСтрокаТовары.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	Если ТоварыСНезаполненнымиЦенами.Количество() Тогда
		
		ТекстОшибки = ТекстОшибки + "
		|Ошибка заполнения документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументВыпускБлюд+"""
		|по причине: Не заполнены цены по виду цен <"+ТекДокументОбъект.ВидЦены+"> для следующих номенклатурных позиций:
		|";
		Для Сч = 0 По ТоварыСНезаполненнымиЦенами.Количество()-1 Цикл
			ТекстОшибки = ТекстОшибки + ?(Сч=0,"",",")+"<"+ТоварыСНезаполненнымиЦенами[Сч]+">";
		КонецЦикла;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ТИПОВОГО ДОКУМЕНТА 
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ИсходныйРежимЗаписи	= ТекРежимЗаписи;
		ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Попытка
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументВыпускБлюд+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//+ОтложенноеПроведение
	ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
	//-ОтложенноеПроведение
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
	
	Возврат Истина;
	
КонецФункции

// Функция связывает или отвязывает переданный документ "Передача материалов в производство" 
//  с документом "Заказ материалов в производство", созданным как подкладной у переданного док. "План меню".
//
// Параметры:
//  ДокПередачаМатериаловОбъект	 - ДокОбъект.ПередачаМатериаловВПроизводство - Текущий обновляемый/создаваемый документ.
//  ДокПланМенюСсылка			 - ДокСсылка.питПланМеню - Ссылка на план меню, на основании которого был создан выпуск блюд.
//  СтруктураПараметров			 - Структура - Параметры.
//  ТекстОшибки					 - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Булево - Успешность выполнения.
//
Функция СвязатьОтвязатьПередачуВПроизводствоСЗаказомНаПроизводство(ДокПередачаМатериаловОбъект, ДокПланМенюСсылка, СтруктураПараметров, ТекстОшибки = "")
	
	ДокЗаказ = Неопределено;
	
	// Получение парметров записи.
	Если НЕ СтруктураПараметров.Свойство("ПараметрыЗаписиПередачаМатериалов") Тогда
		ТекстОшибки = ТекстОшибки + "Ошибка при попытке связать передачу материалов в производство с заказом в производство. 
		| Не определены параметры записи типового документа!";
		Возврат Ложь;
	КонецЕсли;
	ПараметрыЗаписи = СтруктураПараметров.ПараметрыЗаписиПередачаМатериалов;
	
	// Признак того, какую операцию необходимо выполнить: связать заказ с передачей или отвязать.
	// Зависит от режима записи документа, связывание происходит только в момент проведения.
	Связать = ?(ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение, Истина, Ложь);
	
	// Поиск связанного с планом меню заказа материалов в производство, при этом связанный документ должен быть проведен.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втСвязанныйЗаказ
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ЗаказМатериаловВПроизводство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСвязанныйЗаказ.ТиповойДокумент
	|ИЗ
	|	втСвязанныйЗаказ КАК втСвязанныйЗаказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказМатериаловВПроизводство КАК ЗаказМатериаловВПроизводство
	|		ПО втСвязанныйЗаказ.ТиповойДокумент = ЗаказМатериаловВПроизводство.Ссылка
	|ГДЕ
	|	ЗаказМатериаловВПроизводство.Проведен";
	Запрос.УстановитьПараметр("Документпит", ДокПланМенюСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		// Связанный заказ найден.
		ДокЗаказ = Выборка.ТиповойДокумент;
		
		// Получение объекта заказа.
		ДокЗаказОбъект = ДокЗаказ.ПолучитьОбъект();
		
		// Выборка табличной части "Товары" документов "Заказ материалов в производство" и "Передача материалов в производство"
		// В "Товары заказа" добавляется пустая колонка "Количество отгрузить"(сколько товара нужно поставить "к отгрузке") 
		// и "Код строки"(код строки отгружаемого товара для связи с передачей материалов в производство). 
		// В "Товары передачи" добавляется колонка "Есть заказ" - признак того, что по данной товарной позиции есть строка 
		// в "Заказ материалов в производство", а также колонка "Код строки" для построчной связи с товарными позициями в заказе.
		// Данные колонки будут инициализированы далее по алгоритму.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТоварыПередача.Номенклатура,
		|	ТоварыПередача.Количество
		|ПОМЕСТИТЬ втТоварыПередача
		|ИЗ
		|	&ТоварыПередача КАК ТоварыПередача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тчТоварыЗаказ.Номенклатура,
		|	тчТоварыЗаказ.Количество
		|ПОМЕСТИТЬ втТоварыЗаказ
		|ИЗ
		|	&тчТоварыЗаказ КАК тчТоварыЗаказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТоварыПередача.Номенклатура,
		|	СУММА(втТоварыПередача.Количество) КАК Количество,
		|	МИНИМУМ(ЛОЖЬ) КАК ЕстьЗаказ,
		|	0 КАК КодСтроки
		|ИЗ
		|	втТоварыПередача КАК втТоварыПередача
		|
		|СГРУППИРОВАТЬ ПО
		|	втТоварыПередача.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТоварыЗаказ.Номенклатура,
		|	СУММА(втТоварыЗаказ.Количество) КАК Количество,
		|	СУММА(0) КАК КоличествоОтгрузить,
		|	0 КАК КодСтроки
		|ИЗ
		|	втТоварыЗаказ КАК втТоварыЗаказ
		|
		|СГРУППИРОВАТЬ ПО
		|	втТоварыЗаказ.Номенклатура";
		
		Запрос.УстановитьПараметр("ТоварыПередача", ДокПередачаМатериаловОбъект.Товары.Выгрузить());
		Запрос.УстановитьПараметр("тчТоварыЗаказ", ДокЗаказОбъект.Товары.Выгрузить());
		Результат = Запрос.ВыполнитьПакет();
		
		// Получаем таблицы "Товаров заказа" и "Товаров передачи".
		ТоварыДляПередачи	= Результат[2].Выгрузить();
		ТоварыЗаказа		= Результат[3].Выгрузить();
		
		// Строки заказа будут перезаполнены, лишние в последствии будут удалены.
		МассивСтрокДляУдаления = Новый Массив;
		
		Если Связать Тогда
			
			// Операция связывания строк заказа и передечи в производство.
			
			// Поиск номенклатуры из товаров передачи в товарах заказа и заполнение количества 
			// "для отгрузки" и признака того, что товар есть в заказе.
			Для каждого ТоварДляПередачи Из ТоварыДляПередачи Цикл
				
				НайденныйТоварЗаказа = ТоварыЗаказа.Найти(ТоварДляПередачи.Номенклатура, "Номенклатура");
				Если НЕ НайденныйТоварЗаказа = Неопределено Тогда
					// Если передаем в производство столько сколько в заказе или больше, 
					//то "к отгрузке" в заказе все количество, иначе столько, сколько передаем.
					НайденныйТоварЗаказа.КоличествоОтгрузить = ?(ТоварДляПередачи.Количество >= НайденныйТоварЗаказа.Количество, НайденныйТоварЗаказа.Количество, ТоварДляПередачи.Количество);
					ТоварДляПередачи.ЕстьЗаказ = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			/////////////////////////////////////////////////////////////////
			// Изменение данных объекта "Заказ материалов в производство"
			
			// Смена статуса с "К обеспечению" на "К выполнению".
			ДокЗаказОбъект.Статус = Перечисления.СтатусыЗаказовМатериаловВПроизводство.КВыполнению;
			
			МассивСтрокДляУдаления.Очистить();
			
			// Обход таблицы товаров заказа
			Для каждого ТоварЗаказа Из ТоварыЗаказа Цикл
				
				// Ищем номенклатуру в таб. части товаров заказа
				СтрокиЗаказа = ДокЗаказОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура",ТоварЗаказа.Номенклатура));
				
				Если СтрокиЗаказа.Количество() Тогда
					
					// Номенклатура найдена.
					// Итак, есть ТЗ "ТоварыЗаказа", в которой для каждой позиции номенклатуры написано "Количество" и "Количество отгрузить"
					// и есть табличная часть "Товары" документа заказа, в которой есть все эти номенклатурные позиции, но вероятно не сгруппированные.
					
					ИспСтрок = 1; // Сколько строк используется в ТЧ "Товары" для каждой номенклатуры из ТЗ "ТоварыЗаказа".
					
					Если ТоварЗаказа.Количество <= ТоварЗаказа.КоличествоОтгрузить Тогда
						// Случай, когда отгружаем все количество.
						// То есть в найденной строке тч "Товары" устанавливаем вариант обеспечения "Отгрузить" и все количество для отгрузки.
						// также запоминаем код строки в ТЗ "ТоварыЗаказа"(понадобится для построчной связи заказа и передачи).
						ТекСтрока = СтрокиЗаказа[0];
						ТекСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
						ТекСтрока.Количество = ТоварЗаказа.Количество;
						Коэф = питОбщегоНазначения.ПолучитьКоэффициентУпаковки(ТекСтрока.Номенклатура,ТекСтрока.Упаковка);
						Коэф = ?(Коэф = 0, 1, Коэф);
						ТекСтрока.КоличествоУпаковок = ТекСтрока.Количество / Коэф;
						ТоварЗаказа.КодСтроки = ТекСтрока.КодСтроки;
						
					ИначеЕсли ТоварЗаказа.КоличествоОтгрузить = 0 Тогда
						
						// Случай, когда не надо ничего отгружать, в найденной строке тч "Товары" 
						// устанавливаем вариант обеспечения "Требуется" и общее количество товара.
						ТекСтрока = СтрокиЗаказа[0];
						ТекСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
						ТекСтрока.Количество = ТоварЗаказа.Количество;
						Коэф = питОбщегоНазначения.ПолучитьКоэффициентУпаковки(ТекСтрока.Номенклатура,ТекСтрока.Упаковка);
						Коэф = ?(Коэф = 0, 1, Коэф);
						ТекСтрока.КоличествоУпаковок = ТекСтрока.Количество / Коэф;
						
					Иначе
						
						// Случай, когда передаем в производство меньше, чем указано в заказе.
						// Поэтому часть товара необходимо отгрузить, а часть - оставить в статусе "Требуется".
						// Для этого будем для данной номенклатуры использовать две строки в ТЧ "Товары".
						ИспСтрок = 2;
						ТекСтрока = СтрокиЗаказа[0];
						ТекСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
						ТекСтрока.Количество = ТоварЗаказа.Количество - ТоварЗаказа.КоличествоОтгрузить;
						Коэф = питОбщегоНазначения.ПолучитьКоэффициентУпаковки(ТекСтрока.Номенклатура,ТекСтрока.Упаковка);
						Коэф = ?(Коэф = 0, 1, Коэф);
						ТекСтрока.КоличествоУпаковок = ТекСтрока.Количество / Коэф;
						
						// Если второй строки нет, то создаем ее копированием.
						Если СтрокиЗаказа.Количество() > 1 Тогда
							ТекСтрока2 = СтрокиЗаказа[1];
						Иначе
							ТекСтрока2 = ДокЗаказОбъект.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(ТекСтрока2, ТекСтрока);
						КонецЕсли;
						
						// Устанавливаем статус отгрузки.
						ТекСтрока2.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
						ТекСтрока2.Количество = ТоварЗаказа.КоличествоОтгрузить;
						Коэф = питОбщегоНазначения.ПолучитьКоэффициентУпаковки(ТекСтрока2.Номенклатура,ТекСтрока2.Упаковка);
						Коэф = ?(Коэф = 0, 1, Коэф);
						ТекСтрока2.КоличествоУпаковок = ТекСтрока2.Количество / Коэф;
						
						// Запоминаем код строки отгружаемого товара.
						ТоварЗаказа.КодСтроки = ТекСтрока2.КодСтроки;
						
					КонецЕсли;
					
				КонецЕсли;
				
				// Лишние найденные строки ТЧ "Товары" записываем в массив для удаления.
				Для Сч = ИспСтрок По СтрокиЗаказа.Количество()-1 Цикл
					МассивСтрокДляУдаления.Добавить(СтрокиЗаказа[Сч]);
				КонецЦикла;
				
			КонецЦикла; // ТоварыЗаказа
			
			// Удаляем накопленные строки для удаления
			Для каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
				ДокЗаказОбъект.Товары.Удалить(СтрокаДляУдаления);
			КонецЦикла;
			
			// Связываем код строки товаров для передачи и товаров заказа.
			Для каждого ТоварДляПередачи Из ТоварыДляПередачи Цикл
				
				НайденныйТоварЗаказа = ТоварыЗаказа.Найти(ТоварДляПередачи.Номенклатура, "Номенклатура");
				Если НЕ НайденныйТоварЗаказа = Неопределено Тогда
					ТоварДляПередачи.КодСтроки = НайденныйТоварЗаказа.КодСтроки;
				КонецЕсли;
				
			КонецЦикла;
			
			// Записываем измененный документ заказа.
			Попытка
				
				Если ДокПередачаМатериаловОбъект.Проведен Тогда
					ДокПередачаМатериаловОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ДокПередачаМатериаловОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				
				ДокЗаказОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ДокЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение); // ?Режим записи?
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка связи документа """ + ДокПередачаМатериаловОбъект.Метаданные().Представление() + """
				| с документом """+ДокЗаказОбъект.Метаданные().Представление()+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
			/////////////////////////////////////////////////////////////////
			// Изменение данных объекта "Передача материалов в производство"
			
			// Флаг передачи по распоряжению(распоряжением является заказ материалов в производство, 
			// который мы только что подготовили для связи).
			ДокПередачаМатериаловОбъект.ПередачаПоРаспоряжениям = Истина;
			ДокПередачаМатериаловОбъект.Распоряжение = ДокЗаказОбъект.Ссылка;
			
			// Обходим ТЧ "Товары" и связываем код строки товара, если товара нет в заказе, то код строки - 0.
			// Также устанавливается ссылка на распоряжение.
			Для каждого ТекСтрокаПередача Из ДокПередачаМатериаловОбъект.Товары Цикл
				
				СтрокиДляПередачи = ТоварыДляПередачи.НайтиСтроки(Новый Структура("Номенклатура, ЕстьЗаказ",ТекСтрокаПередача.Номенклатура, Истина));
				Если СтрокиДляПередачи.Количество() Тогда
					ТекСтрокаПередача.КодСтроки = СтрокиДляПередачи[0].КодСтроки;
				Иначе
					ТекСтрокаПередача.КодСтроки = 0;
				КонецЕсли;
				
				ТекСтрокаПередача.Распоряжение = ДокЗаказОбъект.Ссылка;
				
			КонецЦикла; // Все. Документ "Передача материалов в производство" связан и готов к записи.
			
		Иначе // Отвязать
			
			/////////////////////////////////////////////////////////////////
			// Изменение данных объекта "Передача материалов в производство"
			
			// Убираем передачу по распоряжениям.
			ДокПередачаМатериаловОбъект.ПередачаПоРаспоряжениям = Ложь;
			ДокПередачаМатериаловОбъект.Распоряжение = Неопределено;
			
			// Обнуляем код строки и ссылку на распоряжение.
			Для каждого ТекСтрокаПередача Из ДокПередачаМатериаловОбъект.Товары Цикл
				
				ТекСтрокаПередача.КодСтроки = 0;
				ТекСтрокаПередача.Распоряжение = Неопределено;
				
			КонецЦикла;
			
			/////////////////////////////////////////////////////////////////
			// Изменение данных объекта "Заказ материалов в производство"
			
			МассивСтрокДляУдаления.Очистить();
			
			// Статус возвращаем на "К обеспечению"
			ДокЗаказОбъект.Статус = Перечисления.СтатусыЗаказовМатериаловВПроизводство.КВыполнению;
			
			// Обходим таблицу товаров заказа, ищем номенклатуру в ТЧ.
			Для каждого ТоварЗаказа Из ТоварыЗаказа Цикл
				
				СтрокиЗаказа = ДокЗаказОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура",ТоварЗаказа.Номенклатура));
				Если СтрокиЗаказа.Количество() Тогда
					
					// Нменклатура найдена. Модифицируем первую найденную строку, устанавливая статус "К обеспечению"
					// и общее количество, остальные строки по данной номенклатурной позиции добавляем в массив для удаления.
					ТекСтрока = СтрокиЗаказа[0];
					ТекСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
					ТекСтрока.Количество = ТоварЗаказа.Количество;
					Коэф = питОбщегоНазначения.ПолучитьКоэффициентУпаковки(ТекСтрока.Номенклатура,ТекСтрока.Упаковка);
					Коэф = ?(Коэф = 0, 1, Коэф);
					ТекСтрока.КоличествоУпаковок = ТекСтрока.Количество / Коэф;
					
					Для Сч = 1 По СтрокиЗаказа.Количество()-1 Цикл
						МассивСтрокДляУдаления.Добавить(СтрокиЗаказа[Сч]);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Удаляем ненужные строки.
			Для каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
				ДокЗаказОбъект.Товары.Удалить(СтрокаДляУдаления);
			КонецЦикла;
			
			// Все, документ заказ готов к записи.
			// Но в случае с отвязыванием нам необходимо проводить его только после записи 
			// передачи материалов в производство. 
			// Поэтому пишем объект в структуру и далее по коду не забываем его записать.
			СтруктураПараметров.Вставить("ДокЗаказОбъект", ДокЗаказОбъект);
			СтруктураПараметров.Вставить("ДозаписатьЗаказ", Истина);
			
		КонецЕсли;
		
	Иначе
		// Значит по плану меню нет проведенного "Заказа на производство", значит и связь никакую не делаем
		Возврат Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СвязатьОтвязатьПередачуВПроизводствоСЗаказомНаПроизводство()

// Функция формирует документ "Движение продукции и материалов" из разрешенных цеховых кладовых или обновляет существующие.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьДвижениеПродукцииИзРазрешенныхКладовыхПоВыпускуБлюд22(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, ОтложенноеФормирование = Ложь)
	
	//Возврат Истина;
	
	ФормироватьДвижениеПродукции = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питПеремещатьБлюдаСРазрешенныхКладовых");
	
	НовыйДокументДвижениеПродукции = Ложь;
	
	//+БазовоеСмещение
	Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
		СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
	КонецЕсли;
	БазовоеСмещение = 0;
	Если СтруктураПараметров.питСмещатьДатыТиповыхДокументов Тогда
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", "ДвижениеПродукцииИМатериалов", 2));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещение = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
	КонецЕсли;
	//-БазовоеСмещение
	
	Если СтруктураПараметров.Свойство("ДокументыОбъектыДвижениеИзРазрешенныхЦехов") Тогда
		
		// Уже ранее получали документ излишков и запомнили его, чтобы не делать еще раз запрос.
		ТекДокументыОбъекты = СтруктураПараметров.ДокументыОбъектыДвижениеИзРазрешенныхЦехов;
		
	Иначе
		
		Запрос = Новый Запрос;
		
		// Поиск существующих документов "Движение продукции и материалов", предназначенных для перемещения с разрешенных цехов(индекс - 2),
		// связанных с текущим "Выпуском блюд".
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	питТиповыеДокументы.ТиповойДокумент
		|ПОМЕСТИТЬ втДокументыВыпускПродукции
		|ИЗ
		|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
		|ГДЕ
		|	питТиповыеДокументы.ДокументОбщепит = &Документпит
		|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
		|	И питТиповыеДокументы.ПричинаТиповогоДокумента = 2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДокументыВыпускПродукции.ТиповойДокумент
		|ИЗ
		|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
		|		ПО втДокументыВыпускПродукции.ТиповойДокумент = ДвижениеПродукцииИМатериалов.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДвижениеПродукцииИМатериалов.ПометкаУдаления";
		Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ТекДокументыОбъекты = Новый Массив;
		ТекДокументОбъект = Неопределено;
		
		Если ФормироватьДвижениеПродукции Тогда
			// Если документ найден, то получаем объект иначе создаем новый.
			Если Выборка.Количество() Тогда
				Пока Выборка.Следующий() Цикл
					ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
					ТекДокументыОбъекты.Добавить(ТекДокументОбъект);
				КонецЦикла;
			Иначе
				ТекДокументОбъект = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
				ТекДокументыОбъекты.Добавить(ТекДокументОбъект);
				НовыйДокументДвижениеПродукции = Истина;
			КонецЕсли;
		Иначе
			Если Выборка.Количество() Тогда
				Пока Выборка.Следующий() Цикл
					// Сейчас не формируем излишки, но уже ранее был создан такой документ
					ТекДокументСсылка = Выборка.ТиповойДокумент;
					
					//+ОтложенноеПроведение
					Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
						ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.ОтвязатьТиповойДокумент				, ТекДокументСсылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
						СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
						Если НЕ ВсеОк Тогда 
							Возврат ВсеОк;
						КонецЕсли;
					Иначе
					//-ОтложенноеПроведение
						
						Если НЕ УдалитьСвязьТиповогоДокументаСДокументомПит(ТекДокументСсылка, ДокументВыпускБлюд, ТекстОшибки) Тогда
							Возврат Ложь;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекДокументОбъект = ТекДокументыОбъекты[0];
	
	// Определение параметров записи.
	ПараметрыЗаписи0 = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи0 = ПараметрыЗаписи0.РежимЗаписи;
	
	Если НЕ ОтложенноеФормирование И ТекРежимЗаписи0 = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если НЕ НовыйДокументДвижениеПродукции Тогда
			// В случае отмены проведения оприходованием занимаемся позже, в самую последнюю очередь, 
			// т.к. он делаем движения в плюс по свободным остаткам и отменять их нужно после отмены всех остальных типовых документов.
			СтруктураПараметров.Вставить("ОтложитьФормированиеДвиженияПродукцииИзРазрешенныхКладовых", Истина); 
			// Запоминаем, чтобы потом второй раз не получать
			СтруктураПараметров.Вставить("ДокументыОбъектыДвижениеИзРазрешенныхЦехов", ТекДокументыОбъекты); 
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	Для каждого ТекДок Из ТекДокументыОбъекты Цикл
		
		// Определение параметров записи.
		ТекДокПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДок.Проведен,ТекДок.ПометкаУдаления,СтруктураПараметров);
		
		// Определение режима записи
		ТекДокТекРежимЗаписи = ТекДокПараметрыЗаписи.РежимЗаписи;
		
		Если ТекДокПараметрыЗаписи.НужнаУстановкаПометкиУдаления И НЕ НовыйДокументДвижениеПродукции Тогда
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ТекДокПараметрыЗаписи.ПометкаУдаления), ТекДок.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				
				Попытка
					ТекДок.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДок.УстановитьПометкуУдаления(ТекДокПараметрыЗаписи.ПометкаУдаления);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДок.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущийИндексТиповогоДокумента = 0;
	
	///
	// ПОЛУЧАЕМ МЕСТА, ОТКУДА МОЖНО БЫЛО БЫ ПЕРЕМЕСТИТЬ НОМЕНКЛАТУРУ.
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюдТовары.Номенклатура КАК Номенклатура,
	|	питВыпускБлюдТовары.Характеристика КАК Характеристика,
	|	питВыпускБлюдТовары.Серия КАК Серия,
	|	питВыпускБлюдТовары.Назначение КАК Назначение,
	|	питВыпускБлюдТовары.Упаковка КАК Упаковка,
	|	питВыпускБлюдТовары.Количество КАК Количество,
	|	питВыпускБлюдТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	питВыпускБлюдТовары.Рецептура КАК Рецептура
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	|ГДЕ
	|	питВыпускБлюдТовары.Ссылка = &Ссылка
	|	И питВыпускБлюдТовары.ПриготовлениеЗапрещено = ИСТИНА
	|	И питВыпускБлюдТовары.Номенклатура.ТипНоменклатуры В (&СкладскиеТипыНоменклатуры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	питВыпускБлюдИнгредиенты.Ингредиент,
	|	питВыпускБлюдИнгредиенты.Характеристика,
	|	питВыпускБлюдИнгредиенты.Серия,
	|	питВыпускБлюдИнгредиенты.Назначение КАК Назначение,
	|	питВыпускБлюдИнгредиенты.УпаковкаИнгредиента,
	|	питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт,
	|	питВыпускБлюдИнгредиенты.КоличествоУпаковокИнгредиентаФакт,
	|	питВыпускБлюдИнгредиенты.РецептураАвтопередела
	|ИЗ
	|	Документ.питВыпускБлюд.Ингредиенты КАК питВыпускБлюдИнгредиенты
	|ГДЕ
	|	питВыпускБлюдИнгредиенты.Ссылка = &Ссылка
	|	И питВыпускБлюдИнгредиенты.ИзАвтопеределов = ЛОЖЬ
	|	И питВыпускБлюдИнгредиенты.РецептураАвтопередела <> ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка)
	|	И НЕ питВыпускБлюдИнгредиенты.Ингредиент.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Серия,
	|	втТовары.Назначение,
	|	втТовары.Упаковка,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.Рецептура
	|ИЗ
	|	втТовары КАК втТовары
	|";
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	СкладскиеТипыНоменклатуры = питОбщегоНазначения.ПолучитьСкладскиеТипыНоменклатуры();
	Запрос.УстановитьПараметр("СкладскиеТипыНоменклатуры", СкладскиеТипыНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		// Найдены позиции, НЕ разрешенных к производству.
		// Продолжаем алгоритм.
		
		Запрос.Текст = "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура,
		|	втТовары.Характеристика,
		|	втТовары.Серия,
		|	втТовары.Назначение,
		|	втТовары.Упаковка,
		|	СУММА(втТовары.Количество) КАК Количество,
		|	СУММА(втТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	втТовары.Рецептура,
		|	&ЦеховаяКладовая  КАК КладоваяМатериалов
		|ПОМЕСТИТЬ втВсеЗапрещенные
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питРецептура КАК питРецептура
		|		ПО втТовары.Рецептура = питРецептура.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	втТовары.Номенклатура,
		|	втТовары.Характеристика,
		|	втТовары.Серия,
		|	втТовары.Назначение,
		|	втТовары.Рецептура,
		|	втТовары.Упаковка,
		|	&ЦеховаяКладовая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	питРецептураРазрешенныеПодразделения.Ссылка КАК Рецептура,
		|	ВЫБОР
		|		КОГДА питРецептураРазрешенныеПодразделения.ЦеховаяКладовая = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА Склады.Ссылка
		|		ИНАЧЕ питРецептураРазрешенныеПодразделения.ЦеховаяКладовая
		|	КОНЕЦ КАК ЦеховаяКладовая
		|ПОМЕСТИТЬ втВсеКладовые
		|ИЗ
		|	Документ.питРецептура.РазрешенныеПодразделения КАК питРецептураРазрешенныеПодразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|		ПО (ИСТИНА)
		|ГДЕ
		|	питРецептураРазрешенныеПодразделения.Ссылка В
		|			(ВЫБРАТЬ
		|				вт.Рецептура
		|			ИЗ
		|				втВсеЗапрещенные КАК вт)
		|	И Склады.ЦеховаяКладовая = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	питРецептураРазрешенныеПодразделения.Ссылка,
		|	ВЫБОР
		|		КОГДА питРецептураРазрешенныеПодразделения.ЦеховаяКладовая = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА Склады.Ссылка
		|		ИНАЧЕ питРецептураРазрешенныеПодразделения.ЦеховаяКладовая
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втВсеЗапрещенные.Номенклатура КАК Номенклатура,
		|	втВсеЗапрещенные.Характеристика КАК Характеристика,
		|	втВсеЗапрещенные.Серия КАК Серия,
		|	втВсеЗапрещенные.Назначение КАК Назначение,
		|	втВсеЗапрещенные.Упаковка КАК Упаковка,
		|	втВсеЗапрещенные.Количество КАК Количество,
		|	втВсеЗапрещенные.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втВсеЗапрещенные.Рецептура КАК Рецептура,
		|	втВсеЗапрещенные.КладоваяМатериалов КАК КладоваяМатериалов,
		|	втВсеКладовые.ЦеховаяКладовая КАК Склад
		|ПОМЕСТИТЬ втПредИсходныеДанные
		|ИЗ
		|	втВсеЗапрещенные КАК втВсеЗапрещенные
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВсеКладовые КАК втВсеКладовые
		|		ПО (втВсеЗапрещенные.Рецептура = втВсеКладовые.Рецептура)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втВсеЗапрещенные.Номенклатура,
		|	втВсеЗапрещенные.Характеристика,
		|	втВсеЗапрещенные.Серия,
		|	втВсеЗапрещенные.Назначение,
		|	втВсеЗапрещенные.Упаковка,
		|	втВсеЗапрещенные.Количество,
		|	втВсеЗапрещенные.КоличествоУпаковок,
		|	втВсеЗапрещенные.Рецептура,
		|	втВсеЗапрещенные.КладоваяМатериалов,
		|	втВсеЗапрещенные.КладоваяМатериалов
		|ИЗ
		|	втВсеЗапрещенные КАК втВсеЗапрещенные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПредИсходныеДанные.Номенклатура КАК Номенклатура,
		|	втПредИсходныеДанные.Характеристика КАК Характеристика,
		|	втПредИсходныеДанные.Серия КАК Серия,
		|	втПредИсходныеДанные.Назначение КАК Назначение,
		|	втПредИсходныеДанные.Упаковка КАК Упаковка,
		|	втПредИсходныеДанные.Количество КАК Количество,
		|	втПредИсходныеДанные.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втПредИсходныеДанные.Рецептура КАК Рецептура,
		|	втПредИсходныеДанные.КладоваяМатериалов КАК КладоваяМатериалов,
		|	втПредИсходныеДанные.Склад КАК Склад
		|ПОМЕСТИТЬ втИсходныеДанные
		|ИЗ
		|	втПредИсходныеДанные КАК втПредИсходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВсеКладовые КАК втВсеКладовые
		|		ПО втПредИсходныеДанные.Рецептура = втВсеКладовые.Рецептура
		|
		|СГРУППИРОВАТЬ ПО
		|	втПредИсходныеДанные.Номенклатура,
		|	втПредИсходныеДанные.Характеристика,
		|	втПредИсходныеДанные.Серия,
		|	втПредИсходныеДанные.Назначение,
		|	втПредИсходныеДанные.Упаковка,
		|	втПредИсходныеДанные.Количество,
		|	втПредИсходныеДанные.КоличествоУпаковок,
		|	втПредИсходныеДанные.Рецептура,
		|	втПредИсходныеДанные.КладоваяМатериалов,
		|	втПредИсходныеДанные.Склад
		|;
		|"+питОбщегоНазначенияСервер.ПолучитьТекстЗапросаДляВычетаДвиженийРегистратора()+"
		|;
		|"+питОбщегоНазначенияСервер.ПолучитьТекстЗапросаСвободныеОстатки("втИсходныеДанные","втОстатки", Истина)+"
		|;
		|//////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанные.Номенклатура КАК Номенклатура,
		|	втИсходныеДанные.Характеристика КАК Характеристика,
		|	втИсходныеДанные.Серия КАК Серия,
		|	втИсходныеДанные.Назначение КАК Назначение,
		|	втИсходныеДанные.Упаковка КАК Упаковка,
		|	втИсходныеДанные.Количество КАК Количество,
		|	втИсходныеДанные.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втИсходныеДанные.Рецептура КАК Рецептура,
		|	втИсходныеДанные.КладоваяМатериалов КАК КладоваяМатериалов,
		|	втИсходныеДанные.Склад КАК Склад,
		|	ЕСТЬNULL(втОстатки.Количество, 0) КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА втИсходныеДанные.Склад = втИсходныеДанные.КладоваяМатериалов
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСкладПриготовления,
		|	СпрНоменклатура.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета
		|ПОМЕСТИТЬ втРезультат
		|ИЗ
		|	втИсходныеДанные КАК втИсходныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
		|		ПО (втИсходныеДанные.Номенклатура = втОстатки.Номенклатура)
		|			И (втИсходныеДанные.Характеристика = втОстатки.Характеристика)
		|			И (втИсходныеДанные.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
		|			И (втИсходныеДанные.Склад = втОстатки.Склад)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|			ПО втИсходныеДанные.Номенклатура = СпрНоменклатура.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультат.Номенклатура КАК Номенклатура,
		|	втРезультат.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
		|	втРезультат.Характеристика КАК Характеристика,
		|	втРезультат.Серия КАК Серия,
		|	втРезультат.Назначение КАК Назначение,
		|	втРезультат.Упаковка КАК Упаковка,
		|	втРезультат.Количество КАК Количество,
		|	втРезультат.Рецептура КАК Рецептура,
		|	втРезультат.КладоваяМатериалов КАК КладоваяМатериалов,
		|	втРезультат.Склад КАК Склад,
		|	втРезультат.КоличествоОстаток КАК КоличествоОстаток,
		|	втРезультат.ЭтоСкладПриготовления КАК ЭтоСкладПриготовления
		|ИЗ
		|	втРезультат КАК втРезультат
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоСкладПриготовления УБЫВ,
		|	КоличествоОстаток УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";
		
		Запрос.УстановитьПараметр("ДокументОбщепит", ДокументВыпускБлюд.Ссылка);
		Запрос.УстановитьПараметр("НаДату", КонецМесяца(ДокументВыпускБлюд.Дата));
		Запрос.УстановитьПараметр("НаДатуДата", КонецМесяца(ДокументВыпускБлюд.Дата));
		Запрос.УстановитьПараметр("ЦеховаяКладовая", ДокументВыпускБлюд.Склад);
		Запрос.УстановитьПараметр("Склад", ДокументВыпускБлюд.Склад);
		Запрос.УстановитьПараметр("ПодразделениеРецептуры", ?(питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питПодразделениеПроизводстваПолуфабрикатов") = Перечисления.питПодразделенияПроизводстваПолуфабрикатов.ПодразделениеРецептуры, Истина, Ложь));
		
		ТаблицаДокументов = Новый ТаблицаЗначений;
		ТаблицаДокументов.Колонки.Добавить("Документ"			, Новый ОписаниеТипов("ДокументОбъект.ДвижениеПродукцииИМатериалов"));
		ТаблицаДокументов.Колонки.Добавить("СкладОтправитель"	, Новый ОписаниеТипов("СправочникСсылка.Склады"));
		СтруктураПоискаДокумента = Новый Структура("СкладОтправитель");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ТаблицаДокументов.Очистить();
			
			ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ОсталосьПереместить = ВыборкаНоменклатура.Количество;
				
				ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() И ОсталосьПереместить > 0 Цикл
					
					КПеремещению = Мин(ОсталосьПереместить, ВыборкаДетальныеЗаписи.КоличествоОстаток);
					
					// Перемещения на тот же склад безсмысленно
					Если ВыборкаДетальныеЗаписи.Склад = ДокументВыпускБлюд.Склад Тогда
						ОсталосьПереместить = ОсталосьПереместить - КПеремещению;
						Продолжить;
					КонецЕсли;
					
					Если КПеремещению = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					СтруктураПоискаДокумента.СкладОтправитель = ВыборкаДетальныеЗаписи.Склад;
					НайденныеДокументы = ТаблицаДокументов.НайтиСтроки(СтруктураПоискаДокумента);
					Если НайденныеДокументы.Количество() Тогда
						НайденныйДокумент = НайденныеДокументы[0].Документ;
					Иначе
						НайденныйДокумент = ?(ТекДокументыОбъекты.Количество() > ТекущийИндексТиповогоДокумента
						, ТекДокументыОбъекты.Получить(ТекущийИндексТиповогоДокумента)
						, Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент());
						
						Если ТекДокументыОбъекты.Количество() <= ТекущийИндексТиповогоДокумента Тогда
							ТекДокументыОбъекты.Добавить(НайденныйДокумент);
						КонецЕсли;
						
						ТекущийИндексТиповогоДокумента = ТекущийИндексТиповогоДокумента + 1;
						
						// Заполнение шапки.
						НайденныйДокумент.Дата					= ДокументВыпускБлюд.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0) - БазовоеСмещение;
						НайденныйДокумент.Организация			= ДокументВыпускБлюд.Организация;
						НайденныйДокумент.Отправитель			= ВыборкаДетальныеЗаписи.Склад; // Склад, на котором есть остаток
						НайденныйДокумент.Получатель			= ДокументВыпускБлюд.Склад;
						НайденныйДокумент.Ответственный			= ДокументВыпускБлюд.Ответственный;
						НайденныйДокумент.Комментарий			= ДокументВыпускБлюд.Комментарий;
						НайденныйДокумент.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой;
						НайденныйДокумент.Статус				= Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
						НайденныйДокумент.НаправлениеДеятельности = ДокументВыпускБлюд.НаправлениеДеятельности;
						// Автоопределение значения налогообложения НДС.
						НайденныйДокумент.НалогообложениеНДС	= ?(СтруктураПараметров.Свойство("НалогообложениеНДС"), СтруктураПараметров.НалогообложениеНДС, Неопределено);
						
						//+25
						НайденныйДокумент.Валюта				= ?(ЗначениеЗаполнено(ДокументВыпускБлюд.Валюта), ДокументВыпускБлюд.Валюта, Константы.ВалютаРегламентированногоУчета.Получить());
						НайденныйДокумент.ВариантПриемкиТоваров	= Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
						//-25
						
						// Очистка табличных частей для избежания дублирования информации.
						НайденныйДокумент.Товары.Очистить();
						НайденныйДокумент.Серии.Очистить();
						НайденныйДокумент.ВидыЗапасов.Очистить();
						НайденныйДокумент.ДополнительныеРеквизиты.Очистить();
						
						НовСтрокаТаблицыДокументов = ТаблицаДокументов.Добавить();
						НовСтрокаТаблицыДокументов.Документ			= НайденныйДокумент;
						НовСтрокаТаблицыДокументов.СкладОтправитель	= ВыборкаДетальныеЗаписи.Склад;
						
					КонецЕсли;
					
					НовСтрокаДвижениеПродукцииИМатериалов = НайденныйДокумент.Товары.Добавить();
					НовСтрокаДвижениеПродукцииИМатериалов.Номенклатура				= ВыборкаДетальныеЗаписи.Номенклатура;
					НовСтрокаДвижениеПродукцииИМатериалов.Характеристика			= ВыборкаДетальныеЗаписи.Характеристика;
					НовСтрокаДвижениеПродукцииИМатериалов.Серия						= Справочники.СерииНоменклатуры.ПустаяСсылка(); // Серии заполнятся по FEFO позже
					НовСтрокаДвижениеПродукцииИМатериалов.Назначение				= ВыборкаДетальныеЗаписи.Назначение;
					НовСтрокаДвижениеПродукцииИМатериалов.НазначениеОтправителя		= ВыборкаДетальныеЗаписи.Назначение;
					НовСтрокаДвижениеПродукцииИМатериалов.КоличествоУпаковок		= КПеремещению;
					НовСтрокаДвижениеПродукцииИМатериалов.Количество				= КПеремещению;
					НовСтрокаДвижениеПродукцииИМатериалов.Упаковка					= Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
					НовСтрокаДвижениеПродукцииИМатериалов.ИдентификаторСтроки		= Новый УникальныйИдентификатор;
					НовСтрокаДвижениеПродукцииИМатериалов.ГруппаПродукции			= ВыборкаДетальныеЗаписи.ГруппаАналитическогоУчета;
					
					ОсталосьПереместить = ОсталосьПереместить - КПеремещению;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
		/////////////////////////////////////////////////////////
		// ЗАПИСЬ ТИПОВОГО ДОКУМЕНТА 
		
		ТекДок = Неопределено;
		Для Инд = 0 По ТекущийИндексТиповогоДокумента-1 Цикл
			ТекДок = ТекДокументыОбъекты.Получить(Инд);
			
			// Определение параметров записи.
			ТекДокПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
			ТекДок.Проведен,ТекДок.ПометкаУдаления,СтруктураПараметров);
			
			// Определение режима записи
			ТекДокТекРежимЗаписи = ТекДокПараметрыЗаписи.РежимЗаписи;
			Если НЕ ТекДок.Проведен И ТекДокТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				ТекДокТекРежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			
			//+Серии
			Если ТекДокТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ЗаполнитьСерииТиповогоДокумента(ТекДок, ДокументВыпускБлюд, 2);
			КонецЕсли;
			//-Серии
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ИсходныйДокТекРежимЗаписи	= ТекДокТекРежимЗаписи;
				ТекДокТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
			КонецЕсли;
			//-ОтложенноеПроведение
			
			Попытка
				ТекДок.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДок.Записать(ТекДокТекРежимЗаписи);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка записи документа """ + ТекДок.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйДокТекРежимЗаписи);
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДок.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДок.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			КонецЕсли;
			//-ОтложенноеПроведение
			
			//+ОтложенноеПроведение
			ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
			//-ОтложенноеПроведение
			
			// Добавление записи в результирующую таблицу в случае успешной записи документов.
			ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДок, тблСозданныеДокументы, 2, ТекСинхронизирован);
			
		КонецЦикла;
		
	КонецЕсли; // Найдены НЕ разрешенные к производству позиции
	
	Если ТекДокументыОбъекты.Количество() > ТекущийИндексТиповогоДокумента Тогда
		
		Для Инд = ТекущийИндексТиповогоДокумента По ТекДокументыОбъекты.Количество()-1 Цикл
			
			ТекДок = ТекДокументыОбъекты.Получить(Инд);
			
			Если НЕ ПустаяСтрока(ТекДок.ВерсияДанных) Тогда
				
				//+ОтложенноеПроведение
				Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
					ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(Истина), ТекДок.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
					Если НЕ ВсеОк Тогда 
						Возврат ВсеОк;
					КонецЕсли;
					ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДок.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
					Если НЕ ВсеОк Тогда 
						Возврат ВсеОк;
					КонецЕсли;
				Иначе
				//-ОтложенноеПроведение
					
					Попытка
						ТекДок.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
						ТекДок.УстановитьПометкуУдаления(Истина);
					Исключение
						ТекстОшибки = ТекстОшибки + "
						|Ошибка при установке пометки удаления """ + ТекДок.Метаданные().Представление() + """
						| по документу Общепит """+ДокументВыпускБлюд+"""
						|по причине: <"+ОписаниеОшибки()+">";
						Возврат Ложь;
					КонецПопытки;
					
				КонецЕсли;
				
				//+ОтложенноеПроведение
				ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
				//-ОтложенноеПроведение
				
				// Добавление записи в результирующую таблицу в случае успешной записи документов.
				ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДок, тблСозданныеДокументы, 2, ТекСинхронизирован);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#Область ДокументыПоКомплекснымВыпускамБлюд

// Функция формирует документ "Отчет о розничных продажах" для выпуска с розничной реализацией.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьОтчетОРозничныхПродажахПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Если СтруктураПараметров.Свойство("ФормироватьДокументыПроизводства22") Тогда
		ФормироватьДокументыПроизводства22 = СтруктураПараметров.ФормироватьДокументыПроизводства22;
	Иначе
		ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументВыпускБлюд, "Склад.ЦеховаяКладовая") Тогда
		ИмяДокументаПеремещения = "ДвижениеПродукцииИМатериалов";
	Иначе
		ИмяДокументаПеремещения = "ПеремещениеТоваров";
	КонецЕсли;
	
	//+БазовоеСмещение
	Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
		СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
	КонецЕсли;
	// +++ Адель 31.07.2024 для сдига даты только Отчета о розничных продажах на 1 сек
	//БазовоеСмещениеОтчетаОРозничныхПродажах = 0;
	БазовоеСмещениеОтчетаОРозничныхПродажах = -1;
	// --- Адель 31.07.2024 для сдига даты только Отчета о розничных продажах на 1 сек
	БазовоеСмещениеДокументаПеремещения = 0;
	Если СтруктураПараметров.питСмещатьДатыТиповыхДокументов Тогда
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", "ОтчетОРозничныхПродажах", 0));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещениеОтчетаОРозничныхПродажах = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", ИмяДокументаПеремещения, 1));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещениеДокументаПеремещения = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
	КонецЕсли;
	//-БазовоеСмещение
	
	ОрганизацияКассыККМ = питОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументВыпускБлюд.КассаККМ, "Владелец");
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Отчет о розничных продажах",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент,
	|	питТиповыеДокументы.ДокументОбщепит,
	|	питТиповыеДокументы.ПричинаТиповогоДокумента
	|ПОМЕСТИТЬ втТиповыеДокументы
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ИЗ
	|	втТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(втТиповыеДокументы.ТиповойДокумент КАК Документ.%ИмяДокументаПеремещения%) КАК ТиповойДокумент,
	|	ВЫРАЗИТЬ(втТиповыеДокументы.ДокументОбщепит КАК Документ.питВыпускБлюд) КАК ДокументОбщепит
	|ПОМЕСТИТЬ втДвжиенияПродукцииИМатериалов
	|ИЗ
	|	втТиповыеДокументы КАК втТиповыеДокументы
	|ГДЕ
	|	втТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.%ИмяДокументаПеремещения%
	|	И втТиповыеДокументы.ПричинаТиповогоДокумента = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДвжиенияПродукцииИМатериалов.ТиповойДокумент
	|ИЗ
	|	втДвжиенияПродукцииИМатериалов КАК втДвжиенияПродукцииИМатериалов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд КАК питВыпускБлюд
	|		ПО втДвжиенияПродукцииИМатериалов.ДокументОбщепит = питВыпускБлюд.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.%ИмяДокументаПеремещения% КАК %ИмяДокументаПеремещения%
	|		ПО втДвжиенияПродукцииИМатериалов.ТиповойДокумент = %ИмяДокументаПеремещения%.Ссылка
	|ГДЕ
	|	%ИмяДокументаПеремещения%.%ИмяПоляПолучатель% <> питВыпускБлюд.Склад
	//>>Швецов.11.02.2025. Розничные продажи алкоголя. 
	//По заборному листу разбиваем серийный алкоголь и все остальное на ОРП и ВН "списание на расходы"
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ВнутреннееПотребление
	|";
	//>>Швецов.11.02.2025. Розничные продажи алкоголя. 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяДокументаПеремещения%", ИмяДокументаПеремещения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяПоляПолучатель%", ?(ИмяДокументаПеремещения = "ДвижениеПродукцииИМатериалов", "Получатель", "СкладПолучатель"));
	
	Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
	Иначе
		ТекДокументОбъект = Документы.ОтчетОРозничныхПродажах.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления И ЗначениеЗаполнено(ТекДокументОбъект.Ссылка) Тогда
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	ТекДокументПеремещения = Неопределено;
	ВыборкаДокПеремещения = РезультатЗапроса[3].Выбрать();
	Если ФормироватьДокументыПроизводства22 
		И ДокументВыпускБлюд.СкладПолучатель <> ДокументВыпускБлюд.Склад Тогда
		
		// Если документ найден, то получаем объект иначе создаем новый.
		Если ВыборкаДокПеремещения.Следующий() Тогда
			ТекДокументПеремещения = ВыборкаДокПеремещения.ТиповойДокумент.ПолучитьОбъект();
		Иначе
			ТекДокументПеремещения = Документы[ИмяДокументаПеремещения].СоздатьДокумент();
		КонецЕсли;
		
		// Определение параметров записи.
		ПараметрыЗаписиДокПеремещения = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументПеремещения.Проведен,ТекДокументПеремещения.ПометкаУдаления, Новый Структура);
		
		// Определение режима записи
		ТекРежимЗаписиДокПеремещения = ПараметрыЗаписиДокПеремещения.РежимЗаписи;
		
		Если ПараметрыЗаписиДокПеремещения.НужнаУстановкаПометкиУдаления Тогда
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				
				Попытка
					ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
						ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
					КонецЕсли;
					ТекДокументПеремещения.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументПеремещения.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;
	//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	
	//>>Швецов.11.02.2025. Розничные продажи алкоголя. 
	//По заборному листу разбиваем серийный алкоголь и все остальное на ОРП и ВН "списание на расходы"
	MRS_ЗаборныйЛист = Ложь;
	
	Если ДокументВыпускБлюд.ПЛ_ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.питХозяйственныеОперации.ПЛ_ЗаборныйЛист") Тогда
		
		MRS_ЗаборныйЛист = Истина;
		
	КонецЕсли;
	
	Если MRS_ЗаборныйЛист Тогда
		
		ИмяДокументаВнутреннееПотребление = питОбратнаяСовместимостьПовтИсп.ИмяДокументаВнутреннееПотребление();
	
		ТекДокументСписания = Неопределено;
		ВыборкаДокументСписания = РезультатЗапроса[4].Выбрать();

		// Если документ найден, то получаем объект иначе создаем новый.
		Если ВыборкаДокументСписания.Следующий() Тогда
			ТекДокументСписания = ВыборкаДокументСписания.ТиповойДокумент.ПолучитьОбъект();
			ЭтоНовый = Ложь;
		Иначе
			ЭтоНовый = Истина;
			ТекДокументСписания = Документы[ИмяДокументаВнутреннееПотребление].СоздатьДокумент();
		КонецЕсли;
		
		// Определение параметров записи.
		ПараметрыЗаписиДокСписания = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументСписания.Проведен,ТекДокументСписания.ПометкаУдаления, Новый Структура);
		
		// Определение режима записи
		ТекРежимЗаписиДокСписания = ПараметрыЗаписиДокСписания.РежимЗаписи;
		
		Если ПараметрыЗаписиДокСписания.НужнаУстановкаПометкиУдаления И НЕ ЭтоНовый Тогда
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументСписания.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				
				Попытка
					ТекДокументСписания.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
						ТекДокументСписания.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
					КонецЕсли;
					ТекДокументСписания.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументСписания.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	//>>Швецов.11.02.2025. Розничные продажи алкоголя. 
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	//ТекДокументОбъект.Валюта						= Константы.ВалютаРегламентированногоУчета.Получить();
	
	мМетаданныеДокументапит =		ДокументВыпускБлюд.Метаданные();
	мМетаданныеТиповогоДокумента =	ТекДокументОбъект.Метаданные();
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", мМетаданныеДокументапит) Тогда
		ТекДокументОбъект.Валюта				= ДокументВыпускБлюд.Валюта;
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", мМетаданныеДокументапит) Тогда
		ТекДокументОбъект.Валюта				= ДокументВыпускБлюд.ВалютаДокумента;
	КонецЕсли;
	
	ТекДокументОбъект.ВидЦены						= ДокументВыпускБлюд.ТипЦен;
	ТекДокументОбъект.КассаККМ						= ДокументВыпускБлюд.КассаККМ;
	
	ТекДокументОбъект.Дата							= ДокументВыпускБлюд.Дата 
	+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0)
	- БазовоеСмещениеОтчетаОРозничныхПродажах;
	// Организация теперь для "Отчета о розничных продажах" берется из Кассы ККМ
	ТекДокументОбъект.Организация					= ОрганизацияКассыККМ;
	ТекДокументОбъект.Склад							= ?(ФормироватьДокументыПроизводства22, ДокументВыпускБлюд.СкладПолучатель, ДокументВыпускБлюд.Склад);
	ТекДокументОбъект.Подразделение					= ДокументВыпускБлюд.Подразделение;
	ТекДокументОбъект.Ответственный					= ДокументВыпускБлюд.Ответственный;
	ТекДокументОбъект.Комментарий					= ДокументВыпускБлюд.Комментарий;
	
	// Автоопределение значения налогообложения НДС.
	ТекДокументОбъект.НалогообложениеНДС	= ?(СтруктураПараметров.Свойство("НалогообложениеНДС"), СтруктураПараметров.НалогообложениеНДС, Неопределено);
	
	// в 2.2 убрали поле СтатьяДвиженияДенежныхСредств
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СтатьяДвиженияДенежныхСредств", мМетаданныеТиповогоДокумента) Тогда
		ТекДокументОбъект.СтатьяДвиженияДенежныхСредств	= ДокументВыпускБлюд.СтатьяДвиженияДенежныхСредств;
	КонецЕсли;
	
	ТекДокументОбъект.ЦенаВключаетНДС				= ДокументВыпускБлюд.ЦенаВключаетНДС;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.Серии.Очистить();
	ТекДокументОбъект.ОплатаПлатежнымиКартами.Очистить();
	ТекДокументОбъект.ПодарочныеСертификаты.Очистить();
	ТекДокументОбъект.НачислениеБонусныхБаллов.Очистить();
	ТекДокументОбъект.ОплатаБонуснымиБаллами.Очистить();
	
	//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	Если НЕ ТекДокументПеремещения = Неопределено Тогда
		
		питОрганизацияПеремещенияДляРеализации = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питОрганизацияПеремещенияДляРеализации");
		Если питОрганизацияПеремещенияДляРеализации = Перечисления.питОрганизацииПеремещенияДляРеализации.ОрганизацияПроизводства Тогда
			ОрганизацияПеремещения = ДокументВыпускБлюд.Организация;
		Иначе
			ОрганизацияПеремещения = ОрганизацияКассыККМ;
		КонецЕсли;
		
		Если ИмяДокументаПеремещения = "ДвижениеПродукцииИМатериалов" Тогда
			ЗаполнитьШапкуДвиженияПродукцииИМатериаловПоВыпускуБлюд(ТекДокументПеремещения, ДокументВыпускБлюд, СтруктураПараметров, БазовоеСмещениеДокументаПеремещения, ОрганизацияПеремещения, Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой);
			ОчиститьТабличныеЧастиДвиженияПродукцииИМатериалов(ТекДокументПеремещения);
		Иначе
			ЗаполнитьШапкуПеремещенияТоваровПоВыпускуБлюд(ТекДокументПеремещения, ДокументВыпускБлюд, СтруктураПараметров, БазовоеСмещениеДокументаПеремещения, ОрганизацияПеремещения);
			ОчиститьТабличныеЧастиПеремещенияТоваров(ТекДокументПеремещения);
		КонецЕсли;
		
	КонецЕсли;
	//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	
	// Получение данных по табличной части "Ингредиенты" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питВыпускБлюдТовары.Номенклатура КАК Номенклатура,
	|	питВыпускБлюдТовары.Характеристика КАК Характеристика,
	|	питВыпускБлюдТовары.Серия КАК Серия,
	|	питВыпускБлюдТовары.Назначение КАК Назначение,
	|	питВыпускБлюдТовары.Упаковка КАК Упаковка,
	|	питВыпускБлюдТовары.Количество КАК Количество,
	|	питВыпускБлюдТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	питВыпускБлюдТовары.Цена КАК Цена,
	|	питВыпускБлюдТовары.Сумма КАК Сумма,
	|	питВыпускБлюдТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	питВыпускБлюдТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	питВыпускБлюдТовары.СтавкаНДС КАК СтавкаНДС,
	|	питВыпускБлюдТовары.СуммаНДС КАК СуммаНДС,
	|	НоменклатураСпр.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
	|	НоменклатураСпр.ТипНоменклатуры КАК ТипНоменклатуры
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО питВыпускБлюдТовары.Номенклатура = НоменклатураСпр.Ссылка
	|ГДЕ
	|	питВыпускБлюдТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдОплата.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	питВыпускБлюдОплата.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	|	питВыпускБлюдОплата.СуммаОплаты КАК Сумма,
	|	питВыпускБлюдОплата.КодАвторизации КАК КодАвторизации
	|ИЗ
	|	Документ.питВыпускБлюд.Оплата КАК питВыпускБлюдОплата
	|ГДЕ
	|	питВыпускБлюдОплата.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
	|	питВыпускБлюдПодарочныеСертификаты.Сумма КАК Сумма,
	|	питВыпускБлюдПодарочныеСертификаты.СуммаВВалютеСертификата КАК СуммаВВалютеСертификата,
	|	питВыпускБлюдПодарочныеСертификаты.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.питВыпускБлюд.ПодарочныеСертификаты КАК питВыпускБлюдПодарочныеСертификаты
	|ГДЕ
	|	питВыпускБлюдПодарочныеСертификаты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдНачислениеБонусныхБаллов.Партнер КАК Партнер,
	|	питВыпускБлюдНачислениеБонусныхБаллов.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	питВыпускБлюдНачислениеБонусныхБаллов.СуммаБонусныхБаллов КАК СуммаБонусныхБаллов,
	|	питВыпускБлюдНачислениеБонусныхБаллов.ДатаНачисления КАК ДатаНачисления,
	|	питВыпускБлюдНачислениеБонусныхБаллов.ДатаСписания КАК ДатаСписания
	|ИЗ
	|	Документ.питВыпускБлюд.НачислениеБонусныхБаллов КАК питВыпускБлюдНачислениеБонусныхБаллов
	|ГДЕ
	|	питВыпускБлюдНачислениеБонусныхБаллов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдОплатаБонуснымиБаллами.Партнер КАК Партнер,
	|	питВыпускБлюдОплатаБонуснымиБаллами.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	питВыпускБлюдОплатаБонуснымиБаллами.СуммаБонусныхБаллов КАК СуммаБонусныхБаллов,
	|	питВыпускБлюдОплатаБонуснымиБаллами.ДатаОплаты КАК ДатаОплаты
	|ИЗ
	|	Документ.питВыпускБлюд.ОплатаБонуснымиБаллами КАК питВыпускБлюдОплатаБонуснымиБаллами
	|ГДЕ
	|	питВыпускБлюдОплатаБонуснымиБаллами.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	
	
	//<<Портал-Юг, Давиденко 2019.03.19 [4.2.8 Заполнение отчёта о розничных продажах из выпуска блюд для особых продаж]
	// Чтобы не менять структуру пакетов основного запроса, выберем данные для первого пакета отдельным запросом
	ПЛ_Запрос = Новый Запрос;
	ПЛ_Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюдБлюда.Номенклатура КАК Номенклатура,
	|	питВыпускБлюдИнгредиенты.Ингредиент КАК Ингредиент,
	|	питВыпускБлюдИнгредиенты.Характеристика КАК Характеристика,
	|	питВыпускБлюдИнгредиенты.Серия КАК Серия,
	|	питВыпускБлюдБлюда.Назначение КАК Назначение,
	|	питВыпускБлюдБлюда.Рецептура КАК Рецептура,
	|	питВыпускБлюдБлюда.КоличествоУпаковокНоменклатуры КАК КоличествоУпаковокНоменклатуры,
	|	питВыпускБлюдИнгредиенты.КоличествоУпаковокИнгредиентаФакт КАК КоличествоУпаковокИнгредиентаФакт,
	|	ВЫБОР
	|		КОГДА питВыпускБлюдБлюда.КоличествоУпаковокНоменклатуры = 0
	|			ТОГДА 0
	|		ИНАЧЕ питВыпускБлюдИнгредиенты.КоличествоУпаковокИнгредиентаФакт / питВыпускБлюдБлюда.КоличествоУпаковокНоменклатуры
	|	КОНЕЦ КАК КоличествоУпаковокИнгредиентаНаЕдиницу,
	|	ВЫБОР
	|		КОГДА питВыпускБлюдБлюда.КоличествоНоменклатуры = 0
	|			ТОГДА 0
	|		ИНАЧЕ питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт / питВыпускБлюдБлюда.КоличествоНоменклатуры
	|	КОНЕЦ КАК КоличествоИнгредиентаНаЕдиницу,
	|	питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт КАК КоличествоИнгредиентаФакт,
	|	-(ВЫРАЗИТЬ(питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт КАК ЧИСЛО(15, 3))) КАК КоличествоИнгредиентаКонтроль,
	|	-(ВЫРАЗИТЬ(питВыпускБлюдИнгредиенты.КоличествоУпаковокИнгредиентаФакт КАК ЧИСЛО(15, 3))) КАК КоличествоУпаковокИнгредиентаКонтроль,
	|	ВЫБОР
	|		КОГДА питВыпускБлюдИнгредиенты.Ингредиент.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ питВыпускБлюдИнгредиенты.Ингредиент.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТовар,
	|	СпрНоменклатура.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
	|	питВыпускБлюдИнгредиенты.УпаковкаИнгредиента КАК Упаковка,
	|	питВыпускБлюдБлюда.Характеристика КАК ХарактеристикаНоменклатуры,
	|	питВыпускБлюдБлюда.Серия КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ПЛ_ВтИнгредиенты
	|ИЗ
	|	Документ.питВыпускБлюд.Блюда КАК питВыпускБлюдБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд.Ингредиенты КАК питВыпускБлюдИнгредиенты
	|		ПО питВыпускБлюдБлюда.ИдентификаторСтроки = питВыпускБлюдИнгредиенты.ИдентификаторБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (питВыпускБлюдИнгредиенты.Ингредиент = СпрНоменклатура.Ссылка)
	|ГДЕ
	|	питВыпускБлюдБлюда.Ссылка = &Ссылка
	|	И питВыпускБлюдИнгредиенты.Ссылка = &Ссылка
	|	И питВыпускБлюдБлюда.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И НЕ питВыпускБлюдБлюда.Автопередел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдТовары.Номенклатура КАК Номенклатура,
	|	ПЛ_ВтИнгредиенты.Ингредиент КАК Ингредиент,
	|	ПЛ_ВтИнгредиенты.Характеристика КАК Характеристика,
	|	ПЛ_ВтИнгредиенты.Серия КАК Серия,
	|	ПЛ_ВтИнгредиенты.Назначение КАК Назначение,
	//<< Портал-Юг, Баринов, 2019.10.07 [4.2.8 Заполнение отчёта о розничных продажах из выпуска блюд для особых продаж]
	//|	питВыпускБлюдТовары.Упаковка КАК Упаковка,
	|	ПЛ_ВтИнгредиенты.Упаковка КАК Упаковка,
	//>> Портал-Юг, Баринов, 2019.10.07
	|	СУММА(питВыпускБлюдТовары.Количество) КАК Количество,
	|	СУММА(питВыпускБлюдТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	питВыпускБлюдТовары.Цена КАК Цена,
	|	МАКСИМУМ(питВыпускБлюдТовары.Сумма) КАК Сумма,
	|	МАКСИМУМ(питВыпускБлюдТовары.ПроцентРучнойСкидки) КАК ПроцентРучнойСкидки,
	|	питВыпускБлюдТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	питВыпускБлюдТовары.СтавкаНДС КАК СтавкаНДС,
	|	МАКСИМУМ(питВыпускБлюдТовары.СуммаНДС) КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаАналитическогоУчета,
	|	МАКСИМУМ(ЕСТЬNULL(ПЛ_ВтИнгредиенты.КоличествоИнгредиентаНаЕдиницу, 0)) КАК КоличествоИнгредиентаНаЕдиницу,
	|	МАКСИМУМ(ЕСТЬNULL(ПЛ_ВтИнгредиенты.КоличествоУпаковокИнгредиентаНаЕдиницу, 0)) КАК КоличествоУпаковокИнгредиентаНаЕдиницу,
	|	питВыпускБлюдТовары.ПЛ_Договор КАК ПЛ_Договор,
	|	питВыпускБлюдТовары.Рецептура КАК Рецептура,
	|	питВыпускБлюдТовары.Характеристика КАК ХарактеристикаНоменклатуры,
	|	питВыпускБлюдТовары.Серия КАК СерияНоменклатуры,
	|	питВыпускБлюдТовары.Рецептура КАК РецептураНоменклатуры,
	//<< Портал-Юг, Баринов, 2019.10.04 [9.09 Обособление продаж по открытой цене]
	|	ВЫБОР КОГДА питВыпускБлюдТовары.Номенклатура.питПродажаПоСвободнойЦене ТОГДА питВыпускБлюдТовары.Номенклатура ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КОНЕЦ КАК НоменклатураНабора,
	|	ВЫБОР КОГДА питВыпускБлюдТовары.Номенклатура.питПродажаПоСвободнойЦене ТОГДА питВыпускБлюдТовары.Характеристика ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КОНЕЦ КАК ХарактеристикаНабора,
	//>> Портал-Юг, Баринов, 2019.10.04
	|	питВыпускБлюдТовары.Назначение КАК НазначениеНоменклатуры
	|ПОМЕСТИТЬ ПЛ_ВтИнгредиентыСКоличеством
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПЛ_ВтИнгредиенты КАК ПЛ_ВтИнгредиенты
	|		ПО питВыпускБлюдТовары.Номенклатура = ПЛ_ВтИнгредиенты.Номенклатура
	|			И питВыпускБлюдТовары.Характеристика = ПЛ_ВтИнгредиенты.ХарактеристикаНоменклатуры
	|			И питВыпускБлюдТовары.Серия = ПЛ_ВтИнгредиенты.СерияНоменклатуры
	|			И питВыпускБлюдТовары.Рецептура = ПЛ_ВтИнгредиенты.Рецептура
	|			И питВыпускБлюдТовары.Назначение = ПЛ_ВтИнгредиенты.Назначение
	|ГДЕ
	|	питВыпускБлюдТовары.Ссылка = &Ссылка
	|	И НЕ ПЛ_ВтИнгредиенты.Ингредиент ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	питВыпускБлюдТовары.СуммаРучнойСкидки,
	|	питВыпускБлюдТовары.СтавкаНДС,
	//<< Портал-Юг, Баринов, 2019.10.07 [4.2.8 Заполнение отчёта о розничных продажах из выпуска блюд для особых продаж]
	//|	питВыпускБлюдТовары.Упаковка,
	|	ПЛ_ВтИнгредиенты.Упаковка,
	//>> Портал-Юг, Баринов, 2019.10.07	
	|	ПЛ_ВтИнгредиенты.Ингредиент,
	|	питВыпускБлюдТовары.Номенклатура,
	|	ПЛ_ВтИнгредиенты.КоличествоУпаковокИнгредиентаФакт,
	|	питВыпускБлюдТовары.КоличествоУпаковок,
	|	питВыпускБлюдТовары.Цена,
	|	питВыпускБлюдТовары.ПЛ_Договор,
	|	питВыпускБлюдТовары.Рецептура,
	|	ПЛ_ВтИнгредиенты.Характеристика,
	|	ПЛ_ВтИнгредиенты.Серия,
	|	ПЛ_ВтИнгредиенты.Назначение,
	|	питВыпускБлюдТовары.Рецептура,
	|	питВыпускБлюдТовары.Характеристика,
	|	питВыпускБлюдТовары.Серия,
	//<< Портал-Юг, Баринов, 2019.10.04 [9.09 Обособление продаж по открытой цене]
	|	ВЫБОР КОГДА питВыпускБлюдТовары.Номенклатура.питПродажаПоСвободнойЦене ТОГДА питВыпускБлюдТовары.Номенклатура ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КОНЕЦ,
	|	ВЫБОР КОГДА питВыпускБлюдТовары.Номенклатура.питПродажаПоСвободнойЦене ТОГДА питВыпускБлюдТовары.Характеристика ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КОНЕЦ,
	//>> Портал-Юг, Баринов, 2019.10.04
	|	питВыпускБлюдТовары.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдТовары.Номенклатура КАК ПЛ_Блюдо,
	|	питВыпускБлюдТовары.Номенклатура КАК Номенклатура,
	|	питВыпускБлюдТовары.Характеристика КАК Характеристика,
	|	питВыпускБлюдТовары.Серия КАК Серия,
	|	питВыпускБлюдТовары.Назначение КАК Назначение,
	|	питВыпускБлюдТовары.Упаковка КАК Упаковка,
	|	питВыпускБлюдТовары.Количество КАК Количество,
	|	питВыпускБлюдТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	питВыпускБлюдТовары.Цена КАК Цена,
	|	питВыпускБлюдТовары.Сумма КАК Сумма,
	|	питВыпускБлюдТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	питВыпускБлюдТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	питВыпускБлюдТовары.СтавкаНДС КАК СтавкаНДС,
	|	питВыпускБлюдТовары.СуммаНДС КАК СуммаНДС,
	|	НоменклатураСпр.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
	|	питВыпускБлюдТовары.ПЛ_Договор КАК ПЛ_Договор,
	|	ИСТИНА КАК ПЛ_ЭтоБлюдо,
	|	0 КАК ПЛ_Количество,
	|	0 КАК ПЛ_КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА НоменклатураСпр.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ НоменклатураСпр.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПЛ_ЭтоТовар,
	|	питВыпускБлюдТовары.Рецептура КАК ПЛ_Рецептура,
	|	питВыпускБлюдТовары.Характеристика КАК ПЛ_ХарактеристикаНоменклатуры,
	|	питВыпускБлюдТовары.Серия КАК ПЛ_СерияНоменклатуры,
	|	питВыпускБлюдТовары.Назначение КАК ПЛ_НазначениеНоменклатуры,
	//<< Портал-Юг, Баринов, 2019.10.04 [9.09 Обособление продаж по открытой цене]
	//|	питВыпускБлюдТовары.Рецептура КАК ПЛ_РецептураНоменклатуры
	|	ВЫБОР 
	|		КОГДА НоменклатураСпр.питПродажаПоСвободнойЦене
	|			ТОГДА питВыпускБлюдТовары.Номенклатура
	|		КОГДА Шапка.ПЛ_Номенклатура.питПродажаПоСвободнойЦене
	|			ТОГДА Шапка.ПЛ_Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатураНабора,
	|	ВЫБОР КОГДА НоменклатураСпр.питПродажаПоСвободнойЦене ТОГДА питВыпускБлюдТовары.Характеристика ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КОНЕЦ КАК ХарактеристикаНабора
	//>> Портал-Юг, Баринов, 2019.10.04
	|ПОМЕСТИТЬ ПЛ_ВтРезультат
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО питВыпускБлюдТовары.Номенклатура = НоменклатураСпр.Ссылка
	//<< Портал-Юг, Баринов, 2019.10.04 [9.09 Обособление продаж по открытой цене]
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд КАК Шапка
	|		ПО питВыпускБлюдТовары.Ссылка = Шапка.Ссылка
	//>> Портал-Юг, Баринов, 2019.10.04
	|ГДЕ
	|	питВыпускБлюдТовары.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА питВыпускБлюдТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ТОГДА питВыпускБлюдТовары.Цена > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПЛ_ВтИнгредиентыСКоличеством.Номенклатура,
	|	ПЛ_ВтИнгредиентыСКоличеством.Ингредиент,
	|	ПЛ_ВтИнгредиентыСКоличеством.Характеристика,
	|	ПЛ_ВтИнгредиентыСКоличеством.Серия,
	|	ПЛ_ВтИнгредиентыСКоличеством.Назначение,
	|	ПЛ_ВтИнгредиентыСКоличеством.Упаковка,
	|	ПЛ_ВтИнгредиентыСКоличеством.КоличествоИнгредиентаНаЕдиницу * ПЛ_ВтИнгредиентыСКоличеством.Количество,
	|	ПЛ_ВтИнгредиентыСКоличеством.КоличествоУпаковокИнгредиентаНаЕдиницу * ПЛ_ВтИнгредиентыСКоличеством.КоличествоУпаковок,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ПЛ_ВтИнгредиентыСКоличеством.СтавкаНДС,
	|	0,
	|	ПЛ_ВтИнгредиентыСКоличеством.ГруппаАналитическогоУчета,
	|	ПЛ_ВтИнгредиентыСКоличеством.ПЛ_Договор,
	|	ЛОЖЬ,
	|	ВЫРАЗИТЬ(ПЛ_ВтИнгредиентыСКоличеством.КоличествоИнгредиентаНаЕдиницу * ПЛ_ВтИнгредиентыСКоличеством.Количество КАК ЧИСЛО(15, 3)),
	|	ВЫРАЗИТЬ(ПЛ_ВтИнгредиентыСКоличеством.КоличествоУпаковокИнгредиентаНаЕдиницу * ПЛ_ВтИнгредиентыСКоличеством.КоличествоУпаковок КАК ЧИСЛО(15, 3)),
	|	ВЫБОР
	|		КОГДА ПЛ_ВтИнгредиентыСКоличеством.Ингредиент.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ ПЛ_ВтИнгредиентыСКоличеством.Ингредиент.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ПЛ_ВтИнгредиентыСКоличеством.Рецептура,
	|	ПЛ_ВтИнгредиентыСКоличеством.ХарактеристикаНоменклатуры,
	|	ПЛ_ВтИнгредиентыСКоличеством.СерияНоменклатуры,
	|	ПЛ_ВтИнгредиентыСКоличеством.НазначениеНоменклатуры,
	//<< Портал-Юг, Баринов, 2019.10.04 [9.09 Обособление продаж по открытой цене]
	//|	ПЛ_ВтИнгредиентыСКоличеством.РецептураНоменклатуры
	|	ПЛ_ВтИнгредиентыСКоличеством.НоменклатураНабора КАК НоменклатураНабора,
	|	ПЛ_ВтИнгредиентыСКоличеством.ХарактеристикаНабора КАК ХарактеристикаНабора
	//>> Портал-Юг, Баринов, 2019.10.04
	|ИЗ
	|	ПЛ_ВтИнгредиентыСКоличеством КАК ПЛ_ВтИнгредиентыСКоличеством
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПЛ_ВтРезультат.Номенклатура КАК Номенклатура,
	|	ПЛ_ВтРезультат.Характеристика КАК Характеристика,
	|	ПЛ_ВтРезультат.Серия КАК Серия,
	|	ПЛ_ВтРезультат.Назначение КАК Назначение,
	|	ПЛ_ВтРезультат.Упаковка КАК Упаковка,
	|	СУММА(ПЛ_ВтРезультат.Количество) КАК Количество,
	|	СУММА(ПЛ_ВтРезультат.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ПЛ_ВтРезультат.Цена КАК Цена,
	|	СУММА(ПЛ_ВтРезультат.Сумма) КАК Сумма,
	|	СУММА(ПЛ_ВтРезультат.ПроцентРучнойСкидки) КАК ПроцентРучнойСкидки,
	|	СУММА(ПЛ_ВтРезультат.СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
	|	ПЛ_ВтРезультат.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ПЛ_ВтРезультат.СуммаНДС) КАК СуммаНДС,
	|	ПЛ_ВтРезультат.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
	|	ПЛ_ВтРезультат.ПЛ_ЭтоБлюдо КАК ПЛ_ЭтоБлюдо,
	|	СУММА(ПЛ_ВтРезультат.ПЛ_Количество) КАК ПЛ_Количество,
	|	СУММА(ПЛ_ВтРезультат.ПЛ_КоличествоУпаковок) КАК ПЛ_КоличествоУпаковок,
	|	ПЛ_ВтРезультат.ПЛ_ЭтоТовар КАК ПЛ_ЭтоТовар,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА &ЗаборныйЛист
	|				ТОГДА ПЛ_НастройкиПродаж.ДополнительнаяАналитикаПродаж
	|			ИНАЧЕ ПЛ_ВтРезультат.ПЛ_Договор
	|		КОНЕЦ, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ПЛ_Договор,
	|	ПЛ_ВтРезультат.ПЛ_Блюдо КАК ПЛ_Блюдо,
	|	ПЛ_ВтРезультат.ПЛ_Рецептура КАК ПЛ_Рецептура,
	|	ПЛ_ВтРезультат.ПЛ_ХарактеристикаНоменклатуры КАК ПЛ_ХарактеристикаНоменклатуры,
	|	ПЛ_ВтРезультат.ПЛ_СерияНоменклатуры КАК ПЛ_СерияНоменклатуры,
	|	ПЛ_ВтРезультат.ПЛ_НазначениеНоменклатуры КАК ПЛ_НазначениеНоменклатуры,
	//<< Портал-Юг, Баринов, 2019.10.04 [9.09 Обособление продаж по открытой цене]
	//|	ПЛ_ВтРезультат.ПЛ_РецептураНоменклатуры КАК ПЛ_РецептураНоменклатуры
	|	ПЛ_ВтРезультат.НоменклатураНабора КАК НоменклатураНабора,
	|	ПЛ_ВтРезультат.ХарактеристикаНабора КАК ХарактеристикаНабора
	//>> Портал-Юг, Баринов, 2019.10.04
	|ИЗ
	|	ПЛ_ВтРезультат КАК ПЛ_ВтРезультат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_НастройкиПродаж КАК ПЛ_НастройкиПродаж
	//<< Портал-Юг, Баринов, 2019.03.26 [4.2.8 Заполнение отчёта о розничных продажах из выпуска блюд для особых продаж]
	//|		ПО ПЛ_ВтРезультат.Номенклатура = ПЛ_НастройкиПродаж.Номенклатура
	|		ПО ПЛ_НастройкиПродаж.Номенклатура = &ЗаборныйЛистНоменклатура
	//>> Портал-Юг, Баринов, 2019.03.26
	|
	|СГРУППИРОВАТЬ ПО
	|	ПЛ_ВтРезультат.Номенклатура,
	|	ПЛ_ВтРезультат.Характеристика,
	|	ПЛ_ВтРезультат.Серия,
	|	ПЛ_ВтРезультат.Упаковка,
	|	ПЛ_ВтРезультат.ПЛ_ЭтоТовар,
	|	ПЛ_ВтРезультат.Назначение,
	|	ПЛ_ВтРезультат.ПЛ_ЭтоБлюдо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА &ЗаборныйЛист
	|				ТОГДА ПЛ_НастройкиПродаж.ДополнительнаяАналитикаПродаж
	|			ИНАЧЕ ПЛ_ВтРезультат.ПЛ_Договор
	|		КОНЕЦ, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
	|	ПЛ_ВтРезультат.СтавкаНДС,
	|	ПЛ_ВтРезультат.ГруппаАналитическогоУчета,
	|	ПЛ_ВтРезультат.Цена,
	|	ПЛ_ВтРезультат.ПЛ_Блюдо,
	|	ПЛ_ВтРезультат.ПЛ_Рецептура,
	|	ПЛ_ВтРезультат.ПЛ_ХарактеристикаНоменклатуры,
	|	ПЛ_ВтРезультат.ПЛ_СерияНоменклатуры,
	|	ПЛ_ВтРезультат.ПЛ_НазначениеНоменклатуры,
	//<< Портал-Юг, Баринов, 2019.10.04 [9.09 Обособление продаж по открытой цене]
	//|	ПЛ_ВтРезультат.ПЛ_РецептураНоменклатуры
	|	ПЛ_ВтРезультат.НоменклатураНабора,
	|	ПЛ_ВтРезультат.ХарактеристикаНабора
	//>> Портал-Юг, Баринов, 2019.10.04
	//>>Швецов.11.02.2025. Алкогольная продукция и Серии из документа выпуска блюд
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдТовары.Номенклатура КАК ПЛ_Блюдо,
	|	питВыпускБлюдТовары.Номенклатура КАК Номенклатура,
	|	питВыпускБлюдТовары.Характеристика КАК Характеристика,
	|	питВыпускБлюдТовары.Серия КАК Серия,
	|	питВыпускБлюдТовары.Назначение КАК Назначение,
	|	питВыпускБлюдТовары.Упаковка КАК Упаковка,
	|	питВыпускБлюдТовары.Количество КАК Количество,
	|	питВыпускБлюдТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	питВыпускБлюдТовары.Цена КАК Цена,
	|	питВыпускБлюдТовары.Сумма КАК Сумма,
	|	питВыпускБлюдТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	питВыпускБлюдТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	питВыпускБлюдТовары.СтавкаНДС КАК СтавкаНДС,
	|	питВыпускБлюдТовары.СуммаНДС КАК СуммаНДС,
	|	НоменклатураСпр.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
	|	питВыпускБлюдТовары.ПЛ_Договор КАК ПЛ_Договор,
	|	ИСТИНА КАК ПЛ_ЭтоБлюдо,
	|	0 КАК ПЛ_Количество,
	|	0 КАК ПЛ_КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА НоменклатураСпр.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ НоменклатураСпр.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПЛ_ЭтоТовар,
	|	питВыпускБлюдТовары.Рецептура КАК ПЛ_Рецептура,
	|	питВыпускБлюдТовары.Характеристика КАК ПЛ_ХарактеристикаНоменклатуры,
	|	питВыпускБлюдТовары.Серия КАК ПЛ_СерияНоменклатуры,
	|	питВыпускБлюдТовары.Назначение КАК ПЛ_НазначениеНоменклатуры,
	|	ВЫБОР
	|		КОГДА НоменклатураСпр.питПродажаПоСвободнойЦене
	|			ТОГДА питВыпускБлюдТовары.Номенклатура
	|		КОГДА Шапка.ПЛ_Номенклатура.питПродажаПоСвободнойЦене
	|			ТОГДА Шапка.ПЛ_Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатураНабора,
	|	ВЫБОР
	|		КОГДА НоменклатураСпр.питПродажаПоСвободнойЦене
	|			ТОГДА питВыпускБлюдТовары.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ХарактеристикаНабора 
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО питВыпускБлюдТовары.Номенклатура = НоменклатураСпр.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд КАК Шапка
	|		ПО питВыпускБлюдТовары.Ссылка = Шапка.Ссылка
	|ГДЕ
	|	питВыпускБлюдТовары.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА питВыпускБлюдТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ТОГДА питВыпускБлюдТовары.Цена > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И питВыпускБлюдТовары.Номенклатура.АлкогольнаяПродукция
	|	И НЕ питВыпускБлюдТовары.Номенклатура.АлкогольнаяПродукцияВоВскрытойТаре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдТоварыСерии.Номенклатура КАК Номенклатура,
	|	питВыпускБлюдТоварыСерии.Серия КАК Серия,
	|	питВыпускБлюдТоварыСерии.Количество КАК Количество
	|ИЗ
	|	Документ.питВыпускБлюд.ТоварыСерии КАК питВыпускБлюдТоварыСерии
	|ГДЕ
	|	питВыпускБлюдТоварыСерии.Ссылка = &Ссылка
	|";	
	//>>Швецов.11.02.2025. Алкогольная продукция и Серии из документа выпуска блюд
	
	ПЛ_Запрос.УстановитьПараметр("ЗаборныйЛист", MRS_ЗаборныйЛист);
	//<< Портал-Юг, Баринов, 2019.03.26 [4.2.8 Заполнение отчёта о розничных продажах из выпуска блюд для особых продаж]
	ПЛ_Запрос.УстановитьПараметр("ЗаборныйЛистНоменклатура", ДокументВыпускБлюд.ПЛ_Номенклатура);
	//>> Портал-Юг, Баринов, 2019.03.26
	ПЛ_Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	
	ПЛ_ВтЗапроса = ПЛ_Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	//>>Портал-Юг, Давиденко 2019.03.19
	
	СкладскиеТипыНоменклатуры = питОбщегоНазначения.ПолучитьСкладскиеТипыНоменклатуры();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Обход таб. части и заполнение таб. частей "Товары".
	//<<Портал-Юг, Давиденко 2019.03.19 [4.2.8 Заполнение отчёта о розничных продажах из выпуска блюд для особых продаж]
	// подмена основной выборки на выборку с ингредиентами и договорами
	//Выборка = РезультатЗапроса[0].Выбрать();
	Выборка = ПЛ_ВтЗапроса[3].Выбрать();
	
	// ПЛ_ТЗДляПроверкиКоличестваИнгредиентов - таблица, по которой будут рассчитываться отклонения после округления
	ПЛ_ТЗДляПроверкиКоличестваИнгредиентов = ПЛ_ВтЗапроса[0].Выгрузить();
	
	// ПЛ_ТЗДляОпределенияДоговора - таблица, из которой будет получен договор при переносе ошибок округления
	ПЛ_ТЗДляОпределенияДоговора = ПЛ_ВтЗапроса[1].Выгрузить();
	
	// ПЛ_ТЗДляДвиженияПродукции - таблица, данными которой необходимо дополнить документ ДвижениеПродукцииИМатериалов
	// т.к ПЛ_ТЗДляПроверкиКоличестваИнгредиентов будет изменена в процессе распределения количества, сохраним исходную ТЗ отдельно
	ПЛ_ТЗДляДвиженияПродукции = ПЛ_ТЗДляПроверкиКоличестваИнгредиентов.Скопировать();
	//>>Портал-Юг, Давиденко 2019.03.19
	
	//<< Портал-Юг, Баринов, 2019.11.28 [9.14. Обособление шведской линии и банкетов по номенклатурным группам в БП]
	ПЛ_Номенклатура = ДокументВыпускБлюд.ПЛ_Номенклатура;
	Если ЗначениеЗаполнено(ПЛ_Номенклатура) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПЛ_Номенклатура, "питПродажаПоСвободнойЦене") Тогда
		ПЛ_Номенклатура = Неопределено;
	КонецЕсли; 
	//>> Портал-Юг, Баринов, 2019.11.28
	
	//>>Швецов.11.02.2025. Розничные продажи алкоголя. 
	//По заборному листу разбиваем серийный алкоголь и все остальное на ОРП и ВН "списание на расходы"
	MRS_ТЧАлкоголь = ПЛ_ВтЗапроса[4].Выбрать();
	MRS_ТЧСерииАлкоголь = ПЛ_ВтЗапроса[5].Выбрать();
	//<<Швецов.11.02.2025. Розничные продажи алкоголя.	
	
	Пока Выборка.Следующий() Цикл
		
		//>>Швецов.11.02.2025. Розничные продажи алкоголя. 
		//По заборному листу разбиваем серийный алкоголь и все остальное на ОРП и ВН "списание на расходы"
		СерийныйАлкоголь = Выборка.Номенклатура.АлкогольнаяПродукция И НЕ Выборка.Номенклатура.АлкогольнаяПродукцияВоВскрытойТаре;
		
		Если СерийныйАлкоголь И MRS_ЗаборныйЛист Тогда
			
			Продолжить;
			
		КонецЕсли;
		//<<Швецов.11.02.2025. Розничные продажи алкоголя
		
		НовСтрока						= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура			= Выборка.Номенклатура;
		НовСтрока.Характеристика		= Выборка.Характеристика;
		НовСтрока.Серия					= Справочники.СерииНоменклатуры.ПустаяСсылка(); // Заполним по FEFO непосредсвенно перед записью
		// Назначения в отчете о РП нет.
		//НовСтрока.Назначение			= Выборка.Назначение; 
		НовСтрока.Упаковка				= Выборка.Упаковка;
		НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковок;
		НовСтрока.Количество			= Выборка.Количество;
		НовСтрока.Цена					= Выборка.Цена;
		НовСтрока.Сумма					= Выборка.Сумма;
		НовСтрока.СтавкаНДС				= Выборка.СтавкаНДС;
		НовСтрока.СуммаНДС				= Выборка.СуммаНДС;
		НовСтрока.ПроцентРучнойСкидки	= Выборка.ПроцентРучнойСкидки;
		НовСтрока.СуммаРучнойСкидки		= Выборка.СуммаРучнойСкидки;
		НовСтрока.Партнер				= Справочники.Партнеры.РозничныйПокупатель;
		
		//<< Портал-Юг, Баринов, 2019.10.04 [9.09 Обособление продаж по открытой цене]
		НовСтрока.НоменклатураНабора    = Выборка.НоменклатураНабора;
		НовСтрока.ХарактеристикаНабора  = Выборка.ХарактеристикаНабора;
		//>> Портал-Юг, Баринов, 2019.10.04
		//<< Портал-Юг, Баринов, 2019.11.28 [9.14. Обособление шведской линии и банкетов по номенклатурным группам в БП]
		НовСтрока.ПЛ_Номенклатура = ПЛ_Номенклатура;
		//>> Портал-Юг, Баринов, 2019.11.28
		//<<Портал-Юг, Давиденко 2019.03.20 [4.2.8 Заполнение отчёта о розничных продажах из выпуска блюд для особых продаж]
		НовСтрока.ПЛ_Договор = Выборка.ПЛ_Договор;
		// признаком "ПЛ_ЭтоБлюдо" отделены строки из запроса, которые получены из ТЧ "Товары", по ним нет необходимости производить контроль количества
				
		Если Не Выборка.ПЛ_ЭтоБлюдо Тогда
			ПЛ_НоваяСтрокаТЗ = ПЛ_ТЗДляПроверкиКоличестваИнгредиентов.Добавить();
			ЗаполнитьЗначенияСвойств(ПЛ_НоваяСтрокаТЗ, Выборка);
			ПЛ_НоваяСтрокаТЗ.Ингредиент = Выборка.Номенклатура;
			ПЛ_НоваяСтрокаТЗ.Номенклатура = Выборка.ПЛ_Блюдо;
			ПЛ_НоваяСтрокаТЗ.Рецептура = Выборка.ПЛ_Рецептура;
			ПЛ_НоваяСтрокаТЗ.ХарактеристикаНоменклатуры = Выборка.ПЛ_ХарактеристикаНоменклатуры;
			ПЛ_НоваяСтрокаТЗ.СерияНоменклатуры = Выборка.ПЛ_СерияНоменклатуры;
			// таблица содержит все строки с отрицательным количеством, добавим строки с положительным, чтобы отследить разницу
			ПЛ_НоваяСтрокаТЗ.КоличествоИнгредиентаКонтроль = Выборка.ПЛ_Количество;
			ПЛ_НоваяСтрокаТЗ.КоличествоУпаковокИнгредиентаКонтроль = Выборка.ПЛ_КоличествоУпаковок;
		КонецЕсли;
		//>>Портал-Юг, Давиденко 2019.03.20
		
		//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
		Если НЕ ТекДокументПеремещения = Неопределено Тогда
			
			//<<Портал-Юг, Финик 02.06.2021 Исправление после обновления. В выборке этого нет
			//Если СкладскиеТипыНоменклатуры.Найти(Выборка.ТипНоменклатуры) = Неопределено Тогда
			//	Продолжить;
			//КонецЕсли;
			//>>Портал-Юг, Финик 02.06.2021
			
			//<<Портал-Юг, Давиденко 2019.03.21 [4.2.8 Заполнение отчёта о розничных продажах из выпуска блюд для особых продаж]
			// заполнение только товаров с закладки "товары"
			Если Не Выборка.ПЛ_ЭтоБлюдо 
				Или Не Выборка.ПЛ_ЭтоТовар Тогда 
				Продолжить;
			КонецЕсли;
			//>>Портал-Юг, Давиденко 2019.03.21			
			
			НовСтрокаДокПеремещения = ТекДокументПеремещения.Товары.Добавить();
			НовСтрокаДокПеремещения.Номенклатура				= Выборка.Номенклатура;
			НовСтрокаДокПеремещения.Характеристика				= Выборка.Характеристика;	
			НовСтрокаДокПеремещения.Серия						= Справочники.СерииНоменклатуры.ПустаяСсылка(); // Заполним по FEFO непосредсвенно перед записью
			НовСтрокаДокПеремещения.Назначение					= Выборка.Назначение;
			НовСтрокаДокПеремещения.НазначениеОтправителя		= Выборка.Назначение;
			НовСтрокаДокПеремещения.КоличествоУпаковок			= Выборка.КоличествоУпаковок;
			НовСтрокаДокПеремещения.Количество					= Выборка.Количество;
			НовСтрокаДокПеремещения.Упаковка					= Выборка.Упаковка;
			
			Если ИмяДокументаПеремещения = "ДвижениеПродукцииИМатериалов" Тогда
				НовСтрокаДокПеремещения.ИдентификаторСтроки		= Новый УникальныйИдентификатор;
				НовСтрокаДокПеремещения.ГруппаПродукции			= Выборка.ГруппаАналитическогоУчета;
			КонецЕсли;
			
		КонецЕсли;
		//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
				
	КонецЦикла;
	
	//>>Швецов. 10.12.2024 Розничные продажи алкоголя. Заполним серии из выпуска
	Если НЕ MRS_ЗаборныйЛист Тогда
						
		Пока MRS_ТЧСерииАлкоголь.Следующий() Цикл
			
			НоваяСтрокаСерия = ТекДокументОбъект.Серии.Добавить();
			НоваяСтрокаСерия.Номенклатура = MRS_ТЧСерииАлкоголь.Номенклатура;
			НоваяСтрокаСерия.Количество = MRS_ТЧСерииАлкоголь.Количество;
			НоваяСтрокаСерия.Серия = MRS_ТЧСерииАлкоголь.Серия;
			//НоваяСтрокаСерия.СтатусУказанияСерий = 4;
			
		КонецЦикла;
		
		MRS_ТЧСерииАлкоголь.Сбросить();
		
	КонецЕсли;	
	//<<Швецов. 10.12.2024 Розничные продажи алкоголя. Заполним серии из выпуска

	
	//<<Портал-Юг, Давиденко 2019.03.20 [4.2.8 Заполнение отчёта о розничных продажах из выпуска блюд для особых продаж]
	
	//>>Швецов.11.02.2025. Розничные продажи алкоголя. 
	//По заборному листу разбиваем серийный алкоголь и все остальное на ОРП и ВН "списание на расходы"
	Если НЕ ТекДокументСписания = Неопределено И MRS_ЗаборныйЛист И MRS_ТЧАлкоголь.Количество() <> 0 Тогда
		
		//+БазовоеСмещение
		Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
			СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
		КонецЕсли;
		БазовоеСмещение = 0;
		Если СтруктураПараметров.питСмещатьДатыТиповыхДокументов Тогда
			СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
			Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", ИмяДокументаВнутреннееПотребление, 0));
			Если СтрокиСмещение.Количество() Тогда
				БазовоеСмещение = СтрокиСмещение[0].БазовоеСмещение;
			КонецЕсли;
		КонецЕсли;
		//-БазовоеСмещение
		
		/////////////////////////////////
		// ЗАПОЛНЕНИЕ ШАПКИ.
		ТекДокументСписания.Дата								= ДокументВыпускБлюд.Дата 
		+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0)
		- БазовоеСмещение;
		ТекДокументСписания.Организация						= ДокументВыпускБлюд.Организация;     
		
		// << MRS #VINE-142 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 15.07.25, (Заполнение алкогольной лицензии по умолчанию)
		Если ТекДокументСписания.Метаданные().Реквизиты.Найти("алкЛицензияОрганизации") <> Неопределено  Тогда
			ЗапросАлкЛицензия = Новый Запрос;
			ЗапросАлкЛицензия.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	алкЛицензии.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.алкЛицензии КАК алкЛицензии
			|ГДЕ
			|	&ДатаДокумента МЕЖДУ алкЛицензии.ДатаНачалаСрокаДействия И алкЛицензии.ДатаОкончанияСрокаДействия
			|	И алкЛицензии.Владелец = &Владелец";
			
			ЗапросАлкЛицензия.УстановитьПараметр("Владелец", ТекДокументСписания.Организация);
			ЗапросАлкЛицензия.УстановитьПараметр("ДатаДокумента", ТекДокументСписания.Дата);
			
			РезультатЗапросаалкЛицензияОрганизации = ЗапросАлкЛицензия.Выполнить();
			
			ВыборкаДетальныеЗаписиалкЛицензияОрганизации = РезультатЗапросаалкЛицензияОрганизации.Выбрать();
			
			Если ВыборкаДетальныеЗаписиалкЛицензияОрганизации.Следующий() Тогда
				ТекДокументСписания.алкЛицензияОрганизации = ВыборкаДетальныеЗаписиалкЛицензияОрганизации.Ссылка;
			КонецЕсли; 
			
		КонецЕсли;
		// >> MRS #VINE-142 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 15.07.25, (Заполнение алкогольной лицензии по умолчанию)   
		
		ТекДокументСписания.Склад								= ДокументВыпускБлюд.СкладПолучатель;
		ТекДокументСписания.Подразделение						= ДокументВыпускБлюд.Подразделение;
		ТекДокументСписания.Ответственный						= ДокументВыпускБлюд.Ответственный;
		ТекДокументСписания.Комментарий						= ДокументВыпускБлюд.Комментарий;
		//+25
		//ТекДокументОбъект.ДатаРаспоряжения					= КонецДня(ДокументВыпускБлюд.Дата);
		//-25
		ТекДокументСписания.ВидЦены							= ДокументВыпускБлюд.ТипЦен;
		ТекДокументСписания.ХозяйственнаяОперация				= Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		ТекДокументСписания.НаправлениеДеятельности			= ДокументВыпускБлюд.НаправлениеДеятельности;
		
		// Очистка табличных частей, т.к. будет их перезаполнение.
		ТекДокументСписания.Товары.Очистить();
		ТекДокументСписания.Серии.Очистить();
		ТекДокументСписания.ВидыЗапасов.Очистить();
		ТекДокументСписания.ДополнительныеРеквизиты.Очистить();
		
		// << MRS #ERP-5519 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 20.11.25, ()
		ПричинаСписания = Справочники.MRS_ПричиныСписания.ПустаяСсылка();
		ПричинаСписания = MRS_СлужебныеПараметрыПовтИсп.ПолучитьЗначение("ПричинаСписанияДляСозданияВП_из_ЗаборногоЛиста","Значение");
		// >> MRS #ERP-5519 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 20.11.25, ()
		
		Пока MRS_ТЧАлкоголь.Следующий() Цикл
			НовСтрокаДокСписания = ТекДокументСписания.Товары.Добавить();
			НовСтрокаДокСписания.Номенклатура				= MRS_ТЧАлкоголь.Номенклатура;
			НовСтрокаДокСписания.СтатьяРасходов				= ДокументВыпускБлюд.СтатьяРасходов;
			НовСтрокаДокСписания.Характеристика				= MRS_ТЧАлкоголь.Характеристика;	
			НовСтрокаДокСписания.Серия						= Справочники.СерииНоменклатуры.ПустаяСсылка(); // Заполним по FEFO непосредсвенно перед записью
			НовСтрокаДокСписания.Назначение					= MRS_ТЧАлкоголь.Назначение;   
			// << MRS #VINE-128 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 11.06.25, ()
			//НовСтрокаДокСписания.КоличествоУпаковок			= MRS_ТЧАлкоголь.Количество;
			НовСтрокаДокСписания.КоличествоУпаковок			= MRS_ТЧАлкоголь.КоличествоУпаковок;
			// >> MRS #VINE-128 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 11.06.25, ()
			НовСтрокаДокСписания.Количество					= MRS_ТЧАлкоголь.Количество;
			НовСтрокаДокСписания.Упаковка					= MRS_ТЧАлкоголь.Упаковка;
            НовСтрокаДокСписания.СтатусУказанияСерий		= 4;
			НовСтрокаДокСписания.СтатусУказанияСерийОтправитель		= 4;
			// << MRS #ERP-5519 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 20.11.25, ()
			НовСтрокаДокСписания.MRS_ПричиныСписания = ПричинаСписания;
			// >> MRS #ERP-5519 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 20.11.25, ()
		КонецЦикла;
		
		Пока MRS_ТЧСерииАлкоголь.Следующий() Цикл
			НоваяСтрокаСерияСписания = ТекДокументСписания.Серии.Добавить();
			НоваяСтрокаСерияСписания.Номенклатура = MRS_ТЧСерииАлкоголь.Номенклатура;
			НоваяСтрокаСерияСписания.Количество = MRS_ТЧСерииАлкоголь.Количество;;
			НоваяСтрокаСерияСписания.Серия = MRS_ТЧСерииАлкоголь.Серия;
		КонецЦикла;
	
	КонецЕсли;
	//<<Швецов.11.02.2025. Розничные продажи алкоголя.

	// необходимо дополнить состав товаров документа ТекДокументПеремещения
	Если НЕ ТекДокументПеремещения = Неопределено Тогда
		Для Каждого ПЛ_СтрокаТаблицыИнгридиентов Из ПЛ_ТЗДляДвиженияПродукции Цикл
			Если ПЛ_СтрокаТаблицыИнгридиентов.ЭтоТовар Тогда
				НовСтрокаДвижениеПродукцииИМатериалов = ТекДокументПеремещения.Товары.Добавить();
				НовСтрокаДвижениеПродукцииИМатериалов.Номенклатура				= ПЛ_СтрокаТаблицыИнгридиентов.Ингредиент;
				НовСтрокаДвижениеПродукцииИМатериалов.Характеристика			= ПЛ_СтрокаТаблицыИнгридиентов.Характеристика;
				НовСтрокаДвижениеПродукцииИМатериалов.Серия						= Справочники.СерииНоменклатуры.ПустаяСсылка(); // Заполним по FEFO непосредсвенно перед записью
				//НовСтрокаДвижениеПродукцииИМатериалов.Назначение???
				НовСтрокаДвижениеПродукцииИМатериалов.КоличествоУпаковок		= ПЛ_СтрокаТаблицыИнгридиентов.КоличествоУпаковокИнгредиентаФакт;
				НовСтрокаДвижениеПродукцииИМатериалов.Количество				= ПЛ_СтрокаТаблицыИнгридиентов.КоличествоИнгредиентаФакт;
				НовСтрокаДвижениеПродукцииИМатериалов.Упаковка					= ПЛ_СтрокаТаблицыИнгридиентов.Упаковка;
				НовСтрокаДвижениеПродукцииИМатериалов.ИдентификаторСтроки		= Новый УникальныйИдентификатор;
				НовСтрокаДвижениеПродукцииИМатериалов.ГруппаПродукции			= ПЛ_СтрокаТаблицыИнгридиентов.ГруппаАналитическогоУчета;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Сворачиваем получившуюся таблицу по ключевым полям и удаляем строки с нулевым количеством
	ПЛ_ТЗДляПроверкиКоличестваИнгредиентов.Свернуть("Номенклатура, Ингредиент, Характеристика, Серия, ХарактеристикаНоменклатуры, СерияНоменклатуры, Рецептура, Назначение", "КоличествоИнгредиентаКонтроль, КоличествоУпаковокИнгредиентаКонтроль"); 
	
	// обход таблицы с выявленными различиями после округления
	ПЛ_СтруктураПоиска = Новый Структура;
	Для Каждого ПЛ_СтрокаСРазницейПослеОкругления Из ПЛ_ТЗДляПроверкиКоличестваИнгредиентов Цикл
		Если ПЛ_СтрокаСРазницейПослеОкругления.КоличествоУпаковокИнгредиентаКонтроль = 0
			И ПЛ_СтрокаСРазницейПослеОкругления.КоличествоИнгредиентаКонтроль = 0
			Тогда Продолжить;
		КонецЕсли;

		ПЛ_СтруктураПоиска.Вставить("Ингредиент", ПЛ_СтрокаСРазницейПослеОкругления.Ингредиент);
		ПЛ_СтруктураПоиска.Вставить("Номенклатура", ПЛ_СтрокаСРазницейПослеОкругления.Номенклатура);
		ПЛ_СтруктураПоиска.Вставить("Характеристика", ПЛ_СтрокаСРазницейПослеОкругления.Характеристика);
		ПЛ_СтруктураПоиска.Вставить("Серия", ПЛ_СтрокаСРазницейПослеОкругления.Серия);

		ПЛ_СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", ПЛ_СтрокаСРазницейПослеОкругления.ХарактеристикаНоменклатуры);
		ПЛ_СтруктураПоиска.Вставить("СерияНоменклатуры", ПЛ_СтрокаСРазницейПослеОкругления.СерияНоменклатуры);
		ПЛ_СтруктураПоиска.Вставить("Рецептура", ПЛ_СтрокаСРазницейПослеОкругления.Рецептура);
		ПЛ_СтруктураПоиска.Вставить("Назначение", ПЛ_СтрокаСРазницейПослеОкругления.Назначение);
		
		// договор получаем из другой таблицы по связке ключевых полей
		ПЛ_СтрокаСДоговором = ПЛ_ТЗДляОпределенияДоговора.НайтиСтроки(ПЛ_СтруктураПоиска);
		Если ПЛ_СтрокаСДоговором.Количество() > 0 Тогда
			ПЛ_СтруктураПоиска.Вставить("ПЛ_Договор", ПЛ_СтрокаСДоговором[0].ПЛ_Договор);
		КонецЕсли;
		
		ПЛ_СтруктураПоиска.Номенклатура = ПЛ_СтруктураПоиска.Ингредиент;
		ПЛ_СтруктураПоиска.Удалить("Ингредиент");
		ПЛ_СтруктураПоиска.Удалить("ХарактеристикаНоменклатуры");
		ПЛ_СтруктураПоиска.Удалить("СерияНоменклатуры");
		ПЛ_СтруктураПоиска.Удалить("Рецептура");
		ПЛ_СтруктураПоиска.Удалить("Назначение");
		
		// поиск нужной строки в документе
		ПЛ_СтрокаТЧТовары = ТекДокументОбъект.Товары.НайтиСтроки(ПЛ_СтруктураПоиска);
		
		// в случае, если строка документа найдена, изменяем количество в ней 
		Если ПЛ_СтрокаТЧТовары.Количество() > 0 Тогда
			ПЛ_СтрокаТЧТовары[0].Количество = ПЛ_СтрокаТЧТовары[0].Количество - ПЛ_СтрокаСРазницейПослеОкругления.КоличествоИнгредиентаКонтроль;
			ПЛ_СтрокаТЧТовары[0].КоличествоУпаковок = ПЛ_СтрокаТЧТовары[0].КоличествоУпаковок - ПЛ_СтрокаСРазницейПослеОкругления.КоличествоУпаковокИнгредиентаКонтроль;
		КонецЕсли;
		ПЛ_СтруктураПоиска.Очистить();
	КонецЦикла;
	//>>Портал-Юг, Давиденко 2019.03.20
	
	// Обход таб. части и заполнение таб. частей "Оплаты".
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовСтрока						= ТекДокументОбъект.ОплатаПлатежнымиКартами.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		//>>Швецов. 22.05.2025. ERP-5059. Способы оплат в ОРП
		НовСтрока.ВидОплаты				= Перечисления.ТипыПлатежнойСистемыККТ.ПлатежнаяКарта; 
		//<<
	КонецЦикла;
	
	// Обход таб. части и заполнение таб. частей "Подарочные сертификаты".
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовСтрока						= ТекДокументОбъект.ПодарочныеСертификаты.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		
	КонецЦикла;
	
	// Обход таб. части и заполнение таб. частей "НачислениеБонусныхБаллов".
	Выборка = РезультатЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовСтрока						= ТекДокументОбъект.НачислениеБонусныхБаллов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		
	КонецЦикла;
	
	// Обход таб. части и заполнение таб. частей "НачислениеБонусныхБаллов".
	Выборка = РезультатЗапроса[4].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовСтрока						= ТекДокументОбъект.ОплатаБонуснымиБаллами.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		
	КонецЦикла;
	
	//>>Швецов.11.02.2025. Розничные продажи алкоголя. 
	//По заборному листу разбиваем серийный алкоголь и все остальное на ОРП и ВН "списание на расходы"
	Если НЕ ТекДокументСписания = Неопределено И НЕ(ТекДокументСписания = РежимЗаписиДокумента.ОтменаПроведения И ПустаяСтрока(ТекДокументСписания.ВерсияДанных)) И 
			ТекДокументСписания.Товары.Количество() <> 0 Тогда
			
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ИсходныйРежимЗаписиДокСписания	= ТекДокументСписания;
			ТекРежимЗаписиДокСписания			= РежимЗаписиДокумента.Запись;
		КонецЕсли;
		//-ОтложенноеПроведение
		
		Попытка
			
			//+Серии
			Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументВыпускБлюд);
			КонецЕсли;
			//-Серии

			ТекДокументСписания.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
				ТекДокументСписания.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
			КонецЕсли;                        
			
			// << MRS #ERP-5640 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 13.02.26, (Формирование акта на основании Заборного листа/Внутреннего потребления)
			Если Не ТекДокументСписания.ДополнительныеСвойства.Свойство("питДокументОбщепитРаспределениеЗапасов") И ТипЗнч(ДокументВыпускБлюд) = Тип("ДокументСсылка.питВыпускБлюд") Тогда
				ТекДокументСписания.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
			КонецЕсли;                                                                   
			// >> MRS #ERP-5640 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 13.02.26, (Формирование акта на основании Заборного листа/Внутреннего потребления) 
			
			ТекДокументСписания.Записать(ТекРежимЗаписиДокСписания);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка записи документа """ + ТекДокументСписания.Метаданные().Представление() + """
			| по документу Общепит """+ДокументВыпускБлюд+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписиДокСписания);
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументСписания.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументСписания.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		КонецЕсли;
		//-ОтложенноеПроведение
		
		//+ОтложенноеПроведение
		ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
		//-ОтложенноеПроведение
		
		// Добавление записи в результирующую таблицу в случае успешной записи документов.
		ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументСписания, тблСозданныеДокументы, 0, ТекСинхронизирован);
		
	КонецЕсли;
	
	//<<Швецов.11.02.2025. Розничные продажи алкоголя. ОРП может быть пустой
	Если НЕ ТекДокументПеремещения = Неопределено И НЕ(ТекРежимЗаписиДокПеремещения = РежимЗаписиДокумента.ОтменаПроведения И ПустаяСтрока(ТекДокументПеремещения.ВерсияДанных)) Тогда 
		Если MRS_ЗаборныйЛист И ТекДокументПеремещения.Товары.Количество() <> 0 Тогда
	//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
			//+Серии
			Если ТекРежимЗаписиДокПеремещения <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ЗаполнитьСерииТиповогоДокумента(ТекДокументПеремещения, ДокументВыпускБлюд, 1);
			КонецЕсли;
			//-Серии
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ИсходныйРежимЗаписиДокПеремещения	= ТекРежимЗаписиДокПеремещения;
				ТекРежимЗаписиДокПеремещения			= РежимЗаписиДокумента.Запись;
			КонецЕсли;
			//-ОтложенноеПроведение
			
			Попытка
				ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
					ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
				КонецЕсли;
				ТекДокументПеремещения.Записать(ТекРежимЗаписиДокПеремещения);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка записи документа """ + ТекДокументПеремещения.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписиДокПеремещения);
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			КонецЕсли;
			//-ОтложенноеПроведение
			
			//+ОтложенноеПроведение
			ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
			//-ОтложенноеПроведение
			
			// Добавление записи в результирующую таблицу в случае успешной записи документов.
			ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументПеремещения, тблСозданныеДокументы, 1, ТекСинхронизирован);
			
		КонецЕсли;
	КонецЕсли;
	//<<Швецов.11.02.2025. Розничные продажи алкоголя.
	
	// Если документ найден, то получаем объект иначе создаем новый.
	ТекДокументПеремещения = Неопределено;
	Если НЕ ВыборкаДокПеремещения = Неопределено И ВыборкаДокПеремещения.Следующий() Тогда
		ТекДокументПеремещения = ВыборкаДокПеремещения.ТиповойДокумент.ПолучитьОбъект();
		
		
		// Определение параметров записи.
		ПараметрыЗаписиДокПеремещения = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументПеремещения.Проведен,ТекДокументПеремещения.ПометкаУдаления, Новый Структура);
		
		// Определение режима записи
		ТекРежимЗаписиДокПеремещения = ПараметрыЗаписиДокПеремещения.РежимЗаписи;
		
		Если ПараметрыЗаписиДокПеремещения.НужнаУстановкаПометкиУдаления Тогда
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				
				Попытка
					ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
						ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
					КонецЕсли;
					ТекДокументПеремещения.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументПеремещения.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//+ОтложенноеПроведение
		ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
		//-ОтложенноеПроведение
		
		// Добавление записи в результирующую таблицу в случае успешной записи документов.
		ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументПеремещения, тблСозданныеДокументы, 1,ТекСинхронизирован);
		
	КонецЕсли;
	//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	//<<Швецов.11.02.2025. Розничные продажи алкоголя. ОРП может быть пустой
	Если ТекДокументОбъект.Товары.Количество() <> 0 Тогда
		Если НЕ(ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И ПустаяСтрока(ТекДокументОбъект.ВерсияДанных)) Тогда
			
			//+Серии
			Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ОтчетОРозничныхПродажах));
				ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументВыпускБлюд);
			КонецЕсли;
			//-Серии
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ИсходныйРежимЗаписи	= ТекРежимЗаписи;
				ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
			КонецЕсли;
			//-ОтложенноеПроведение
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.Записать(ТекРежимЗаписи);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			КонецЕсли;
			//-ОтложенноеПроведение
			
			//+ОтложенноеПроведение
			ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
			//-ОтложенноеПроведение
			
			// Добавление записи в результирующую таблицу в случае успешной записи документов.
			ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
			
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "Отчет о розничных продажах" для выпуска с розничной реализацией.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьРеализациюТоваровУслугПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Если СтруктураПараметров.Свойство("ФормироватьДокументыПроизводства22") Тогда
		ФормироватьДокументыПроизводства22 = СтруктураПараметров.ФормироватьДокументыПроизводства22;
	Иначе
		ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументВыпускБлюд, "Склад.ЦеховаяКладовая") Тогда
		ИмяДокументаПеремещения = "ДвижениеПродукцииИМатериалов";
	Иначе
		ИмяДокументаПеремещения = "ПеремещениеТоваров";
	КонецЕсли;
	
	//+БазовоеСмещение
	Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
		СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
	КонецЕсли;
	БазовоеСмещениеРеализацияТоваровУслуг = 0;
	БазовоеСмещениеДокументаПеремещения = 0;
	Если СтруктураПараметров.питСмещатьДатыТиповыхДокументов Тогда
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", "ОтчетОРозничныхПродажах", 0));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещениеРеализацияТоваровУслуг = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", ИмяДокументаПеремещения, 1));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещениеДокументаПеремещения = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
	КонецЕсли;
	//-БазовоеСмещение
	
	ОрганизацияКассыККМ = питОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументВыпускБлюд.КассаККМ, "Владелец");
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Отчет о розничных продажах",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент,
	|	питТиповыеДокументы.ДокументОбщепит,
	|	питТиповыеДокументы.ПричинаТиповогоДокумента
	|ПОМЕСТИТЬ втТиповыеДокументы
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ИЗ
	|	втТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(втТиповыеДокументы.ТиповойДокумент КАК Документ.%ИмяДокументаПеремещения%) КАК ТиповойДокумент,
	|	ВЫРАЗИТЬ(втТиповыеДокументы.ДокументОбщепит КАК Документ.питВыпускБлюд) КАК ДокументОбщепит
	|ПОМЕСТИТЬ втДвжиенияПродукцииИМатериалов
	|ИЗ
	|	втТиповыеДокументы КАК втТиповыеДокументы
	|ГДЕ
	|	втТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.%ИмяДокументаПеремещения%
	|	И втТиповыеДокументы.ПричинаТиповогоДокумента = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДвжиенияПродукцииИМатериалов.ТиповойДокумент
	|ИЗ
	|	втДвжиенияПродукцииИМатериалов КАК втДвжиенияПродукцииИМатериалов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд КАК питВыпускБлюд
	|		ПО втДвжиенияПродукцииИМатериалов.ДокументОбщепит = питВыпускБлюд.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.%ИмяДокументаПеремещения% КАК %ИмяДокументаПеремещения%
	|		ПО втДвжиенияПродукцииИМатериалов.ТиповойДокумент = %ИмяДокументаПеремещения%.Ссылка
	|ГДЕ
	|	%ИмяДокументаПеремещения%.%ИмяПоляПолучатель% <> питВыпускБлюд.Склад";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяДокументаПеремещения%", ИмяДокументаПеремещения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяПоляПолучатель%", ?(ИмяДокументаПеремещения = "ДвижениеПродукцииИМатериалов", "Получатель", "СкладПолучатель"));
	
	Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
	Иначе
		ТекДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	ТекДокументПеремещения = Неопределено;
	ВыборкаДокПеремещения = РезультатЗапроса[3].Выбрать();
	Если ФормироватьДокументыПроизводства22 
		И ДокументВыпускБлюд.СкладПолучатель <> ДокументВыпускБлюд.Склад Тогда
		
		// Если документ найден, то получаем объект иначе создаем новый.
		Если ВыборкаДокПеремещения.Следующий() Тогда
			ТекДокументПеремещения = ВыборкаДокПеремещения.ТиповойДокумент.ПолучитьОбъект();
		Иначе
			ТекДокументПеремещения = Документы[ИмяДокументаПеремещения].СоздатьДокумент();
		КонецЕсли;
		
		// Определение параметров записи.
		ПараметрыЗаписиДокПеремещения = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументПеремещения.Проведен,ТекДокументПеремещения.ПометкаУдаления, Новый Структура);
		
		// Определение режима записи
		ТекРежимЗаписиДвижениеПродукции = ПараметрыЗаписиДокПеремещения.РежимЗаписи;
		
		Если ПараметрыЗаписиДокПеремещения.НужнаУстановкаПометкиУдаления Тогда
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				
				Попытка
					ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
						ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
					КонецЕсли;
					ТекДокументПеремещения.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументПеремещения.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;
	//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	мМетаданныеДокументапит =		ДокументВыпускБлюд.Метаданные();
	мМетаданныеТиповогоДокумента =	ТекДокументОбъект.Метаданные();
	
	ТекДокументОбъект.Дата								= ДокументВыпускБлюд.Дата 
	+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0)
	- БазовоеСмещениеРеализацияТоваровУслуг;
	
	ТекДокументОбъект.Соглашение						= ДокументВыпускБлюд.Соглашение;
	Если ЗначениеЗаполнено(ТекДокументОбъект.Соглашение) Тогда
		// Значения по соглашению по умолчанию.
		ТекДокументОбъект.ЗаполнитьУсловияПродажПоСоглашению();
	КонецЕсли;
	
	ТекДокументОбъект.ХозяйственнаяОперация				= Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	ТекДокументОбъект.Организация						= ДокументВыпускБлюд.Организация;
	ТекДокументОбъект.Подразделение						= ДокументВыпускБлюд.Подразделение;
	ТекДокументОбъект.Склад								= ?(ФормироватьДокументыПроизводства22, ДокументВыпускБлюд.СкладПолучатель, ДокументВыпускБлюд.Склад);
	ТекДокументОбъект.Контрагент						= ДокументВыпускБлюд.Контрагент;
	ТекДокументОбъект.Партнер							= ДокументВыпускБлюд.Партнер;
	ТекДокументОбъект.Договор							= ДокументВыпускБлюд.Договор;
	ТекДокументОбъект.Статус							= Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	ТекДокументОбъект.Договор							= ДокументВыпускБлюд.Договор;
	ТекДокументОбъект.НаправлениеДеятельности			= ДокументВыпускБлюд.НаправлениеДеятельности;
	//Сделка
	
	ТекДокументОбъект.СкидкиРассчитаны					= Истина;
	ТекДокументОбъект.Согласован						= Истина;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", мМетаданныеТиповогоДокумента) Тогда
		ТекДокументОбъект.Валюта						= ДокументВыпускБлюд.Валюта;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаВзаиморасчетов", мМетаданныеТиповогоДокумента) Тогда
		ТекДокументОбъект.ВалютаВзаиморасчетов			= ДокументВыпускБлюд.Валюта;
	КонецЕсли;
	
	ТекДокументОбъект.ВариантОформленияПродажи			= Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	//+25
	//ТекДокументОбъект.ПорядокОплаты						= Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;
	ТекДокументОбъект.ОплатавВалюте						= Ложь;
	//-25
	ТекДокументОбъект.ЦенаВключаетНДС					= ДокументВыпускБлюд.ЦенаВключаетНДС;
	//+25
	//ТекДокументОбъект.ДатаРаспоряжения					= КонецДня(ДокументВыпускБлюд.Дата);
	//-25
	ТекДокументОбъект.Менеджер							= ДокументВыпускБлюд.Ответственный;
	ТекДокументОбъект.Автор								= ДокументВыпускБлюд.Ответственный;
	ТекДокументОбъект.Комментарий						= ДокументВыпускБлюд.Комментарий;
	СтруктураОтветственного = ПродажиСервер.ПолучитьОтветственногоПоСкладу(ТекДокументОбъект.Склад);
	Если СтруктураОтветственного <> Неопределено Тогда
		ТекДокументОбъект.Отпустил						= СтруктураОтветственного.Ответственный;
		ТекДокументОбъект.ОтпустилДолжность				= СтруктураОтветственного.ОтветственныйДолжность;
	КонецЕсли;
	
	ТекДокументОбъект.РеализацияПоЗаказам				= Ложь;
	ТекДокументОбъект.ПорядокРасчетов					= Неопределено;
	ТекДокументОбъект.ПорядокРасчетов					= ВзаиморасчетыСервер.ПорядокРасчетовПоУмолчанию(ТекДокументОбъект);
	ТекДокументОбъект.ВернутьМногооборотнуюТару			= Ложь;
	ТекДокументОбъект.ДатаВозвратаМногооборотнойТары	= НачалоДня(ДокументВыпускБлюд.Дата);
	ТекДокументОбъект.ТребуетсяЗалогЗаТару				= Ложь;
	//СостояниеЗаполненияМногооборотнойТары
	ТекДокументОбъект.ВидыЗапасовУказаныВручную			= Ложь;
	ТекДокументОбъект.КурсЗнаменатель					= 1;
	ТекДокументОбъект.КурсЧислитель						= 1;
	
	ТекДокументОбъект.СпособДоставки					= Перечисления.СпособыДоставки.Самовывоз;
	
	ДенежныеСредстваСервер.ПроверитьЗаполнитьБанковскийСчетОрганизацииПоВладельцу(ТекДокументОбъект.Организация, ТекДокументОбъект.БанковскийСчетОрганизации, , ТекДокументОбъект.НаправлениеДеятельности);
	ДенежныеСредстваСервер.ПроверитьЗаполнитьКассуОрганизацииПоВладельцу(ТекДокументОбъект.Организация, ТекДокументОбъект.Касса, ТекДокументОбъект.ФормаОплаты, ТекДокументОбъект.НаправлениеДеятельности);
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ТекДокументОбъект);
	
	// ГруппаФинансовогоУчета
	Если ЗначениеЗаполнено(ТекДокументОбъект.Договор) Тогда
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекДокументОбъект.Договор, "ГруппаФинансовогоУчета");
		Если ЗначениеЗаполнено(РеквизитыДоговора.ГруппаФинансовогоУчета) Тогда
			ТекДокументОбъект.ГруппаФинансовогоУчета = РеквизитыДоговора.ГруппаФинансовогоУчета;
		КонецЕсли;
	КонецЕсли;
	
	// Автоопределение значения налогообложения НДС.
	ТекДокументОбъект.НалогообложениеНДС	= ?(СтруктураПараметров.Свойство("НалогообложениеНДС"), СтруктураПараметров.НалогообложениеНДС, Неопределено);
	
	//БанковскийСчетКонтрагента
	//БанковскийСчетГрузоотправителя
	//БанковскийСчетГрузополучателя
	//Грузоотправитель
	//Грузополучатель
	
	//Касса
	
	//КартаЛояльности
	//Основание
	
	//ДоверенностьВыдана
	//ДоверенностьДата
	//ДоверенностьЛицо
	//ДоверенностьНомер
	
	//ЗаказКлиента
	//СуммаДокумента
	//СуммаВзаиморасчетов
	//ФормаОплаты
	
	//АдресДоставки
	//ЗонаДоставки
	//АдресДоставкиЗначенияПолей
	//ПеревозчикПартнер
	//ВремяДоставкиС
	//ВремяДоставкиПо
	//АдресДоставкиПеревозчика
	//АдресДоставкиПеревозчикаЗначенияПолей
	//ДополнительнаяИнформацияПоДоставке
	//КонтактноеЛицо
	//ОсобыеУсловияПеревозки
	//ОсобыеУсловияПеревозкиОписание
	
	//ОснованиеДата
	//ОснованиеНомер
	//ДопоставкаПоРеализации
	//ДатаПереходаПраваСобственности
	//НаправлениеДеятельности
	//ЕстьМаркируемаяПродукцияГИСМ
	//УдалитьЕстьАлкогольнаяПродукцияДляРеализацииРозницаЕГАИС
	//СуммаВзаиморасчетовПоТаре
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.СкидкиНаценки.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
	ТекДокументОбъект.РасшифровкаПлатежа.Очистить();
	ТекДокументОбъект.Серии.Очистить();
	ТекДокументОбъект.ЭтапыГрафикаОплаты.Очистить();
	ТекДокументОбъект.ШтрихкодыУпаковок.Очистить();
	
	//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	Если НЕ ТекДокументПеремещения = Неопределено Тогда
		
		питОрганизацияПеремещенияДляРеализации = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питОрганизацияПеремещенияДляРеализации");
		Если питОрганизацияПеремещенияДляРеализации = Перечисления.питОрганизацииПеремещенияДляРеализации.ОрганизацияПроизводства Тогда
			ОрганизацияПеремещения = ДокументВыпускБлюд.Организация;
		Иначе
			ОрганизацияПеремещения = ОрганизацияКассыККМ;
		КонецЕсли;
		
		// Заполнение шапки.
		Если ИмяДокументаПеремещения = "ДвижениеПродукцииИМатериалов" Тогда
			ЗаполнитьШапкуДвиженияПродукцииИМатериаловПоВыпускуБлюд(ТекДокументПеремещения, ДокументВыпускБлюд, СтруктураПараметров, БазовоеСмещениеДокументаПеремещения, ОрганизацияПеремещения, Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой);
			ОчиститьТабличныеЧастиДвиженияПродукцииИМатериалов(ТекДокументПеремещения);
		Иначе
			ЗаполнитьШапкуПеремещенияТоваровПоВыпускуБлюд(ТекДокументПеремещения, ДокументВыпускБлюд, СтруктураПараметров, БазовоеСмещениеДокументаПеремещения, ОрганизацияПеремещения);
			ОчиститьТабличныеЧастиПеремещенияТоваров(ТекДокументПеремещения);
		КонецЕсли;
		
	КонецЕсли;
	//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	
	// Получение данных по табличной части "Ингредиенты" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питВыпускБлюдТовары.Номенклатура КАК Номенклатура,
	|	питВыпускБлюдТовары.Характеристика КАК Характеристика,
	|	питВыпускБлюдТовары.Серия КАК Серия,
	|	питВыпускБлюдТовары.Назначение КАК Назначение,
	|	питВыпускБлюдТовары.Упаковка КАК Упаковка,
	|	питВыпускБлюдТовары.Количество КАК Количество,
	|	питВыпускБлюдТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	питВыпускБлюдТовары.Цена КАК Цена,
	|	питВыпускБлюдТовары.Сумма КАК Сумма,
	|	питВыпускБлюдТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	питВыпускБлюдТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	питВыпускБлюдТовары.СтавкаНДС КАК СтавкаНДС,
	|	питВыпускБлюдТовары.СуммаНДС КАК СуммаНДС,
	|	НоменклатураСпр.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
	|	НоменклатураСпр.ТипНоменклатуры КАК ТипНоменклатуры
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО питВыпускБлюдТовары.Номенклатура = НоменклатураСпр.Ссылка
	|ГДЕ
	|	питВыпускБлюдТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдНачислениеБонусныхБаллов.Партнер КАК Партнер,
	|	питВыпускБлюдНачислениеБонусныхБаллов.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	питВыпускБлюдНачислениеБонусныхБаллов.СуммаБонусныхБаллов КАК СуммаБонусныхБаллов,
	|	питВыпускБлюдНачислениеБонусныхБаллов.ДатаНачисления КАК ДатаНачисления,
	|	питВыпускБлюдНачислениеБонусныхБаллов.ДатаСписания КАК ДатаСписания
	|ИЗ
	|	Документ.питВыпускБлюд.НачислениеБонусныхБаллов КАК питВыпускБлюдНачислениеБонусныхБаллов
	|ГДЕ
	|	питВыпускБлюдНачислениеБонусныхБаллов.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	
	СкладскиеТипыНоменклатуры = питОбщегоНазначения.ПолучитьСкладскиеТипыНоменклатуры();
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
	РезультатЗапроса = РезультатЗапросаПакет[0];
	
	ТекущийКлючСвязи = 1;
	
	// Обход таб. части и заполнение таб. частей "Товары".
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовСтрока						= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура			= Выборка.Номенклатура;
		НовСтрока.Характеристика		= Выборка.Характеристика;
		НовСтрока.Серия					= Справочники.СерииНоменклатуры.ПустаяСсылка(); // Заполним по FEFO непосредсвенно перед записью
		НовСтрока.Назначение			= Выборка.Назначение; 
		НовСтрока.Упаковка				= Выборка.Упаковка;
		НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковок;
		НовСтрока.Количество			= Выборка.Количество;
		//ВидЦены
		НовСтрока.Цена					= Выборка.Цена;
		НовСтрока.Сумма					= Выборка.Сумма;
		НовСтрока.СтавкаНДС				= Выборка.СтавкаНДС;
		НовСтрока.СуммаНДС				= Выборка.СуммаНДС;
		НовСтрока.СуммаСНДС				= Выборка.Сумма + ?(ТекДокументОбъект.ЦенаВключаетНДС, 0, Выборка.СуммаНДС);
		НовСтрока.ПроцентРучнойСкидки	= Выборка.ПроцентРучнойСкидки;
		НовСтрока.СуммаРучнойСкидки		= Выборка.СуммаРучнойСкидки;
		НовСтрока.Склад					= ?(ФормироватьДокументыПроизводства22, ДокументВыпускБлюд.СкладПолучатель, ДокументВыпускБлюд.Склад);
		
		НовСтрока.КлючСвязи				= ТекущийКлючСвязи;
		
		//СуммаАвтоматическойСкидки
		//ПроцентАвтоматическойСкидки
		//КодСтроки
		//СуммаВзаиморасчетов
		//ЗаказКлиента
		//СрокПоставки
		//ИдентификаторСтроки
		//НоменклатураНабора
		//ХарактеристикаНабора
		//АналитикаУчетаНаборов
		//КодТНВЭД
		
		//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
		Если НЕ ТекДокументПеремещения = Неопределено Тогда
			
			Если СкладскиеТипыНоменклатуры.Найти(Выборка.ТипНоменклатуры) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НовСтрокаДокПеремещения = ТекДокументПеремещения.Товары.Добавить();
			НовСтрокаДокПеремещения.Номенклатура			= Выборка.Номенклатура;
			НовСтрокаДокПеремещения.Характеристика			= Выборка.Характеристика;
			НовСтрокаДокПеремещения.Серия					= Справочники.СерииНоменклатуры.ПустаяСсылка(); // Заполним по FEFO непосредсвенно перед записью
			НовСтрокаДокПеремещения.Назначение				= Выборка.Назначение;
			НовСтрокаДокПеремещения.НазначениеОтправителя	= Выборка.Назначение;
			НовСтрокаДокПеремещения.КоличествоУпаковок		= Выборка.КоличествоУпаковок;
			НовСтрокаДокПеремещения.Количество				= Выборка.Количество;
			НовСтрокаДокПеремещения.Упаковка				= Выборка.Упаковка;
			
			Если ИмяДокументаПеремещения = "ДвижениеПродукцииИМатериалов" Тогда
				НовСтрокаДокПеремещения.ИдентификаторСтроки		= Новый УникальныйИдентификатор;
				НовСтрокаДокПеремещения.ГруппаПродукции			= Выборка.ГруппаАналитическогоУчета;
			КонецЕсли;
			
		КонецЕсли;
		//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
		
		ТекущийКлючСвязи = ТекущийКлючСвязи + 1;
		
	КонецЦикла;
	
	// Обход таб. части и заполнение таб. частей "НачислениеБонусныхБаллов".
	//РезультатЗапросаБонусныеБаллы = РезультатЗапросаПакет[1];
	//Выборка = РезультатЗапросаБонусныеБаллы.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	
	//	НовСтрока						= ТекДокументОбъект.НачислениеБонусныхБаллов.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
	//	
	//КонецЦикла;
	
	
	//+ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	Если НЕ ТекДокументПеремещения = Неопределено И НЕ(ТекРежимЗаписиДвижениеПродукции = РежимЗаписиДокумента.ОтменаПроведения И ПустаяСтрока(ТекДокументПеремещения.ВерсияДанных)) Тогда
		
		//+Серии
		Если ТекРежимЗаписиДвижениеПродукции <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ЗаполнитьСерииТиповогоДокумента(ТекДокументПеремещения, ДокументВыпускБлюд, 1);
		КонецЕсли;
		//-Серии
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ИсходныйРежимЗаписиДвижениеПродукции	= ТекРежимЗаписиДвижениеПродукции;
			ТекРежимЗаписиДвижениеПродукции			= РежимЗаписиДокумента.Запись;
		КонецЕсли;
		//-ОтложенноеПроведение
		
		Попытка
			ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
				ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
			КонецЕсли;
			ТекДокументПеремещения.Записать(ТекРежимЗаписиДвижениеПродукции);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка записи документа """ + ТекДокументПеремещения.Метаданные().Представление() + """
			| по документу Общепит """+ДокументВыпускБлюд+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписиДвижениеПродукции);
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		КонецЕсли;
		//-ОтложенноеПроведение
		
		//+ОтложенноеПроведение
		ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
		//-ОтложенноеПроведение
		
		// Добавление записи в результирующую таблицу в случае успешной записи документов.
		ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументПеремещения, тблСозданныеДокументы, 1, ТекСинхронизирован);
		
	КонецЕсли;
	
	// Если документ найден, то получаем объект иначе создаем новый.
	ТекДокументПеремещения = Неопределено;
	Если НЕ ВыборкаДокПеремещения = Неопределено И ВыборкаДокПеремещения.Следующий() Тогда
		ТекДокументПеремещения = ВыборкаДокПеремещения.ТиповойДокумент.ПолучитьОбъект();
		
		
		// Определение параметров записи.
		ПараметрыЗаписиДокПеремещения = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументПеремещения.Проведен,ТекДокументПеремещения.ПометкаУдаления, Новый Структура);
		
		// Определение режима записи
		ТекРежимЗаписиДвижениеПродукции = ПараметрыЗаписиДокПеремещения.РежимЗаписи;
		
		Если ПараметрыЗаписиДокПеремещения.НужнаУстановкаПометкиУдаления Тогда
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументПеремещения.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				
				Попытка
					ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
						ТекДокументПеремещения.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
					КонецЕсли;
					ТекДокументПеремещения.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументПеремещения.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//+ОтложенноеПроведение
		ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
		//-ОтложенноеПроведение
		
		// Добавление записи в результирующую таблицу в случае успешной записи документов.
		ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументПеремещения, тблСозданныеДокументы, 1,ТекСинхронизирован);
		
	КонецЕсли;
	//-ДВИЖЕНИЕ ПРОДУКЦИИ И МАТЕРИАЛОВ 22
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	Если НЕ(ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И ПустаяСтрока(ТекДокументОбъект.ВерсияДанных)) Тогда
		
		//+Серии
		Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.РеализацияТоваровУслуг));
			ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументВыпускБлюд);
		КонецЕсли;
		//-Серии
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ИсходныйРежимЗаписи	= ТекРежимЗаписи;
			ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
		КонецЕсли;
		//-ОтложенноеПроведение
		
		Попытка
			//ТекДокументОбъект.ЗаполнитьЭтапыГрафикаОплаты();
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ТекДокументОбъект.Записать(ТекРежимЗаписи);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументВыпускБлюд+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		КонецЕсли;
		//-ОтложенноеПроведение
		
		//+ОтложенноеПроведение
		ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
		//-ОтложенноеПроведение
		
		// Добавление записи в результирующую таблицу в случае успешной записи документов.
		ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "Перемещение товаров" для выпуска с перемещением.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьПеремещениеТоваровПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	//Возврат Истина; // {debug}
	
	//+БазовоеСмещение
	Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
		СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
	КонецЕсли;
	БазовоеСмещение = 0;
	Если СтруктураПараметров.питСмещатьДатыТиповыхДокументов Тогда
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", "ПеремещениеТоваров", 0));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещение = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
	КонецЕсли;
	//-БазовоеСмещение
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Отчет о розничных продажах",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ПеремещениеТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
	|";
	Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
	Иначе
		ТекДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
				КонецЕсли;
				ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	///////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ
	ЗаполнитьШапкуПеремещенияТоваровПоВыпускуБлюд(ТекДокументОбъект, ДокументВыпускБлюд, СтруктураПараметров, БазовоеСмещение);
	ОчиститьТабличныеЧастиПеремещенияТоваров(ТекДокументОбъект);
	
	// Получение данных по табличной части "Ингредиенты" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	
	//>>Швецов. 19.12.2024. Розничные продажи алкоголя
	//Запрос.Текст = "ВЫБРАТЬ
	//|	питВыпускБлюдТовары.Номенклатура,
	//|	питВыпускБлюдТовары.Характеристика,
	//|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия, // Будем по FEFO определять дальше
	//|	питВыпускБлюдТовары.Назначение,
	//|	питВыпускБлюдТовары.Упаковка,
	//|	питВыпускБлюдТовары.Количество,
	//|	питВыпускБлюдТовары.КоличествоУпаковок
	//|ИЗ
	//|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	//|ГДЕ
	//|	питВыпускБлюдТовары.Ссылка = &Ссылка
	//|	И питВыпускБлюдТовары.Номенклатура.ТипНоменклатуры В (&СкладскиеТипыНоменклатуры)";
	
	Запрос.Текст = "ВЫБРАТЬ
		|	питВыпускБлюдТовары.Номенклатура КАК Номенклатура,
		|	питВыпускБлюдТовары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА питВыпускБлюдТовары.Номенклатура.АлкогольнаяПродукция
		|				И НЕ питВыпускБлюдТовары.Номенклатура.АлкогольнаяПродукцияВоВскрытойТаре
		|			ТОГДА питВыпускБлюдТовары.Серия
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК Серия,
		|	питВыпускБлюдТовары.Назначение КАК Назначение,
		|	питВыпускБлюдТовары.Упаковка КАК Упаковка,
		|	питВыпускБлюдТовары.Количество КАК Количество,
		|	питВыпускБлюдТовары.КоличествоУпаковок КАК КоличествоУпаковок
		|ИЗ
		|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
		|ГДЕ
		|	питВыпускБлюдТовары.Ссылка = &Ссылка
		|	И питВыпускБлюдТовары.Номенклатура.ТипНоменклатуры В(&СкладскиеТипыНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	питВыпускБлюдТоварыСерии.Серия КАК Серия,
		|	питВыпускБлюдТоварыСерии.Количество КАК Количество,
		|	питВыпускБлюдТоварыСерии.Номенклатура КАК Номенклатура,
		|	питВыпускБлюдТоварыСерии.Характеристика КАК Характеристика,
		|	питВыпускБлюдТоварыСерии.Назначение КАК Назначение
		|ИЗ
		|	Документ.питВыпускБлюд.ТоварыСерии КАК питВыпускБлюдТоварыСерии
		|ГДЕ
		|	питВыпускБлюдТоварыСерии.Ссылка = &Ссылка
		|	И питВыпускБлюдТоварыСерии.Номенклатура.ТипНоменклатуры В(&СкладскиеТипыНоменклатуры)
		|;";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	
	СкладскиеТипыНоменклатуры = питОбщегоНазначения.ПолучитьСкладскиеТипыНоменклатуры();
	Запрос.УстановитьПараметр("СкладскиеТипыНоменклатуры", СкладскиеТипыНоменклатуры);
	
	// Обход таб. части и заполнение таб. частей "Товары" документа "Передача материалов в производство".
	//Выборка = Запрос.Выполнить().Выбрать();
	
	Пакет = Запрос.ВыполнитьПакет();
	ВыборкаТовары = Пакет[0].Выбрать();
	ВыборкаСерии = Пакет[1].Выбрать();
	
	Пока ВыборкаТовары.Следующий() Цикл
		
		НовСтрока						= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура			= ВыборкаТовары.Номенклатура;
		НовСтрока.Характеристика		= ВыборкаТовары.Характеристика;
		НовСтрока.Серия					= ВыборкаТовары.Серия;
		НовСтрока.Назначение			= ВыборкаТовары.Назначение;
		НовСтрока.Упаковка				= ВыборкаТовары.Упаковка;
		НовСтрока.КоличествоУпаковок	= ВыборкаТовары.КоличествоУпаковок;
		НовСтрока.Количество			= ВыборкаТовары.Количество;
		
	КонецЦикла;
	
	Если ВыборкаСерии.Количество() <> 0 Тогда
		Пока ВыборкаСерии.Следующий() Цикл
			
			НовСтрокаСерии						= ТекДокументОбъект.Серии.Добавить();
			НовСтрокаСерии.Номенклатура			= ВыборкаСерии.Номенклатура;
			НовСтрокаСерии.Характеристика		= ВыборкаСерии.Характеристика;
			НовСтрокаСерии.Серия				= ВыборкаСерии.Серия;
			НовСтрокаСерии.Назначение			= ВыборкаСерии.Назначение;
			НовСтрокаСерии.Количество			= ВыборкаСерии.Количество;
			
		КонецЦикла;
	КонецЕсли;		
	//<<Швецов. 19.12.2024. Розничные продажи алкоголя

	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ИсходныйРежимЗаписи	= ТекРежимЗаписи;
		ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Попытка
		
		//+Серии
		Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументВыпускБлюд);
		КонецЕсли;
		//-Серии
		
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
		КонецЕсли;
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументВыпускБлюд+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//+ОтложенноеПроведение
	ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
	//-ОтложенноеПроведение
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "Перемещение товаров" для выпуска с перемещением.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьПеремещениеИзКладовойПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	//Возврат Истина; // {debug}
	
	//+БазовоеСмещение
	Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
		СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
	КонецЕсли;
	БазовоеСмещение = 0;
	Если СтруктураПараметров.питСмещатьДатыТиповыхДокументов Тогда
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", "ДвижениеПродукцииИМатериалов", 3));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещение = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
	КонецЕсли;
	//-БазовоеСмещение
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа,
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|	И питТиповыеДокументы.ПричинаТиповогоДокумента = 3
	|";
	Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
	Иначе
		ТекДокументОбъект = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
				КонецЕсли;
				ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	ТекДокументОбъект.Дата							= ДокументВыпускБлюд.Дата 
	+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0)
	- БазовоеСмещение;
	ТекДокументОбъект.Организация					= ДокументВыпускБлюд.Организация;
	ТекДокументОбъект.Отправитель					= ДокументВыпускБлюд.Склад;
	ТекДокументОбъект.Получатель					= ДокументВыпускБлюд.СкладПолучатель;
	ТекДокументОбъект.Ответственный					= ДокументВыпускБлюд.Ответственный;
	ТекДокументОбъект.Комментарий					= ДокументВыпускБлюд.Комментарий;
	ТекДокументОбъект.Статус						= Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	ТекДокументОбъект.ХозяйственнаяОперация			= Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой;
	ТекДокументОбъект.НаправлениеДеятельности		= ДокументВыпускБлюд.НаправлениеДеятельности;
	//+25
	ТекДокументОбъект.Валюта						= ?(ЗначениеЗаполнено(ДокументВыпускБлюд.Валюта), ДокументВыпускБлюд.Валюта, Константы.ВалютаРегламентированногоУчета.Получить());
	ТекДокументОбъект.ВариантПриемкиТоваров			= Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	//-25
	
	// Автоопределение значения налогообложения НДС.
	ТекДокументОбъект.НалогообложениеНДС	= ?(СтруктураПараметров.Свойство("НалогообложениеНДС"), СтруктураПараметров.НалогообложениеНДС, Неопределено);
	
	// Очистка табличных частей для избежания дублирования информации.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.Серии.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
	
	// Получение данных по табличной части "Ингредиенты" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питВыпускБлюдТовары.Номенклатура,
	|	питВыпускБлюдТовары.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия, // Будем по FEFO определять дальше
	|	питВыпускБлюдТовары.Назначение,
	|	питВыпускБлюдТовары.Упаковка,
	|	питВыпускБлюдТовары.Количество,
	|	питВыпускБлюдТовары.КоличествоУпаковок
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	|ГДЕ
	|	питВыпускБлюдТовары.Ссылка = &Ссылка
	|	И питВыпускБлюдТовары.Номенклатура.ТипНоменклатуры В (&СкладскиеТипыНоменклатуры)";
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	
	СкладскиеТипыНоменклатуры = питОбщегоНазначения.ПолучитьСкладскиеТипыНоменклатуры();
	Запрос.УстановитьПараметр("СкладскиеТипыНоменклатуры", СкладскиеТипыНоменклатуры);
	
	// Обход таб. части и заполнение таб. частей "Товары" документа "Передача материалов в производство".
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовСтрока						= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура			= Выборка.Номенклатура;
		НовСтрока.Характеристика		= Выборка.Характеристика;
		НовСтрока.Серия					= Справочники.СерииНоменклатуры.ПустаяСсылка(); // Серии заполнятся по FEFO позже
		НовСтрока.Назначение			= Выборка.Назначение;
		НовСтрока.НазначениеОтправителя	= Выборка.Назначение;
		НовСтрока.Упаковка				= Выборка.Упаковка;
		НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковок;
		НовСтрока.Количество			= Выборка.Количество;    
		НовСтрока.ИдентификаторСтроки	= Новый УникальныйИдентификатор;
		
	КонецЦикла;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ИсходныйРежимЗаписи	= ТекРежимЗаписи;
		ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Попытка
		
		//+Серии
		Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументВыпускБлюд, 3);
		КонецЕсли;
		//-Серии
		
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		Если ЗначениеЗаполнено(ДокументВыпускБлюд.ДокументОснование) И ТипЗнч(ДокументВыпускБлюд.ДокументОснование) = Тип("ДокументСсылка.питПланМеню") Тогда
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументВыпускБлюд);
		КонецЕсли;
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументВыпускБлюд+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//+ОтложенноеПроведение
	ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
	//-ОтложенноеПроведение
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы, 3, ТекСинхронизирован);
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "Отчет о розничных продажах" для выпуска с розничной реализацией.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьВнутреннееПотреблениеТоваровПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	ИмяДокументаВнутреннееПотребление = питОбратнаяСовместимостьПовтИсп.ИмяДокументаВнутреннееПотребление();
	
	//+БазовоеСмещение
	Если НЕ СтруктураПараметров.Свойство("питСмещатьДатыТиповыхДокументов") Тогда
		СтруктураПараметров.Вставить("питСмещатьДатыТиповыхДокументов", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питСмещатьДатыТиповыхДокументов"));
	КонецЕсли;
	БазовоеСмещение = 0;
	Если СтруктураПараметров.питСмещатьДатыТиповыхДокументов Тогда
		СтрокиСмещение = СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд.НайтиСтроки(
		Новый Структура("ИмяТиповогоДокумента,ПричинаТиповогоДокумента", ИмяДокументаВнутреннееПотребление, 0));
		Если СтрокиСмещение.Количество() Тогда
			БазовоеСмещение = СтрокиСмещение[0].БазовоеСмещение;
		КонецЕсли;
	КонецЕсли;
	//-БазовоеСмещение
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Списание недостач товаров",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ВнутреннееПотребление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ВнутреннееПотребление", СтрШаблон("Документ.%1", ИмяДокументаВнутреннееПотребление));
	Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
		ЭтоНовый = Ложь;
	Иначе
		ЭтоНовый = Истина;
		ТекДокументОбъект = Документы[ИмяДокументаВнутреннееПотребление].СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен,ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	// Для нового дока отменять проведения не требуется.
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И ЭтоНовый Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	ТекДокументОбъект.Дата								= ДокументВыпускБлюд.Дата 
	+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0)
	- БазовоеСмещение;
	ТекДокументОбъект.Организация						= ДокументВыпускБлюд.Организация;
	ТекДокументОбъект.Склад								= ДокументВыпускБлюд.Склад;
	ТекДокументОбъект.Подразделение						= ДокументВыпускБлюд.Подразделение;
	ТекДокументОбъект.Ответственный						= ДокументВыпускБлюд.Ответственный;
	ТекДокументОбъект.Комментарий						= ДокументВыпускБлюд.Комментарий;
	//+25
	//ТекДокументОбъект.ДатаРаспоряжения					= КонецДня(ДокументВыпускБлюд.Дата);
	//-25
	ТекДокументОбъект.ВидЦены							= ДокументВыпускБлюд.ТипЦен;
	ТекДокументОбъект.ХозяйственнаяОперация				= Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	ТекДокументОбъект.НаправлениеДеятельности			= ДокументВыпускБлюд.НаправлениеДеятельности;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.Серии.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить(); 
	
	// << MRS #VINE-142 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 15.07.25, (Заполнение алкогольной лицензии по умолчанию)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алкЛицензии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.алкЛицензии КАК алкЛицензии
		|ГДЕ
		|	&ДатаДокумента МЕЖДУ алкЛицензии.ДатаНачалаСрокаДействия И алкЛицензии.ДатаОкончанияСрокаДействия
		|	И алкЛицензии.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", ТекДокументОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаДокумента", ТекДокументОбъект.Дата);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТекДокументОбъект.алкЛицензияОрганизации = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	// >> MRS #VINE-142 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 15.07.25, (Заполнение алкогольной лицензии по умолчанию)
	
	// Получение данных по табличной части "Товары" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	
	//>>Швецов. 19.12.2024. Розничные продажи алкоголя
	//Запрос.Текст = "ВЫБРАТЬ
	//|	питВыпускБлюдТовары.Номенклатура,
	//|	питВыпускБлюдТовары.Характеристика,
	//|	питВыпускБлюдТовары.Серия КАК Серия,
	//|	питВыпускБлюдТовары.Назначение,
	//|	питВыпускБлюдТовары.Упаковка,
	//|	питВыпускБлюдТовары.КоличествоУпаковок,
	//|	питВыпускБлюдТовары.Количество
	//|ИЗ
	//|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	//|ГДЕ
	//|	питВыпускБлюдТовары.Ссылка = &Ссылка
	//|	И питВыпускБлюдТовары.Номенклатура.ТипНоменклатуры В (&СкладскиеТипыНоменклатуры)";
	
	Запрос.Текст = "ВЫБРАТЬ
		|	питВыпускБлюдТовары.Номенклатура КАК Номенклатура,
		|	питВыпускБлюдТовары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА питВыпускБлюдТовары.Номенклатура.АлкогольнаяПродукция
		|				И НЕ питВыпускБлюдТовары.Номенклатура.АлкогольнаяПродукцияВоВскрытойТаре
		|			ТОГДА питВыпускБлюдТовары.Серия
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК Серия,
		|	питВыпускБлюдТовары.Назначение КАК Назначение,
		|	питВыпускБлюдТовары.Упаковка КАК Упаковка,
		|	питВыпускБлюдТовары.Количество КАК Количество,
		|	питВыпускБлюдТовары.КоличествоУпаковок КАК КоличествоУпаковок
		|ИЗ
		|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
		|ГДЕ
		|	питВыпускБлюдТовары.Ссылка = &Ссылка
		|	И питВыпускБлюдТовары.Номенклатура.ТипНоменклатуры В(&СкладскиеТипыНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	питВыпускБлюдТоварыСерии.Серия КАК Серия,
		|	питВыпускБлюдТоварыСерии.Количество КАК Количество,
		|	питВыпускБлюдТоварыСерии.Номенклатура КАК Номенклатура,
		|	питВыпускБлюдТоварыСерии.Характеристика КАК Характеристика,
		|	питВыпускБлюдТоварыСерии.Назначение КАК Назначение
		|ИЗ
		|	Документ.питВыпускБлюд.ТоварыСерии КАК питВыпускБлюдТоварыСерии
		|ГДЕ
		|	питВыпускБлюдТоварыСерии.Ссылка = &Ссылка
		|	И питВыпускБлюдТоварыСерии.Номенклатура.ТипНоменклатуры В(&СкладскиеТипыНоменклатуры)
		|;";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюд.Ссылка);
	
	СкладскиеТипыНоменклатуры = питОбщегоНазначения.ПолучитьСкладскиеТипыНоменклатуры();
	Запрос.УстановитьПараметр("СкладскиеТипыНоменклатуры", СкладскиеТипыНоменклатуры);
	
	// Обход таб. части и заполнение таб. частей "Товары" документа "Передача материалов в производство".
	//Выборка = Запрос.Выполнить().Выбрать();
	
	Пакет = Запрос.ВыполнитьПакет();
	ВыборкаТовары = Пакет[0].Выбрать();
	ВыборкаСерии = Пакет[1].Выбрать();
	
	// << MRS #ERP-5519 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 20.11.25, ()
	ПричинаСписания = Справочники.MRS_ПричиныСписания.ПустаяСсылка();
	//Если ДокументВыпускБлюд.ПЛ_ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.питХозяйственныеОперации.ПЛ_ЗаборныйЛист") Тогда
		ПричинаСписания = MRS_СлужебныеПараметрыПовтИсп.ПолучитьЗначение("ПричинаСписанияДляСозданияВП_из_ЗаборногоЛиста","Значение");
	//КонецЕсли;
	// >> MRS #ERP-5519 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 20.11.25, ()

	Пока ВыборкаТовары.Следующий() Цикл
		
		НовСтрока						= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура			= ВыборкаТовары.Номенклатура;
		НовСтрока.Характеристика		= ВыборкаТовары.Характеристика;
		НовСтрока.Серия					= ВыборкаТовары.Серия;
		НовСтрока.Назначение			= ВыборкаТовары.Назначение;
		НовСтрока.Упаковка				= ВыборкаТовары.Упаковка;
		НовСтрока.КоличествоУпаковок	= ВыборкаТовары.КоличествоУпаковок;
		НовСтрока.Количество			= ВыборкаТовары.Количество;
		НовСтрока.СтатьяРасходов		= ДокументВыпускБлюд.СтатьяРасходов;
		// << MRS #ERP-5519 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 20.11.25, ()
		НовСтрока.MRS_ПричиныСписания = ПричинаСписания;
		// >> MRS #ERP-5519 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 20.11.25, ()
	КонецЦикла;
	
	Если ВыборкаСерии.Количество() <> 0 Тогда 
		Пока ВыборкаСерии.Следующий() Цикл
			
			НовСтрокаСерии						= ТекДокументОбъект.Серии.Добавить();
			НовСтрокаСерии.Номенклатура			= ВыборкаСерии.Номенклатура;
			НовСтрокаСерии.Характеристика		= ВыборкаСерии.Характеристика;
			НовСтрокаСерии.Серия				= ВыборкаСерии.Серия;
			НовСтрокаСерии.Назначение			= ВыборкаСерии.Назначение;
			НовСтрокаСерии.Количество			= ВыборкаСерии.Количество;
			
		КонецЦикла;
	КонецЕсли;	
	//<<Швецов. 19.12.2024. Розничные продажи алкоголя
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ИсходныйРежимЗаписи	= ТекРежимЗаписи;
		ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Попытка
		
		//+Серии
		Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументВыпускБлюд);
		КонецЕсли;
		//-Серии
		
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументВыпускБлюд+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//+ОтложенноеПроведение
	ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
	//-ОтложенноеПроведение
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы,,ТекСинхронизирован);
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "Корректировка остатков ИС" для выпуска блюд.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьКорректировкуОстатковИСПоВыпускуБлюд(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	ДокументВыпускБлюдСсылка = ДокументВыпускБлюд;
	Если ТипЗнч(ДокументВыпускБлюд) = Тип("ДокументОбъект.питВыпускБлюд") Тогда
		ДокументВыпускБлюдСсылка = ДокументВыпускБлюд.Ссылка;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа 
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент КАК ТиповойДокумент
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.питКорректировкаОстатковИС";
	Запрос.УстановитьПараметр("Документпит", ДокументВыпускБлюдСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
	Иначе
		// для реализаций создаем только для модификаторов бизнес-ланчей
		ТекДокументОбъект = Документы.питКорректировкаОстатковИС.СоздатьДокумент();
		ТекДокументОбъект.Заполнить(Неопределено);
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(
		ДокументВыпускБлюд.Проведен, 
		ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,
		ТекДокументОбъект.ПометкаУдаления,
		СтруктураПараметров);
		
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	// Возможно изменили политику списания, тогда документ более не актуальный.
	СпособСписанияМарок = Константы.питСписаниеМарокИСПриПроизводстве.Получить();
	Если НЕ ЗначениеЗаполнено(СпособСписанияМарок)
		ИЛИ СпособСписанияМарок = Перечисления.питСпособыСписанияМарокИСПриПроизводстве.НеИспользовать
		ИЛИ СпособСписанияМарок = Перечисления.питСпособыСписанияМарокИСПриПроизводстве.ИсключатьЦелевыеДокументы
		И РегистрыСведений.питУчетДанныхПродаж.ЭтоЦелевойДокумент(ДокументВыпускБлюдСсылка) Тогда
		
		Если НЕ ТекДокументОбъект.ЭтоНовый() Тогда
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, 
				ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), 
					ТекДокументОбъект.Ссылка, 
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,
					ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = 
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				Попытка
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюдСсылка+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	//УстановкаПометкиУдаления
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Если НЕ ТекДокументОбъект.ЭтоНовый() Тогда
		
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, 
					ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), 
					ТекДокументОбъект.Ссылка, 
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,
					ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = 
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				Попытка
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
		
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюд.Дата КАК Дата,
	|	питВыпускБлюд.Ответственный КАК Автор,
	|	питВыпускБлюд.Организация КАК Организация,
	|	питВыпускБлюд.Подразделение КАК Подразделение,
	|	питВыпускБлюд.Склад КАК Склад,
	|	питВыпускБлюд.Комментарий КАК Комментарий,
	|	ЕСТЬNULL(питПараметрыСкладовОбщепита.КонтролироватьОстаткиМарокИСПриПроведении, ЛОЖЬ) КАК КонтролироватьОстаткиМарокИСПриПроведении
	|ИЗ
	|	Документ.питВыпускБлюд КАК питВыпускБлюд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.питПараметрыСкладовОбщепита КАК питПараметрыСкладовОбщепита
	|		ПО питВыпускБлюд.Склад = питПараметрыСкладовОбщепита.Склад
	|ГДЕ
	|	питВыпускБлюд.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюдСсылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДокументВыпускБлюдДанные = РезультатЗапроса[0].Выбрать();
	ДокументВыпускБлюдДанные.Следующий();
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	ТекДокументОбъект.Дата = ДокументВыпускБлюдДанные.Дата + 
		?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.Организация = ДокументВыпускБлюдДанные.Организация;
	ТекДокументОбъект.Склад = ДокументВыпускБлюдДанные.Склад;
	ТекДокументОбъект.ДокументОснование = ДокументВыпускБлюдСсылка;
	ТекДокументОбъект.Комментарий = ДокументВыпускБлюдДанные.Комментарий;
	ТекДокументОбъект.Автор = ДокументВыпускБлюдДанные.Автор;
	ТекДокументОбъект.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.КорректировкаОстатковИСПриготовление;
	ТекДокументОбъект.Подразделение = ДокументВыпускБлюдДанные.Подразделение;
	
	Если Константы.питИспользоватьМаркиИСКассовыхСистемПриПроизводстве.Получить() Тогда
		ДоступныеМестаПечати = Справочники.питМестаПечати.МестаПечатиПоСтруктурнойЕдинице(ТекДокументОбъект.Склад);
	Иначе
		ДоступныеМестаПечати = Новый Массив;
	КонецЕсли;
	ДоступныеМестаПечати.Добавить(ТекДокументОбъект.Склад);
	
	Запрос = Новый Запрос;
	ТекстЗапроса ="ВЫБРАТЬ
	              |	втИнгредиенты.Ингредиент КАК Номенклатура,
	              |	втИнгредиенты.ИдентификаторБлюда КАК ИдентификаторБлюда,
	              |	СУММА(втИнгредиенты.КоличествоИнгредиентаФакт) КАК Количество,
	              |	втИнгредиенты.УпаковкаИнгредиента КАК УпаковкаИнгредиента
	              |ПОМЕСТИТЬ ВТ_Производство
	              |ИЗ
	              |	Документ.питВыпускБлюд.Ингредиенты КАК втИнгредиенты
	              |ГДЕ
	              |	втИнгредиенты.Ссылка = &ДокументВыпуска
	              |	И НЕ втИнгредиенты.ИзАвтопеределов
	              |	И НЕ втИнгредиенты.Ингредиент.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	              |	И втИнгредиенты.Ингредиент.ТипНоменклатуры В(&СкладскиеТипыНоменклатуры)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	втИнгредиенты.Ингредиент,
	              |	втИнгредиенты.ИдентификаторБлюда,
	              |	втИнгредиенты.УпаковкаИнгредиента
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ_Производство.Номенклатура КАК Номенклатура,
	              |	СУММА(ВТ_Производство.Количество) КАК Количество,
	              |	ВТ_Производство.УпаковкаИнгредиента КАК УпаковкаИнгредиента
	              |ПОМЕСТИТЬ ВТ_МаркируемыеТовары
	              |ИЗ
	              |	ВТ_Производство КАК ВТ_Производство
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	              |		ПО ВТ_Производство.Номенклатура = СпрНоменклатура.Ссылка
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд.Блюда КАК ТЧПродукция
	              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатураБлюда
	              |			ПО ТЧПродукция.Номенклатура = СпрНоменклатураБлюда.Ссылка
	              |		ПО (ТЧПродукция.Ссылка = &ДокументВыпуска)
	              |			И ВТ_Производство.ИдентификаторБлюда = ТЧПродукция.ИдентификаторСтроки
	              |ГДЕ
	              |	СпрНоменклатура.ОсобенностьУчета В(&ОсобенностиУчетаДоступныеДляОтраженияОстатковИС)
	              |	И НЕ ЕСТЬNULL(СпрНоменклатураБлюда.питПродажаВРозлив, ИСТИНА)
	              |	И ТЧПродукция.Ссылка = &ДокументВыпуска
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВТ_Производство.Номенклатура,
	              |	ВТ_Производство.УпаковкаИнгредиента
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	МАКСИМУМ(ОстаткиМарокИС.Период) КАК Период,
	              |	ОстаткиМарокИС.Организация КАК Организация,
	              |	ОстаткиМарокИС.МестоПечати КАК МестоПечати,
	              |	ОстаткиМарокИС.Номенклатура КАК Номенклатура,
	              |	ВТ_МаркируемыеТовары.УпаковкаИнгредиента КАК УпаковкаИнгредиента
	              |ПОМЕСТИТЬ ВТ_ПоследниеМарки
	              |ИЗ
	              |	ВТ_МаркируемыеТовары КАК ВТ_МаркируемыеТовары
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.питОстаткиМарокИС КАК ОстаткиМарокИС
	              |		ПО ВТ_МаркируемыеТовары.Номенклатура = ОстаткиМарокИС.Номенклатура
	              |ГДЕ
	              |	НЕ &КонтролироватьОстаткиМарокИС
	              |	И ОстаткиМарокИС.Период <= &Период
	              |	И ОстаткиМарокИС.Период >= &НачалоПериода
	              |	И ОстаткиМарокИС.Организация = &Организация
	              |	И ОстаткиМарокИС.МестоПечати В(&МестаПечати)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ОстаткиМарокИС.Организация,
	              |	ОстаткиМарокИС.МестоПечати,
	              |	ОстаткиМарокИС.Номенклатура,
	              |	ВТ_МаркируемыеТовары.УпаковкаИнгредиента
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ОстаткиМарокИСОстатки.Организация КАК Организация,
	              |	ОстаткиМарокИСОстатки.МестоПечати КАК МестоПечати,
	              |	ОстаткиМарокИСОстатки.Номенклатура КАК Номенклатура,
	              |	ОстаткиМарокИСОстатки.Штрихкод КАК Штрихкод,
	              |	ОстаткиМарокИСОстатки.КоличествоОстаток КАК КоличествоОстаток,
	              |	0 КАК Приоритет
	              |ПОМЕСТИТЬ ВТ_ДоступныеМарки
	              |ИЗ
	              |	РегистрНакопления.питОстаткиМарокИС.Остатки(
	              |			&МоментКонтроля,
	              |			Организация = &Организация
	              |				И МестоПечати В (&МестаПечати)
	              |				И Номенклатура В
	              |					(ВЫБРАТЬ
	              |						ВТ_МаркируемыеТовары.Номенклатура КАК Номенклатура
	              |					ИЗ
	              |						ВТ_МаркируемыеТовары КАК ВТ_МаркируемыеТовары)) КАК ОстаткиМарокИСОстатки
	              |ГДЕ
	              |	ОстаткиМарокИСОстатки.КоличествоОстаток > 0
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	ВТ_ПоследниеМарки.Организация,
	              |	ВТ_ПоследниеМарки.МестоПечати,
	              |	ВТ_ПоследниеМарки.Номенклатура,
	              |	МАКСИМУМ(ОстаткиМарокИС.Штрихкод),
	              |	0,
	              |	1
	              |ИЗ
	              |	ВТ_ПоследниеМарки КАК ВТ_ПоследниеМарки
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.питОстаткиМарокИС КАК ОстаткиМарокИС
	              |		ПО ВТ_ПоследниеМарки.Период = ОстаткиМарокИС.Период
	              |			И ВТ_ПоследниеМарки.Организация = ОстаткиМарокИС.Организация
	              |			И ВТ_ПоследниеМарки.МестоПечати = ОстаткиМарокИС.МестоПечати
	              |			И ВТ_ПоследниеМарки.Номенклатура = ОстаткиМарокИС.Номенклатура
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВТ_ПоследниеМарки.Организация,
	              |	ВТ_ПоследниеМарки.МестоПечати,
	              |	ВТ_ПоследниеМарки.Номенклатура
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	ОстаткиМарокИС.Организация,
	              |	ОстаткиМарокИС.МестоПечати,
	              |	ОстаткиМарокИС.Номенклатура,
	              |	ОстаткиМарокИС.Штрихкод,
	              |	ВЫБОР
	              |		КОГДА ОстаткиМарокИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	              |			ТОГДА ОстаткиМарокИС.Количество
	              |		ИНАЧЕ -ОстаткиМарокИС.Количество
	              |	КОНЕЦ,
	              |	0
	              |ИЗ
	              |	РегистрНакопления.питОстаткиМарокИС КАК ОстаткиМарокИС
	              |ГДЕ
	              |	ОстаткиМарокИС.Регистратор = &ДокументКорректировки
	              |	И ОстаткиМарокИС.Период <= &Период
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ_ИтоговаяТаблица.Организация КАК Организация,
	              |	ВТ_ИтоговаяТаблица.МестоПечати КАК МестоПечати,
	              |	ВТ_ИтоговаяТаблица.Номенклатура КАК Номенклатура,
	              |	ВТ_ИтоговаяТаблица.Штрихкод КАК Штрихкод,
	              |	СУММА(ВТ_ИтоговаяТаблица.КоличествоОстаток) КАК КоличествоОстаток,
	              |	ВТ_ИтоговаяТаблица.Приоритет КАК Приоритет
	              |ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	              |ИЗ
	              |	ВТ_ДоступныеМарки КАК ВТ_ИтоговаяТаблица
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВТ_ИтоговаяТаблица.Организация,
	              |	ВТ_ИтоговаяТаблица.МестоПечати,
	              |	ВТ_ИтоговаяТаблица.Номенклатура,
	              |	ВТ_ИтоговаяТаблица.Штрихкод,
	              |	ВТ_ИтоговаяТаблица.Приоритет
	              |
	              |ИМЕЮЩИЕ
	              |	СУММА(ВТ_ИтоговаяТаблица.КоличествоОстаток) > 0
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЕСТЬNULL(ВТ_ИтоговаяТаблица.МестоПечати, &СтруктурнаяЕдиница) КАК МестоПечати,
	              |	ВТ_МаркируемыеТовары.Номенклатура КАК Номенклатура,
	              |	ВТ_МаркируемыеТовары.Количество КАК Количество,
	              |	ЕСТЬNULL(ВТ_ИтоговаяТаблица.Штрихкод, НЕОПРЕДЕЛЕНО) КАК ШтрихкодУпаковки,
	              |	ЕСТЬNULL(ВТ_ИтоговаяТаблица.КоличествоОстаток, 0) КАК КоличествоОстаток,
	              |	ЕСТЬNULL(ВТ_ИтоговаяТаблица.Приоритет, 0) КАК Приоритет,
	              |	ВЫБОР
	              |		КОГДА ЕСТЬNULL(ВТ_ИтоговаяТаблица.МестоПечати, &СтруктурнаяЕдиница) = &СтруктурнаяЕдиница
	              |			ТОГДА 0
	              |		ИНАЧЕ 1
	              |	КОНЕЦ КАК ПриоритетПоМестуПечати,
	              |	ВТ_МаркируемыеТовары.УпаковкаИнгредиента КАК УпаковкаИнгредиента
	              |ИЗ
	              |	ВТ_МаркируемыеТовары КАК ВТ_МаркируемыеТовары
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	              |		ПО ВТ_МаркируемыеТовары.Номенклатура = ВТ_ИтоговаяТаблица.Номенклатура
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Номенклатура,
	              |	ПриоритетПоМестуПечати,
	              |	Приоритет,
	              |	КоличествоОстаток
	              |ИТОГИ
	              |	МАКСИМУМ(Количество)
	              |ПО
	              |	Номенклатура";
	
	Запрос.Текст = ТекстЗапроса;
	
	СкладскиеТипыНоменклатуры = питОбщегоНазначения.ПолучитьСкладскиеТипыНоменклатуры();
	Запрос.УстановитьПараметр("СкладскиеТипыНоменклатуры", СкладскиеТипыНоменклатуры);
	Запрос.УстановитьПараметр("ОсобенностиУчетаДоступныеДляОтраженияОстатковИС", 
		РегистрыНакопления.питОстаткиМарокИС.ОсобенностиУчетаДоступныеДляОтраженияОстатковИС());
	Запрос.УстановитьПараметр("ДокументВыпуска", ДокументВыпускБлюдСсылка);
	Запрос.УстановитьПараметр("Период", ТекДокументОбъект.Дата);
	Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(Новый МоментВремени(ТекДокументОбъект.Дата, ТекДокументОбъект.Ссылка),
		ВидГраницы.Включая));
	// Рассматривать отрицательный остаток будет за последние 2 недели.
	Запрос.УстановитьПараметр("НачалоПериода", ТекДокументОбъект.Дата - 86400*14);
	КонтролироватьОстаткиМарокИС = ДокументВыпускБлюдДанные.КонтролироватьОстаткиМарокИСПриПроведении;
	Запрос.УстановитьПараметр("КонтролироватьОстаткиМарокИС", КонтролироватьОстаткиМарокИС);
	Запрос.УстановитьПараметр("ДокументКорректировки", ТекДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("МестаПечати", ДоступныеМестаПечати);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ТекДокументОбъект.Склад);
	Запрос.УстановитьПараметр("Организация", ТекДокументОбъект.Организация);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексПоследнегоПакета = РезультатЗапроса.ВГраница();
	Если РезультатЗапроса[ИндексПоследнегоПакета].Пустой() Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекДокументОбъект.Ссылка) Тогда
			Возврат Истина;
		КонецЕсли;
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, 
				ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), 
				ТекДокументОбъект.Ссылка, 
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,
				ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = 
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Запасы.Очистить();
	
	СтруктураПоследнейСтроки = питОбщегоНазначения.ПустаяСтруктураПоРезультатуЗапроса(
		РезультатЗапроса[ИндексПоследнегоПакета]);
	
   	ВыборкаНоменклатуры = РезультатЗапроса[ИндексПоследнегоПакета].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		////упаковка ингридиента из выборки
		//КоличествоТребуетсяВМЛ = питОбщегоНазначения.ПеревестиОбъемВМиллилитры(
		//	ВыборкаНоменклатуры.Номенклатура,,
		//	ВыборкаНоменклатуры.Количество);
		//КоличествоОсталось = КоличествоТребуетсяВМЛ;
		
		НоваяСтрока = Неопределено;
		ВыборкаОстатков = ВыборкаНоменклатуры.Выбрать(); 
		
		Пока ВыборкаОстатков.Следующий() Цикл
			
			//КоличествоОсталось = ВыборкаОстатков.Количество;
			
			КоличествоТребуетсяВМЛ = питОбщегоНазначения.ПеревестиОбъемВМиллилитры(
									ВыборкаОстатков.Номенклатура,
									ВыборкаОстатков.УпаковкаИнгредиента,
									ВыборкаОстатков.Количество);
		
			КоличествоОсталось = ОКР(КоличествоТребуетсяВМЛ);
			
			Если КоличествоОсталось <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если НоваяСтрока = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПоследнейСтроки, ВыборкаОстатков);
			КонецЕсли;
			
			Если ВыборкаОстатков.Приоритет = 1 Тогда
				КоличествоКСписанию = КоличествоОсталось;
			Иначе
				КоличествоКСписанию = Мин(КоличествоОсталось, ВыборкаОстатков.КоличествоОстаток);
			КонецЕсли;
			
			Если КоличествоКСписанию = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТекДокументОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаОстатков);
			
			НоваяСтрока.Количество = -КоличествоКСписанию;
			
			КоличествоОсталось = КоличествоОсталось - КоличествоКСписанию;
		
		КонецЦикла;
		
		Если КоличествоОсталось = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НоваяСтрока = Неопределено
			И НЕ КонтролироватьОстаткиМарокИС Тогда
			Продолжить;
		ИначеЕсли НоваяСтрока = Неопределено Тогда
			НоваяСтрока = ТекДокументОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПоследнейСтроки);
			НоваяСтрока.Количество = -КоличествоОсталось;
		Иначе
			НоваяСтрока.Количество = НоваяСтрока.Количество - КоличествоОсталось;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ИсходныйРежимЗаписи	= ТекРежимЗаписи;
		ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Попытка
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("КонтролироватьОстаткиМарокИС", КонтролироватьОстаткиМарокИС);
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументВыпускБлюдСсылка+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//+ОтложенноеПроведение
	ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
	//-ОтложенноеПроведение
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы, , ТекСинхронизирован);
	
	Возврат Истина;
	
КонецФункции


//>> Швецов. 29.05.2025. 
//Функция формирует документ "Корректировка остатков ИС" для по маркам ингридиентов из производтсва.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция MRS_СформироватьКорректировкуОстатковИСПоПроизводству(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	ДокументВыпускБлюдСсылка = ДокументВыпускБлюд;
	Если ТипЗнч(ДокументВыпускБлюд) = Тип("ДокументОбъект.питВыпускБлюд") Тогда
		ДокументВыпускБлюдСсылка = ДокументВыпускБлюд.Ссылка;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа 
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент КАК ТиповойДокумент
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.питКорректировкаОстатковИС";
	Запрос.УстановитьПараметр("Документпит", ДокументВыпускБлюдСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
	Иначе
		// для реализаций создаем только для модификаторов бизнес-ланчей
		ТекДокументОбъект = Документы.питКорректировкаОстатковИС.СоздатьДокумент();
		ТекДокументОбъект.Заполнить(Неопределено);
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(
		ДокументВыпускБлюд.Проведен, 
		ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен,
		ТекДокументОбъект.ПометкаУдаления,
		СтруктураПараметров);
		
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
		
	//УстановкаПометкиУдаления
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Если НЕ ТекДокументОбъект.ЭтоНовый() Тогда
		
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, 
					ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), 
					ТекДокументОбъект.Ссылка, 
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,
					ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = 
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				Попытка
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ДокументВыпускБлюд+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
		
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюд.Дата КАК Дата,
	|	питВыпускБлюд.Ответственный КАК Автор,
	|	питВыпускБлюд.Организация КАК Организация,
	|	питВыпускБлюд.Подразделение КАК Подразделение,
	|	питВыпускБлюд.Склад КАК Склад,
	|	питВыпускБлюд.Комментарий КАК Комментарий,
	|	ЕСТЬNULL(питПараметрыСкладовОбщепита.КонтролироватьОстаткиМарокИСПриПроведении, ЛОЖЬ) КАК КонтролироватьОстаткиМарокИСПриПроведении
	|ИЗ
	|	Документ.питВыпускБлюд КАК питВыпускБлюд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.питПараметрыСкладовОбщепита КАК питПараметрыСкладовОбщепита
	|		ПО питВыпускБлюд.Склад = питПараметрыСкладовОбщепита.Склад
	|ГДЕ
	|	питВыпускБлюд.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументВыпускБлюдСсылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДокументВыпускБлюдДанные = РезультатЗапроса[0].Выбрать();
	ДокументВыпускБлюдДанные.Следующий();
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	ТекДокументОбъект.Дата = ДокументВыпускБлюдДанные.Дата + 
		?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.Организация = ДокументВыпускБлюдДанные.Организация;
	ТекДокументОбъект.Склад = ДокументВыпускБлюдДанные.Склад;
	ТекДокументОбъект.ДокументОснование = ДокументВыпускБлюдСсылка;
	ТекДокументОбъект.Комментарий = ДокументВыпускБлюдДанные.Комментарий;
	ТекДокументОбъект.Автор = ДокументВыпускБлюдДанные.Автор;
	ТекДокументОбъект.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.КорректировкаОстатковИСКорректировкаОстатков;
	ТекДокументОбъект.Подразделение = ДокументВыпускБлюдДанные.Подразделение;
	// Создаем массив документов "Производство без заказа"
	МассивДокументов = Новый Массив;
	Для Каждого Строка Из тблСозданныеДокументы Цикл
		Если ТипЗнч(Строка.ТиповойДокумент) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
			МассивДокументов.Добавить(Строка.ТиповойДокумент);
		КонецЕсли;
	КонецЦикла;
	
	// Создаем запрос для получения данных из табличной части
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура КАК Номенклатура,
	|	ПроизводствоБезЗаказаМатериалыИРаботы.Количество * 1000 КАК Количество,
	|	ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПроизводствоБезЗаказаМатериалыИРаботы.Склад КАК МестоПечати,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.МатериалыИРаботы КАК ПроизводствоБезЗаказаМатериалыИРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО ПроизводствоБезЗаказаМатериалыИРаботы.Серия.Номер = ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода
	|ГДЕ
	|	ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка В(&МассивДокументов)
	|	И ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура.АлкогольнаяПродукция
	|	И ПроизводствоБезЗаказаМатериалыИРаботы.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
		
 	Если РезультатЗапроса.Пустой() Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекДокументОбъект.Ссылка) Тогда
			Возврат Истина;
		КонецЕсли;
		
		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, 
				ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ПараметрыЗаписи.ПометкаУдаления), 
				ТекДокументОбъект.Ссылка, 
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,
				ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = 
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
		//-ОтложенноеПроведение
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Запасы.Очистить();
		
   	ВыборкаНоменклатуры = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		НоваяСтрока = Неопределено;
		
		//КоличествоМЛ = питОбщегоНазначения.ПеревестиОбъемВМиллилитры(ВыборкаНоменклатуры.Номенклатура,
		//	ВыборкаНоменклатуры.ЕдиницаИзмерения, 
		//	ВыборкаНоменклатуры.Количество);
			
		НоваяСтрока = ТекДокументОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНоменклатуры);
		//НоваяСтрока.Количество = КоличествоМЛ;
					
	КонецЦикла;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ИсходныйРежимЗаписи	= ТекРежимЗаписи;
		ТекРежимЗаписи		= РежимЗаписиДокумента.Запись;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Попытка
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина); 
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументВыпускБлюдСсылка+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	//+ОтложенноеПроведение
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ТекДействие = ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ИсходныйРежимЗаписи);
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, ТекДействие, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокументВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ТекДокументОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
		СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//+ОтложенноеПроведение
	ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
	//-ОтложенноеПроведение
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы, , ТекСинхронизирован);
	
	Возврат Истина;
	
КонецФункции
//<< Швецов. 29.05.2025.

// Функция помечает на удаление неиспользуемые комплексные документы выпуска блюд в зависимости от текущего режима
//
// Параметры:
//  ДокВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция ПометитьНаУдалениеНеиспользуемыеКомплексныеДокументыВыпускаБлюд(ДокВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	ИмяДокументаВнутреннееПотребление = питОбратнаяСовместимостьПовтИсп.ИмяДокументаВнутреннееПотребление();
	
	ВсеОк = Истина;

	ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();

	Запрос = Новый Запрос;
	ТекстЗапросаШаблон = "ВЫБРАТЬ
	|	питТиповыеДокументыВсе.ТиповойДокумент,
	|	ВЫРАЗИТЬ(питТиповыеДокументыВсе.ДокументОбщепит КАК Документ.питВыпускБлюд) КАК ДокументВыпускБлюд,
	|	питТиповыеДокументыВсе.ПричинаТиповогоДокумента
	|ПОМЕСТИТЬ втТиповыеДокументыВсе
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументыВсе
	|ГДЕ
	|	питТиповыеДокументыВсе.ДокументОбщепит = &Документпит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент,
	|	питТиповыеДокументы.ДокументВыпускБлюд,
	|	питТиповыеДокументы.ПричинаТиповогоДокумента
	|ИЗ
	|	втТиповыеДокументыВсе КАК питТиповыеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд КАК питВыпускБлюд
	|		ПО питТиповыеДокументы.ДокументВыпускБлюд = питВыпускБлюд.Ссылка
	|ГДЕ
	|	(%ТекстУсловие%) 
	|
	|УПОРЯДОЧИТЬ ПО
	|	питТиповыеДокументы.ТиповойДокумент.МоментВремени";
	ТекстЗапроса = "";
	ТекстЗапросаУсловие = "";
	ТекстЗапросаШаблонУсловие = " питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.%ИмяДокумента% ";

	Если НЕ ДокВыпускБлюд.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСПеремещением Тогда
		ОбъединитьВсе = ?(ПустаяСтрока(ТекстЗапросаУсловие),""," ИЛИ ");
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + ОбъединитьВсе 
				+ " (" 
				+ СтрЗаменить(ТекстЗапросаШаблонУсловие,"%ИмяДокумента%","ПеремещениеТоваров")
				+ " И питТиповыеДокументы.ПричинаТиповогоДокумента = 3"
				+ ") ";
		
		Если ФормироватьДокументыПроизводства22 Тогда
			ОбъединитьВсе = ?(ПустаяСтрока(ТекстЗапросаУсловие),""," ИЛИ ");
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + ОбъединитьВсе 
			+ " (" 
			+ СтрЗаменить(ТекстЗапросаШаблонУсловие,"%ИмяДокумента%","ДвижениеПродукцииИМатериалов")
			+ " И питТиповыеДокументы.ПричинаТиповогоДокумента = 3"
			+ ") ";
		КонецЕсли;

	КонецЕсли;
	
	Если НЕ ДокВыпускБлюд.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСоСписанием Тогда
		ОбъединитьВсе = ?(ПустаяСтрока(ТекстЗапросаУсловие),""," ИЛИ ");
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + ОбъединитьВсе + СтрЗаменить(ТекстЗапросаШаблонУсловие,"%ИмяДокумента%",ИмяДокументаВнутреннееПотребление);
	КонецЕсли;
	
	Если НЕ ДокВыпускБлюд.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРозничнойРеализацией Тогда
		ОбъединитьВсе = ?(ПустаяСтрока(ТекстЗапросаУсловие),""," ИЛИ ");
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + ОбъединитьВсе + СтрЗаменить(ТекстЗапросаШаблонУсловие,"%ИмяДокумента%","ОтчетОРозничныхПродажах");

		Если ФормироватьДокументыПроизводства22 Тогда
			ОбъединитьВсе = ?(ПустаяСтрока(ТекстЗапросаУсловие),""," ИЛИ ");
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + ОбъединитьВсе 
			+ " (" 
			+ СтрЗаменить(ТекстЗапросаШаблонУсловие,"%ИмяДокумента%","ДвижениеПродукцииИМатериалов")
			+ " И питТиповыеДокументы.ПричинаТиповогоДокумента = 1 И ВЫРАЗИТЬ(питТиповыеДокументы.ТиповойДокумент КАК Документ.ДвижениеПродукцииИМатериалов).Получатель <> питВыпускБлюд.Склад"
			+ ") ";
		КонецЕсли;

		Если ФормироватьДокументыПроизводства22 Тогда
			// перемещение на склад реализации
			ОбъединитьВсе = ?(ПустаяСтрока(ТекстЗапросаУсловие),""," ИЛИ ");
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + ОбъединитьВсе 
			+ " (" 
			+ СтрЗаменить(ТекстЗапросаШаблонУсловие,"%ИмяДокумента%","ПеремещениеТоваров")
			+ " И питТиповыеДокументы.ПричинаТиповогоДокумента = 1"
			+ ") ";
		КонецЕсли;

	КонецЕсли;

	Если НЕ ДокВыпускБлюд.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРеализацией Тогда
		ОбъединитьВсе = ?(ПустаяСтрока(ТекстЗапросаУсловие),""," ИЛИ ");
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + ОбъединитьВсе + СтрЗаменить(ТекстЗапросаШаблонУсловие,"%ИмяДокумента%","РеализацияТоваровУслуг");

		Если ФормироватьДокументыПроизводства22 Тогда
			ОбъединитьВсе = ?(ПустаяСтрока(ТекстЗапросаУсловие),""," ИЛИ ");
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + ОбъединитьВсе 
			+ " (" 
			+ СтрЗаменить(ТекстЗапросаШаблонУсловие,"%ИмяДокумента%","ДвижениеПродукцииИМатериалов")
			+ " И питТиповыеДокументы.ПричинаТиповогоДокумента = 1 И ВЫРАЗИТЬ(питТиповыеДокументы.ТиповойДокумент КАК Документ.ДвижениеПродукцииИМатериалов).Получатель <> питВыпускБлюд.Склад"
			+ ") ";
		КонецЕсли;

		Если ФормироватьДокументыПроизводства22 Тогда
			// перемещение на склад реализации
			ОбъединитьВсе = ?(ПустаяСтрока(ТекстЗапросаУсловие),""," ИЛИ ");
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + ОбъединитьВсе 
			+ " (" 
			+ СтрЗаменить(ТекстЗапросаШаблонУсловие,"%ИмяДокумента%","ПеремещениеТоваров")
			+ " И питТиповыеДокументы.ПричинаТиповогоДокумента = 1"
			+ ") ";
		КонецЕсли;

	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапросаШаблон,"%ТекстУсловие%", ТекстЗапросаУсловие);

	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Документпит", ДокВыпускБлюд);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		ДокОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();

		//+ОтложенноеПроведение
		Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокВыпускБлюд, ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(Истина), ДокОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
			ВсеОк = ДобавитьДействиеОтложенногоПроведения(ДокВыпускБлюд, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента, ДокОбъект.Ссылка, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
			СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
			Если НЕ ВсеОк Тогда 
				Возврат ВсеОк;
			КонецЕсли;
		Иначе
			//-ОтложенноеПроведение

			// Неактуальные для данного типа разделки доки, помечаем на удаление.
			Попытка
				ДокОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ДокОбъект.УстановитьПометкуУдаления(Истина);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ДокОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокВыпускБлюд+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;

		КонецЕсли;

		//+ОтложенноеПроведение
		ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
		//-ОтложенноеПроведение

		// Добавление записи в результирующую таблицу в случае успешной записи документов.
		ДобавитьНовуюЗапись(ДокВыпускБлюд, ДокОбъект, тблСозданныеДокументы, Выборка.ПричинаТиповогоДокумента, ТекСинхронизирован);

	КонецЦикла;

	Возврат ВсеОк;

КонецФункции

//>>Швецов. 26.12.2024. Розничные продажи алкоголя
Функция СоздатьДокументАктСписанияЕГАИС(ДокументВыпускБлюд, СтруктураПараметров, тблСозданныеДокументы)
	
	// << MRS #VINE-129 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 16.06.25, (на основании непроведенного документа ничего формировать не нужно)
	Если СтруктураПараметров.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат Истина;
	КонецЕсли;
	// >> MRS #VINE-129 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 16.06.25, (на основании непроведенного документа ничего формировать не нужно)
	
	СтруктураВозврата = MRS_ЗагрузкаЕГАИСФронт.ПолучитьОстаткиМарокДляПроизводства(ДокументВыпускБлюд, тблСозданныеДокументы);
	
	Если НЕ СтруктураВозврата.Свойство("Шапка") Тогда
		Возврат Истина;
	КонецЕсли;
	
	//Условия по акту списания ЕГАИС
	ДопСоединение = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИСРегистр1
			|		ПО питТиповыеДокументы.ТиповойДокумент = АктСписанияЕГАИСРегистр1.Ссылка
			|			И (АктСписанияЕГАИСРегистр1.ВидДокумента = &ВидОперацииАктСписанияЕГАИСРегистр1)
			|			И (АктСписанияЕГАИСРегистр1.ПричинаСписания = ЗНАЧЕНИЕ(Перечисление.ПричиныСписанийЕГАИС.питПриготовление))
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
			|		ПО (АктСписанияЕГАИСРегистр1.Ссылка = СтатусыДокументовЕГАИС.Документ)
			|";    
	// << MRS #VINE-267 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 08.04.26, (Задвоение актов на списание ЕГАИС_V2 если отправлен то ничего не делаем)
	//ДопОтбор = "И СтатусыДокументовЕГАИС.Статус = &СтатусЧерновикАктСписанияЕГАИС
	//|	И СтатусыДокументовЕГАИС.ДальнейшееДействие1 = &ДальнейшееДействиеЕГАИС";
	ДопОтбор = "";
	// >> MRS #VINE-267 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 08.04.26, (Задвоение актов на списание ЕГАИС_V2)
	
	// Поиск существующего документа "Акт списания ЕГАИС",
	// связанного с текущим "Выпуском блюд". 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ                              
	// << MRS #VINE-267 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 08.04.26, (Задвоение актов на списание ЕГАИС_V2)
	|	СтатусыДокументовЕГАИС.ДальнейшееДействие1,
	|	СтатусыДокументовЕГАИС.Статус КАК Статус,
	// >> MRS #VINE-267 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 08.04.26, (Задвоение актов на списание ЕГАИС_V2)
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|	&ДопСоединение
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &ДокументПит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.АктСписанияЕГАИС
	|	&ДопОтбор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	// << MRS #VINE-267 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 08.04.26, (Задвоение актов на списание ЕГАИС_V2)
	|	втДокументыВыпускПродукции.ДальнейшееДействие1,
	|	втДокументыВыпускПродукции.Статус КАК Статус,
	// >> MRS #VINE-267 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 08.04.26, (Задвоение актов на списание ЕГАИС_V2)	
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
	|";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопОтбор", ДопОтбор);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопСоединение", ДопСоединение);

	Запрос.УстановитьПараметр("ДокументПит", ДокументВыпускБлюд);
	
	Запрос.УстановитьПараметр("СтатусЧерновикАктСписанияЕГАИС", Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.Черновик);
	Запрос.УстановитьПараметр("ДальнейшееДействиеЕГАИС", Перечисления.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ПередайтеДанные);
	Запрос.УстановитьПараметр("ВидОперацииАктСписанияЕГАИСРегистр1", Перечисления.ВидыДокументовЕГАИС.АктСписанияИзРегистра1);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда 
		// << MRS #VINE-267 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 08.04.26, (Задвоение актов на списание ЕГАИС_V2) Если отправлен то ничего не делаем
		//ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
		//ЭтоНовый = Ложь;  
		Если Выборка.Статус = Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.Черновик 
			И Выборка.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ПередайтеДанные Тогда

			ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
			ЭтоНовый = Ложь;
		Иначе 
			Возврат Истина;	
		КонецЕсли;
		// >> MRS #VINE-267 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 08.04.26, (Задвоение актов на списание ЕГАИС_V2)	
	Иначе
		ТекДокументОбъект = Документы.АктСписанияЕГАИС.СоздатьДокумент();
		ЭтоНовый = Истина;
	КонецЕсли;            
		
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументВыпускБлюд.Проведен, ДокументВыпускБлюд.ПометкаУдаления,
		ТекДокументОбъект.Проведен, ТекДокументОбъект.ПометкаУдаления, Новый Структура);
		
	ТекРежимЗаписиДок = ПараметрыЗаписи.РежимЗаписи;	
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления И НЕ ЭтоНовый Тогда
	
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
			Возврат Истина;
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументВыпускБлюд+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
					
	КонецЕсли;
	
	// Товары
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.АкцизныеМарки.Очистить();
	ТекДокументОбъект.Комментарий = СтрШаблон("Создан по данным документа общепита: %1",ДокументВыпускБлюд);
	
	Для Каждого ЭлементСтруктуры ИЗ СтруктураВозврата Цикл
		
		Если ЭлементСтруктуры.Ключ = "Шапка" Тогда
			
			ОрганизацияЕГАИС = ЭлементСтруктуры.Значение;

		ИначеЕсли ЭлементСтруктуры.Ключ = "ДанныеСерииТовара" Тогда
			
			Для Каждого СтрокаТЧ из ЭлементСтруктуры.Значение Цикл
				
				НоваяСтрока = ТекДокументОбъект.Товары.Добавить();
				НоваяСтрока.АлкогольнаяПродукция    = СтрокаТЧ.АлкогольнаяПродукция;
				НоваяСтрока.Номенклатура            = СтрокаТЧ.Номенклатура;
				НоваяСтрока.Справка2                = СтрокаТЧ.Справка2;
				НоваяСтрока.Количество              = СтрокаТЧ.Количество;
				НоваяСтрока.КоличествоУпаковок 		= СтрокаТЧ.Количество;
								
			    НоваяСтрокаАМ = ТекДокументОбъект.АкцизныеМарки.Добавить();
			    НоваяСтрокаАМ.ШтрихкодУпаковки 				= СтрокаТЧ.АкцизнаяМарка;
		        НоваяСтрокаАМ.АкцизнаяМарка 				= СтрокаТЧ.АкцизнаяМарка;
			    НоваяСтрокаАМ.Справка2 						= СтрокаТЧ.Справка2;
				НоваяСтрокаАМ.Количество                    = СтрокаТЧ.Количество;
				НоваяСтрокаАМ.ВыбытиеБутылки				= Истина;
				
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЦикла;
	
	// << MRS #VINE-41 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 25.03.25, (Свертка товаров при автоматическом формировании акта списания ЕГАИС)
	ТекДокументОбъект.Товары.Свернуть("АлкогольнаяПродукция, Номенклатура, Характеристика, Серия, Упаковка, Справка2, ИдентификаторСтроки, СтатусУказанияСерий", "Цена, НС_КоличествоДАЛ, Количество, КоличествоУпаковок, Сумма");
	
	//Для Каждого ТекСтрока Из ТекДокументОбъект.Товары Цикл
		//Если ТекСтрока.Количество <> 0 Тогда
		//	ТекСтрока.Цена = ТекСтрока.Сумма / ТекСтрока.Количество;
		//Иначе                                      
		//	ТекСтрока.Цена = ТекСтрока.Сумма / ТекСтрока.КоличествоУпаковок;
		//КонецЕсли;
		
	//КонецЦикла;
	// >> MRS #VINE-41 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 25.03.25, (Свертка товаров при автоматическом формировании акта списания ЕГАИС)
				
	// Дата документа
	Если НЕ ЗначениеЗаполнено(ТекДокументОбъект.Дата) Тогда
		ТекДокументОбъект.Дата = ДокументВыпускБлюд.Дата;
	КонецЕсли;
	
	ТекДокументОбъект.ВидДокумента = Перечисления.ВидыДокументовЕГАИС.АктСписанияИзРегистра1;
	ТекДокументОбъект.ПричинаСписания = Перечисления.ПричиныСписанийЕГАИС.питПриготовление;
	
	ТекДокументОбъект.ОрганизацияЕГАИС = ОрганизацияЕГАИС;
	
	Если НЕ ЗначениеЗаполнено(ТекДокументОбъект.Номер) Тогда
		ТекДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	ТекДокументОбъект.Ответственный = ДокументВыпускБлюд.Ответственный;
	
	Попытка
		
		ТекДокументОбъект.Записать(ТекРежимЗаписиДок);
		
	Исключение
		ТекстОшибки = Строка(ТекстОшибки) + "
		|Ошибка записи документа " + ТекДокументОбъект.Метаданные().Представление() + "
		| по документу Общепит " + ДокументВыпускБлюд + "
		|по причине: <" + ОписаниеОшибки()  +">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументВыпускБлюд, ТекДокументОбъект, тблСозданныеДокументы, 0);
	
	Возврат Истина;
	

КонецФункции


#КонецОбласти

#КонецОбласти

#Область ФормированиеТиповыхДокументовПоРазделке

// Процедура формирования типовых документов по переданному выпуску блюд.
//
// Параметры:
//  ДокРазделкапит		 - ДокументСсылка	 - Ссылка на документ "Разделка", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоРазделке(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	ВсеОк = Истина;
	
	Если СтруктураПараметров.Свойство("ФормироватьДокументыПроизводства22") Тогда
		ФормироватьДокументыПроизводства22 = СтруктураПараметров.ФормироватьДокументыПроизводства22;
	Иначе
		ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
	КонецЕсли;
	
	ТиповыеДокументы = ПолучитьТиповыеДокументыДляДокументаПитПоРежимуПроизводства(ДокРазделкапит, ?(ФормироватьДокументыПроизводства22,"2.1","2.2"));
	Если ТиповыеДокументы.Количество() Тогда
		
		УдалятьДокументыСтаройСхемыПроведения = Истина;
		Если СтруктураПараметров.Свойство("УдалятьДокументыСтаройСхемыПроведения") Тогда
			УдалятьДокументыСтаройСхемыПроведения = СтруктураПараметров.УдалятьДокументыСтаройСхемыПроведения;
		КонецЕсли;
		
		Если УдалятьДокументыСтаройСхемыПроведения Тогда
			
			Если СтруктураПараметров.Свойство("РежимЗаписи") И СтруктураПараметров.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				// Для документов общепит при перепроведении выполняется сначала отмена проведения явным образом, 
				// чтобы отменить проведение всех типовых документов.
				// В этот момент, мы отменим проведение документов старой схемы.
				ФормироватьДокументыПроизводства22 = НЕ ФормироватьДокументыПроизводства22;
			Иначе
				
				// "Обрываем" связь документов старой схемы производства!
				ВсеОк = ПометитьНаУдалениеИОтвязатьТиповыеДокументы(ДокРазделкапит, ТиповыеДокументы, СтруктураПараметров, ТекстОшибки);
				
			КонецЕсли;
			
		Иначе
			
			ТекстОшибки = ТекстОшибки + "
			| Не выполнено формирование типовых документов производства "+?(ФормироватьДокументыПроизводства22,"2.2","2.1")+" по документу общепит <"+ДокРазделкапит+"> !!
			| По данному документу уже созданы документы производства "+?(ФормироватьДокументыПроизводства22,"2.1","2.2")+"!";
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	ПоФиксированнойСтоимости = ФормироватьДокументыПоРазделкеПоФиксированнойСтоимости(ДокРазделкапит);
	
	Если ФормироватьДокументыПроизводства22 Тогда
		
		// ДОКУМЕНТЫ 2.2
		
		Если ПоФиксированнойСтоимости Тогда
			
			// Заглушка, все удаляем
			ТиповыеДокументыРазделки = ПолучитьТиповыеДокументыДляДокументаПитПоРежимуПроизводства(ДокРазделкапит, "2.2");
			Для каждого ТиповойДокумент Из ТиповыеДокументыРазделки Цикл
				
				Попытка
					ДокОбъект = ТиповойДокумент.ПолучитьОбъект();
					ДокОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ДокОбъект.УстановитьПометкуУдаления(Истина);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ДокОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ДокРазделкапит+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
			КонецЦикла;
			
		Иначе
			
			// По долям себестоимости, будут созданы "Производство без заказа"
			ВсеОК = СформироватьТиповыеДокументыПоРазделкеПоДолямСебестоимости22(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
			
		КонецЕсли;
		
	Иначе // Документы 2.1
		
		Если СтруктураПараметров.Свойство("ПроизводственныйПуть") Тогда
			СтруктураПараметров.ПроизводственныйПуть = ПоФиксированнойСтоимости;
		Иначе
			СтруктураПараметров.Вставить("ПроизводственныйПуть", ПоФиксированнойСтоимости);
		КонецЕсли;
		
		ВсеОк = ПометитьНаУдалениеНеиспользуемыеТиповыеДокументыРазделки(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		
		Если ПоФиксированнойСтоимости И ВсеОк Тогда
			////////////////////////////////////////////////////////////////////////////////////////////////////
			// ВАРИАНТ С ФОРМИРОВАНИЕМ ПРОИЗВОДСТВЕННЫХ ТИПОВЫХ ДОКУМЕНТОВ ПО ДОКУМЕНТУ Общепит "РАЗДЕЛКА"
			//
			ВсеОК = СформироватьТиповыеДокументыПоРазделкеПроизводственныйПуть(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Иначе
			////////////////////////////////////////////////////////////////////////////////////////////////////
			// ВАРИАНТ С ФОРМИРОВАНИЕМ ТИПОВЫХ ДОКУМЕНТОВ "РАЗБОРКА" ПО ДОКУМЕНТУ Общепит "РАЗДЕЛКА"
			//
			ВсеОК = СформироватьТиповыеДокументыПоРазделкеСборкаРазборкаТоваров(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВсеОк;
	
КонецФункции

// Функция определяет, нужно ли формировать производственные документы по переданному документу пит "Разделка".
//
// Параметры:
//  ДокРазделкапит	 - ДокументСсылка.питРазделка - Ссылка на проверяемый документ.
// 
// Возвращаемое значение:
//  Булево - Флаг необходимости формирования производственных документов.
//
Функция ФормироватьДокументыПоРазделкеПоФиксированнойСтоимости(ДокРазделкапит)
	
	Возврат Ложь;
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питРазделкаТовары.ПроцентСебестоимости
	|ИЗ
	|	Документ.питРазделка.Товары КАК питРазделкаТовары
	|ГДЕ
	|	питРазделкаТовары.Ссылка = &ДокументРазделка
	|	И питРазделкаТовары.ПроцентСебестоимости = 0";
	Запрос.УстановитьПараметр("ДокументРазделка", ДокРазделкапит);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ФормированиеТиповыхПроизводственныхДокументовПоРазделке

// Процедура формирования типовых документов по переданному выпуску блюд.
//
// Параметры:
//  ДокРазделкапит		 - ДокументСсылка	 - Ссылка на документ "Разделка", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоРазделкеПроизводственныйПуть(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	ВсеОк = Истина;
	
	///////////////////////////////////////////////////
	// ФОРМИРОВАНИЕ ПЕРЕДАЧИ МАТЕРИАЛОВ В ПРОИЗВОДСТВО
	ВсеОк = СформироватьПередачуМатериаловПоРазделке(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	Если НЕ ВсеОк Тогда 
		Возврат ВсеОк;
	КонецЕсли;
	
	//////////////////////////////////
	// ФОРМИРОВАНИЕ ВЫПУСКОВ ПРОДУКЦИИ
	//
	
	// Получение документов-объектов "Выпуск продукции" с направлением "На склад" и "В подразделение".
	ДокВыпускПродукцииНаСклад	= Неопределено;
	ПолучитьВыпускиПродукцииДляРазделки(ДокРазделкапит, ДокВыпускПродукцииНаСклад);
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокРазделкапит.Проведен,ДокРазделкапит.ПометкаУдаления,
		ДокВыпускПродукцииНаСклад.Проведен,ДокВыпускПродукцииНаСклад.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	//!!!!!!!!!!
	// Если документы "Выпуск продукции" проведены, то будет происходить перепроведение или отмена проведения.
	// Для этого необходимо сначала отменить проведение списаний затарат в производство, т.к.
	// в них есть ссылки на строки ТЧ "Товары" типовых документов "Выпуск продукции".
	Если ДокВыпускПродукцииНаСклад.Проведен 
		И НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "СписаниеЗатратНаВыпуск") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			ДокВыпускПродукцииНаСклад.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ДокВыпускПродукцииНаСклад.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ДокВыпускПродукцииНаСклад.Метаданные().Представление() + """(на склад)
			| по документу Общепит """+ДокРазделкапит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
		
	// Заполнение общих реквизитов
	//ЗаполнитьОбщиеРеквизиты(ДокументВыпускБлюд,ДокВыпускПродукцииНаСклад);
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	
	// Выпуск на склад
	ДокВыпускПродукцииНаСклад.Дата						= ДокРазделкапит.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ДокВыпускПродукцииНаСклад.Организация				= ДокРазделкапит.Организация;
	ДокВыпускПродукцииНаСклад.Подразделение				= ДокРазделкапит.Подразделение;
	ДокВыпускПродукцииНаСклад.Склад						= ДокРазделкапит.Склад;
	ДокВыпускПродукцииНаСклад.ВидЦены					= ДокРазделкапит.ТипЦен;
	ДокВыпускПродукцииНаСклад.Ответственный				= ДокРазделкапит.Ответственный;
	ДокВыпускПродукцииНаСклад.Комментарий				= ДокРазделкапит.Комментарий;
	ДокВыпускПродукцииНаСклад.ВыпускПоРаспоряжениям		= Ложь;
	ДокВыпускПродукцииНаСклад.НаправлениеВыпуска		= Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад;
	
	// Автоопределение значения налогообложения НДС.
	ДокВыпускПродукцииНаСклад.ВыпускПодДеятельность = Неопределено;
	ПараметрыЗаполнения = Документы.ВыпускПродукции.ПараметрыЗаполненияВидаДеятельностиНДС(ДокВыпускПродукцииНаСклад);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ДокВыпускПродукцииНаСклад.ВыпускПодДеятельность, ПараметрыЗаполнения);
	
	мМетаданныеДокументапит	= ДокРазделкапит.Метаданные();
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", мМетаданныеДокументапит) Тогда
		ДокВыпускПродукцииНаСклад.Валюта				= ДокРазделкапит.Валюта;
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", мМетаданныеДокументапит) Тогда
		ДокВыпускПродукцииНаСклад.Валюта				= ДокРазделкапит.ВалютаДокумента;
	КонецЕсли;
	//ДокВыпускПродукцииНаСклад.НаправлениеДеятельности	= ДокРазделкапит.;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ДокВыпускПродукцииНаСклад.Товары.Очистить();
	ДокВыпускПродукцииНаСклад.Серии.Очистить();
	ДокВыпускПродукцииНаСклад.ДополнительныеРеквизиты.Очистить();
	
	// Получение данных по табличной части "Производство" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	ТекстЗапроса=
	"ВЫБРАТЬ
	|	питРазделкаТовары.Номенклатура КАК Номенклатура,
	|	питРазделкаТовары.Характеристика КАК Характеристика,
	|	питРазделкаТовары.КоличествоУпаковок КАК КоличествоУпаковокНоменклатуры,
	|	питРазделкаТовары.Упаковка КАК УпаковкаНоменклатуры,
	|	питРазделкаТовары.Количество КАК КоличествоНоменклатуры,
	|	питРазделкаТовары.ПроцентСебестоимости
	|ИЗ
	|	Документ.питРазделка.Товары КАК питРазделкаТовары
	|ГДЕ
	|	питРазделкаТовары.Ссылка = &Ссылка
	|	И НЕ питРазделкаТовары.Номенклатура.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокРазделкапит.Ссылка);
	
	// Обход таб. части и заполнение таб. частей "Товары" документов "Выпуск продукции".
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовСтрока = ДокВыпускПродукцииНаСклад.Товары.Добавить();
		НовСтрока.Подразделение			= Справочники.СтруктураПредприятия.ПустаяСсылка(); // Для данного направления выпуска не заполнен.
		НовСтрока.Склад					= ДокРазделкапит.Склад; // Дублируем из шапки.
		
		НовСтрока.Номенклатура			= Выборка.Номенклатура;
		НовСтрока.Характеристика		= Выборка.Характеристика;
		НовСтрока.Упаковка				= Выборка.УпаковкаНоменклатуры;
		НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковокНоменклатуры;
		НовСтрока.Количество			= Выборка.КоличествоНоменклатуры;
		Если Выборка.ПроцентСебестоимости = 0 Тогда
			НовСтрока.ТипСтоимости			= Перечисления.ТипыСтоимостиВыходныхИзделий.Фиксированная;
			//НовСтрока.Цена					= Выборка.Цена;
			//НовСтрока.Сумма					= Выборка.Сумма;
		Иначе
			НовСтрока.ТипСтоимости			= Перечисления.ТипыСтоимостиВыходныхИзделий.Рассчитывается;
		КонецЕсли;
		
		//НовСтрока.Серия				= Выборка.;
		//НовСтрока.СтатьяРасходов		= Выборка.; // Необходимо добавить в выпуск.
		//НовСтрока.СписатьНаРасходы	= ; // Только если будет выпуск со списанием.
		//НовСтрока.Склад				= ; // .
		
	КонецЦикла;
	
	//////////////////////////////////
	// ЗАПИСЬ ВЫПУСКОВ ПРОДУКЦИИ
	
	Попытка
		ДокВыпускПродукцииНаСклад.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ДокВыпускПродукцииНаСклад.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ДокВыпускПродукцииНаСклад.Метаданные().Представление() + """(на склад)
		| по документу Общепит """+ДокРазделкапит+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокРазделкапит, ДокВыпускПродукцииНаСклад, тблСозданныеДокументы);
	
	// Массив обновленных выпусков продукции, на которых будут ссылаться
	// документы "Списание затрат на выпуск".
	ДокументыВыпускаПродукции = Новый Массив;
	ДокументыВыпускаПродукции.Добавить(ДокВыпускПродукцииНаСклад.Ссылка);
	СтруктураПараметров.Вставить("ДокументыВыпускаПродукции", ДокументыВыпускаПродукции);
	
	/////////////////////////////////////
	// ФОРМИРОВАНИЕ СПИСАНИЙ ЗАТРАТ НА ВЫПУСК
	ВсеОк = СформироватьСписанияЗатратПоРазделке(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	
	Возврат ВсеОк;
	
КонецФункции

// Процедура по переданной ссылке на разделку ищет типовые документы "Выпуск продукции" с хоз. операцией
//  "В подразделение" или "На склад" возвращая ДокОбъект. Если не находит, то создает для них пустой объект.
//
// Параметры:
//  ДокументВыпускБлюд			 - ДокументСсылка	 - Ссылка на документ, для которого ищем "Выпуски продукции".
//  выхДокВыпускПродукцииНаСклад - ДокументОбъект	 - Документ "Выпуск продукции"(на склад).
//
Процедура ПолучитьВыпускиПродукцииДляРазделки(ДокументВыпускБлюд, выхДокВыпускПродукцииНаСклад = Неопределено, выхДокВыпускПродукцииВПодр = Неопределено)
	
	Запрос = Новый Запрос;
	
	// Поиск всех выпусков продукции "В подразделение" или "На склад", 
	// связанных с текущим выпуском блюд.
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ВыпускПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВыпускПродукции.НаправлениеВыпуска,
	|	втДокументыВыпускПродукции.ТиповойДокумент КАК ВыпускПродукции
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ВыпускПродукции
	|		ПО (втДокументыВыпускПродукции.ТиповойДокумент = ВыпускПродукции.Ссылка)
	|ГДЕ
	|	ВыпускПродукции.НаправлениеВыпуска В(&НеобходимыеНаправленияВыпуска)";
	
	// Список хоз. операций, поиск будет производиться только для них.
	НаправленияВыпуска = Новый СписокЗначений;
	НаправленияВыпуска.Добавить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад);
	
	Запрос.УстановитьПараметр("Документпит",				ДокументВыпускБлюд);
	Запрос.УстановитьПараметр("НеобходимыеНаправленияВыпуска",	НаправленияВыпуска);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документы найдены, то инициализируем соответствующие переменные.
	Пока Выборка.Следующий() Цикл
		Если Выборка.НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад Тогда
			Если выхДокВыпускПродукцииНаСклад = Неопределено Тогда
				выхДокВыпускПродукцииНаСклад = Выборка.ВыпускПродукции.ПолучитьОбъект();
			Иначе
				// Случай, когда С "Выпуском блюд" связано более 1го "Выпуск продукции"(На склад).
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Если переменные не инициализированны, значит документы не были найдены
	// и необходимо создать пустые документы-объекты, которые далее будут заполняться.
	Если выхДокВыпускПродукцииНаСклад = Неопределено Тогда
		выхДокВыпускПродукцииНаСклад = Документы["ВыпускПродукции"].СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует документ "Передача материалов в производство" для всех ингредиентов не из автопеределов
//  в ТЧ "Ингредиенты" переданного документа "Выпуск блюд" или обновляет существующие.
//
// Параметры:
//  ДокументРазделка		 - ДокументСсылка	 - Ссылка на документ "Разделка", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьПередачуМатериаловПоРазделке(ДокументРазделка, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Передача материалов в производство",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ПередачаМатериаловВПроизводство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаМатериаловВПроизводство КАК ПередачаМатериаловВПроизводство
	|		ПО (втДокументыВыпускПродукции.ТиповойДокумент = ПередачаМатериаловВПроизводство.Ссылка)
	|";
	Запрос.УстановитьПараметр("Документпит",				ДокументРазделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
	Иначе
		ТекДокументОбъект = Документы["ПередачаМатериаловВПроизводство"].СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументРазделка.Проведен,ДокументРазделка.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументРазделка+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	
	ТекДокументОбъект.Дата					= ДокументРазделка.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.Организация			= ДокументРазделка.Организация;
	ТекДокументОбъект.Склад					= ДокументРазделка.Склад;
	ТекДокументОбъект.Подразделение			= ДокументРазделка.Подразделение;
	ТекДокументОбъект.Ответственный			= ДокументРазделка.Ответственный;
	ТекДокументОбъект.Комментарий			= ДокументРазделка.Комментарий;
	ТекДокументОбъект.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ПередачаВПроизводство;
	ТекДокументОбъект.Статус				= Перечисления.СтатусыПередачМатериаловВПроизводство.Принято;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.Серии.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
	
	НовСтрока						= ТекДокументОбъект.Товары.Добавить();
	НовСтрока.Номенклатура			= ДокументРазделка.Номенклатура;
	НовСтрока.Упаковка				= ДокументРазделка.Упаковка;
	НовСтрока.КоличествоУпаковок	= ДокументРазделка.КоличествоУпаковок;
	НовСтрока.Количество			= ДокументРазделка.Количество;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА "ПЕРЕДАЧА МАТЕРИАЛОВ В ПРОИЗВОДСТВО"
	
	Попытка
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументРазделка+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументРазделка, ТекДокументОбъект, тблСозданныеДокументы);
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документы "Списание затрат на выпуск" для каждой номенклатурной позиции
//  в ТЧ "Товары" переданного документа "Разделка" или обновляет существующие.
//
// Параметры:
//  ДокументРазделка		 - ДокументСсылка	 - Ссылка на документ "Разделка", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьСписанияЗатратПоРазделке(ДокументРазделка, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	// Запрос:
	// 1. Получение ВТ с реквизитами шапки документа "Выпуск блюд".
	// 2. Выбор в ВТ всех "Списаний затрат на выпуск", связанных с переданным выпуском блюд.
	// 3. Выбор в ВТ необходимых реквизитов ТЧ Производство док. "Выпуск блюд" + реквизитов шапки из (1).
	// 4. Выбор номенклатуры и флагов проведения из документов "Списание затрат...", связанных с "Выпуск блюд"(2).
	// 5. Выбор данных из вт(3) с итогом по номенклатуре.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питРазделка.Ссылка,
	|	питРазделка.ПометкаУдаления,
	|	питРазделка.Проведен,
	|	питРазделка.Организация,
	|	питРазделка.Номенклатура,
	|	питРазделка.Количество,
	|	питРазделка.КоличествоУпаковок,
	|	питРазделка.Упаковка,
	|	питРазделка.Ответственный,
	|	питРазделка.Комментарий,
	|	питРазделка.Подразделение,
	|	питРазделка.Дата,
	|	питРазделка.СтатьяКалькуляции,
	|	питРазделка.СуммарнаяДоляВыхода
	|ПОМЕСТИТЬ втШапкаРазделки
	|ИЗ
	|	Документ.питРазделка КАК питРазделка
	|ГДЕ
	|	питРазделка.Ссылка = &Документпит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыСписаниеЗатрат
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.СписаниеЗатратНаВыпуск
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка,
	|	ВЫБОР
	|		КОГДА ВыпускПродукции.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Автопередел
	|ПОМЕСТИТЬ втВыпускиПродукцииАвтопередел
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Ссылка В(&ДокументыВыпускаПродукции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыпускПродукцииТовары.Ссылка КАК Распоряжение,
	|	ВыпускПродукцииТовары.Номенклатура,
	|	ВыпускПродукцииТовары.КодСтроки,
	|	втВыпускиПродукцииАвтопередел.Автопередел
	|ПОМЕСТИТЬ втРаспоряжения
	|ИЗ
	|	Документ.ВыпускПродукции.Товары КАК ВыпускПродукцииТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВыпускиПродукцииАвтопередел КАК втВыпускиПродукцииАвтопередел
	|		ПО ВыпускПродукцииТовары.Ссылка = втВыпускиПродукцииАвтопередел.Ссылка
	|ГДЕ
	|	ВыпускПродукцииТовары.Ссылка В(&ДокументыВыпускаПродукции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРазделкаТовары.Ссылка,
	|	питРазделкаТовары.Номенклатура,
	|	ЛОЖЬ КАК Автопередел,
	|	питРазделкаТовары.КоличествоУпаковок КАК КоличествоУпаковокНоменклатуры,
	|	питРазделкаТовары.Упаковка КАК УпаковкаНоменклатуры,
	|	питРазделкаТовары.Количество КАК КоличествоНоменклатуры,
	|	питРазделкаТовары.ПроцентВыхода КАК КоэффициентСписываемойНоменклатуры
	|ПОМЕСТИТЬ втПроизводство
	|ИЗ
	|	Документ.питРазделка.Товары КАК питРазделкаТовары
	|ГДЕ
	|	питРазделкаТовары.Ссылка = &Документпит
	|	И НЕ питРазделкаТовары.Номенклатура.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПроизводство.Ссылка,
	|	втПроизводство.Номенклатура,
	|	втПроизводство.Автопередел,
	|	втПроизводство.КоличествоУпаковокНоменклатуры,
	|	втПроизводство.УпаковкаНоменклатуры,
	|	втПроизводство.КоличествоНоменклатуры,
	|	втПроизводство.КоэффициентСписываемойНоменклатуры
	|ПОМЕСТИТЬ втПроизводствоВсе
	|ИЗ
	|	втПроизводство КАК втПроизводство
	|ГДЕ
	|	втПроизводство.Ссылка = &Документпит
	|
	|СГРУППИРОВАТЬ ПО
	|	втПроизводство.КоличествоНоменклатуры,
	|	втПроизводство.КоличествоУпаковокНоменклатуры,
	|	втПроизводство.Ссылка,
	|	втПроизводство.Номенклатура,
	|	втПроизводство.Автопередел,
	|	втПроизводство.УпаковкаНоменклатуры,
	|	втПроизводство.КоэффициентСписываемойНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПроизводствоВсе.Номенклатура,
	|	втПроизводствоВсе.Ссылка КАК ДокументВыпускБлюд,
	|	втПроизводствоВсе.КоличествоНоменклатуры,
	|	втПроизводствоВсе.УпаковкаНоменклатуры,
	|	втПроизводствоВсе.КоличествоУпаковокНоменклатуры,
	|	втШапкаРазделки.Номенклатура КАК Ингредиент,
	|	втШапкаРазделки.Упаковка КАК УпаковкаИнгредиента,
	|	втШапкаРазделки.Количество КАК КоличествоИнгредиентаФакт,
	|	втШапкаРазделки.КоличествоУпаковок КАК КоличествоУпаковокИнгредиентаФакт,
	|	втШапкаРазделки.ПометкаУдаления,
	|	втШапкаРазделки.Проведен,
	|	втШапкаРазделки.Организация,
	|	втШапкаРазделки.Ответственный,
	|	втШапкаРазделки.Комментарий,
	|	втШапкаРазделки.Подразделение,
	|	втШапкаРазделки.Дата,
	|	втПроизводствоВсе.КоэффициентСписываемойНоменклатуры,
	|	втШапкаРазделки.СтатьяКалькуляции,
	|	ЕСТЬNULL(втРаспоряжения.Распоряжение, ЗНАЧЕНИЕ(Документ.ВыпускПродукции.ПустаяСсылка)) КАК Распоряжение,
	|	ЕСТЬNULL(втРаспоряжения.КодСтроки, 0) КАК КодСтроки,
	|	втПроизводствоВсе.Автопередел,
	|	ВЫБОР
	|		КОГДА втШапкаРазделки.СуммарнаяДоляВыхода = 0
	|			ТОГДА 1
	|		ИНАЧЕ втШапкаРазделки.СуммарнаяДоляВыхода
	|	КОНЕЦ КАК СуммарнаяДоляВыхода
	|ПОМЕСТИТЬ втНоменклатураВПроизводстве
	|ИЗ
	|	втШапкаРазделки КАК втШапкаРазделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПроизводствоВсе КАК втПроизводствоВсе
	|			ЛЕВОЕ СОЕДИНЕНИЕ втРаспоряжения КАК втРаспоряжения
	|			ПО втПроизводствоВсе.Номенклатура = втРаспоряжения.Номенклатура
	|				И втПроизводствоВсе.Автопередел = втРаспоряжения.Автопередел
	|		ПО втШапкаРазделки.Ссылка = втПроизводствоВсе.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыСписаниеЗатрат.ТиповойДокумент КАК СписаниеЗатрат,
	|	СписаниеЗатратНаВыпуск.ПометкаУдаления,
	|	СписаниеЗатратНаВыпуск.Проведен
	|ИЗ
	|	втДокументыСписаниеЗатрат КАК втДокументыСписаниеЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеЗатратНаВыпуск КАК СписаниеЗатратНаВыпуск
	|		ПО втДокументыСписаниеЗатрат.ТиповойДокумент = СписаниеЗатратНаВыпуск.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатураВПроизводстве.Номенклатура КАК Номенклатура,
	|	втНоменклатураВПроизводстве.ДокументВыпускБлюд,
	|	втНоменклатураВПроизводстве.КоличествоНоменклатуры,
	|	втНоменклатураВПроизводстве.УпаковкаНоменклатуры,
	|	втНоменклатураВПроизводстве.КоличествоУпаковокНоменклатуры,
	|	втНоменклатураВПроизводстве.Ингредиент,
	|	втНоменклатураВПроизводстве.УпаковкаИнгредиента,
	|	втНоменклатураВПроизводстве.КоличествоИнгредиентаФакт,
	|	втНоменклатураВПроизводстве.КоличествоУпаковокИнгредиентаФакт,
	|	втНоменклатураВПроизводстве.ПометкаУдаления,
	|	втНоменклатураВПроизводстве.Проведен,
	|	втНоменклатураВПроизводстве.Организация,
	|	втНоменклатураВПроизводстве.Ответственный,
	|	втНоменклатураВПроизводстве.Комментарий,
	|	втНоменклатураВПроизводстве.Подразделение,
	|	втНоменклатураВПроизводстве.Дата,
	|	втНоменклатураВПроизводстве.КоэффициентСписываемойНоменклатуры,
	|	втНоменклатураВПроизводстве.СтатьяКалькуляции,
	|	втНоменклатураВПроизводстве.Распоряжение,
	|	втНоменклатураВПроизводстве.КодСтроки,
	|	втНоменклатураВПроизводстве.Автопередел КАК Автопередел,
	|	втНоменклатураВПроизводстве.СуммарнаяДоляВыхода КАК СуммарныйКоэффициент
	|ИЗ
	|	втНоменклатураВПроизводстве КАК втНоменклатураВПроизводстве
	|ИТОГИ ПО
	|	Номенклатура,
	|	Автопередел";
	
	// Если документы "Выпуск продукции" не заданы, то инициализируем их как пустой массив.
	Если СтруктураПараметров.Свойство("ДокументыВыпускаПродукции") И НЕ СтруктураПараметров.ДокументыВыпускаПродукции = Неопределено Тогда
		ДокументыВыпускаПродукции = СтруктураПараметров.ДокументыВыпускаПродукции;
	Иначе
		ДокументыВыпускаПродукции = Новый Массив;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документпит",				ДокументРазделка);
	Запрос.УстановитьПараметр("ДокументыВыпускаПродукции",	ДокументыВыпускаПродукции);
	
	// Выполнение запроса и получение 2х выборок:
	// - Основная выборка с данными по номенклатуре и ее ингридиентам
	// - Доп. выборка существующих документов "Списание затрат" по текущему документу "пит".
	РезультатПакет = Запрос.ВыполнитьПакет();
	Выборка								= РезультатПакет[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСуществующиеСписания			= РезультатПакет[7].Выбрать();
	
	// Структура текущего "Списания затрат".
	ТекСписаниеЗатрат = Новый Структура("СписаниеЗатрат,ПометкаУдаления,Проведен");
	
	РаспределеноДолей = 0;
	РаспределеноКоличество = 0;
	РаспределеноКоличествоУпаковок = 0;
	
	// Обход основной выборки
	Пока Выборка.Следующий() Цикл
		
		ВыборкаАвтопередел = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаАвтопередел.Следующий() Цикл
			
			ВыборкаДетальная = ВыборкаАвтопередел.Выбрать();
			
			// Выборка по списаниям затрат.
			// Если документ существует, тогда заполняем его данными структуру тек. списания,
			// иначе - заполняем значениями по умолчанию.
			Если ВыборкаСуществующиеСписания.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ТекСписаниеЗатрат,ВыборкаСуществующиеСписания);
			Иначе
				ТекСписаниеЗатрат.СписаниеЗатрат = Документы["СписаниеЗатратНаВыпуск"].ПустаяСсылка();
				ТекСписаниеЗатрат.ПометкаУдаления = Ложь;
				ТекСписаниеЗатрат.Проведен = Ложь;
			КонецЕсли;
			
			// "Обнуление" переменной текущего объекта
			ТекДокументОбъект = Неопределено;
			
			ПерваяДетальнаяСтрока = Истина; // В момент обхода первой строки детальной выборки заполняем шапку.
			
			// Детальный обход основной выборки
			Пока ВыборкаДетальная.Следующий() Цикл
				
				Если ПерваяДетальнаяСтрока Тогда
					
					////////////////////////////
					// Определение режима записи
					ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ВыборкаДетальная.Проведен,ВыборкаДетальная.ПометкаУдаления
					,ТекСписаниеЗатрат.Проведен,ТекСписаниеЗатрат.ПометкаУдаления,СтруктураПараметров);
					ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
					////////////////////////////
					
					// Если тек списание затрат не было найдено, то создаем новый объект.
					Если ТекСписаниеЗатрат.СписаниеЗатрат = Документы["СписаниеЗатратНаВыпуск"].ПустаяСсылка() Тогда
						ТекДокументОбъект = Документы["СписаниеЗатратНаВыпуск"].СоздатьДокумент();
					Иначе
						ТекДокументОбъект = ТекСписаниеЗатрат.СписаниеЗатрат.ПолучитьОбъект();
						
						// Если нужно установить пометку удаления, то перед синхронизацией сделаем это.
						Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
							
							// Помечаем на удаление / снимаем пометку в док. "Списание затрат...".
							Попытка
								ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
								ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
							Исключение
								ТекстОшибки = ТекстОшибки + "
								|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
								| по документу Общепит """+ДокументРазделка+"""
								|по причине: <"+ОписаниеОшибки()+">";
								Возврат Ложь;
							КонецПопытки;
							
						КонецЕсли;
						
						// Очистка табличных частей для избежания дублирования информации.
						ТекДокументОбъект.ВыходныеИзделия.Очистить();
						ТекДокументОбъект.МатериалыИУслуги.Очистить();
						ТекДокументОбъект.ВозвратныеОтходы.Очистить();
						ТекДокументОбъект.Трудозатраты.Очистить();
						ТекДокументОбъект.Серии.Очистить();
						
					КонецЕсли;
					
					// Заполнение шапки.
					ТекДокументОбъект.Дата			= ВыборкаДетальная.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
					ТекДокументОбъект.Организация	= ВыборкаДетальная.Организация;
					ТекДокументОбъект.Номенклатура	= ВыборкаДетальная.Номенклатура;
					ТекДокументОбъект.Ответственный	= ВыборкаДетальная.Ответственный;
					ТекДокументОбъект.Комментарий	= ВыборкаДетальная.Комментарий;
					ТекДокументОбъект.Количество	= ВыборкаДетальная.КоличествоНоменклатуры;
					ТекДокументОбъект.Подразделение	= ВыборкаДетальная.Подразделение;
					
					// Заполнение табличной части "Выходные изделия".
					НовСтрокаТЧ						= ТекДокументОбъект.ВыходныеИзделия.Добавить();
					НовСтрокаТЧ.Номенклатура		= ВыборкаДетальная.Номенклатура;
					НовСтрокаТЧ.КоличествоУпаковок	= ВыборкаДетальная.КоличествоУпаковокНоменклатуры;
					НовСтрокаТЧ.Количество			= ВыборкаДетальная.КоличествоНоменклатуры;
					НовСтрокаТЧ.Упаковка			= ВыборкаДетальная.УпаковкаНоменклатуры;
					НовСтрокаТЧ.Подразделение		= ВыборкаДетальная.Подразделение;
					НовСтрокаТЧ.Распоряжение		= ВыборкаДетальная.Распоряжение;
					НовСтрокаТЧ.КодСтроки			= ВыборкаДетальная.КодСтроки;
					
					ПерваяДетальнаяСтрока = Ложь;
				КонецЕсли;
				
				// Заполнение табличной части "Материалы и услуги".
				НовСтрокаТЧ							= ТекДокументОбъект.МатериалыИУслуги.Добавить();
				НовСтрокаТЧ.Номенклатура			= ВыборкаДетальная.Ингредиент;
				НовСтрокаТЧ.СтатьяКалькуляции		= ВыборкаДетальная.СтатьяКалькуляции;
				НовСтрокаТЧ.Количество				= Окр(ВыборкаДетальная.КоличествоИнгредиентаФакт * (ВыборкаДетальная.КоэффициентСписываемойНоменклатуры / ВыборкаДетальная.СуммарныйКоэффициент),3);
				НовСтрокаТЧ.Упаковка				= ВыборкаДетальная.УпаковкаИнгредиента;
				НовСтрокаТЧ.КоличествоУпаковок		= Окр(ВыборкаДетальная.КоличествоУпаковокИнгредиентаФакт * (ВыборкаДетальная.КоэффициентСписываемойНоменклатуры / ВыборкаДетальная.СуммарныйКоэффициент),3);
				НовСтрокаТЧ.Подразделение			= ВыборкаДетальная.Подразделение;
				
				//+Дораспределение
				// Если после долевого распределения осталось что-то нераспределенное, то допишем это в последнюю строку
				РаспределеноДолей = РаспределеноДолей + ВыборкаДетальная.КоэффициентСписываемойНоменклатуры;
				РаспределеноКоличество = РаспределеноКоличество + НовСтрокаТЧ.Количество;
				РаспределеноКоличествоУпаковок = РаспределеноКоличествоУпаковок + НовСтрокаТЧ.КоличествоУпаковок;
				Если РаспределеноДолей = ВыборкаДетальная.СуммарныйКоэффициент Тогда
					
					ДельтаКоличество = ВыборкаДетальная.КоличествоИнгредиентаФакт - РаспределеноКоличество;
					ДельтаКоличествоУпаковок = ВыборкаДетальная.КоличествоУпаковокИнгредиентаФакт - РаспределеноКоличествоУпаковок;
					
					Если ДельтаКоличество > 0 Тогда
						НовСтрокаТЧ.Количество = НовСтрокаТЧ.Количество + ДельтаКоличество;
					КонецЕсли;
					
					Если ДельтаКоличествоУпаковок > 0 Тогда
						НовСтрокаТЧ.КоличествоУпаковок = НовСтрокаТЧ.КоличествоУпаковок + ДельтаКоличествоУпаковок;
					КонецЕсли;
					
				КонецЕсли;
				//-Дораспределение
				
			КонецЦикла;
			
			Если НЕ ТекДокументОбъект = Неопределено Тогда
				
				// Запись заполненного документа "Списание затрат".
				Попытка
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокументОбъект.Записать(ТекРежимЗаписи);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ДокументРазделка+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
			// Добавление записи в результирующую таблицу в случае успешной записи документов.
			ДобавитьНовуюЗапись(ДокументРазделка, ТекДокументОбъект, тблСозданныеДокументы);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// "Обнуление" переменной текущего объекта.
	ТекДокументОбъект = Неопределено;
	
	// Если остались лишние документы "Списания затрат", то нужно пометить их на удаление.
	Пока ВыборкаСуществующиеСписания.Следующий() Цикл
		
		ТекДокументОбъект = ВыборкаСуществующиеСписания.СписаниеЗатрат.ПолучитьОбъект();
		
		// Помечаем на удаление "Списание затрат...", если он еще не помечен.
		Если НЕ ВыборкаСуществующиеСписания.ПометкаУдаления Тогда
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(Истина);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументРазделка+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
		
		// Добавление записи в результирующую таблицу.
		ДобавитьНовуюЗапись(ДокументРазделка, ТекДокументОбъект, тблСозданныеДокументы);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // СформироватьСписанияЗатратПоРазделке

#КонецОбласти

#Область ФормированиеТиповыхДокументовСборкаТоваровПоРазделке

// Процедура формирования типовых документов по переданному выпуску блюд.
//
// Параметры:
//  ДокРазделкапит		 - ДокументСсылка	 - Ссылка на документ "Разделка", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоРазделкеСборкаРазборкаТоваров(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	Перем ДокСборкаТоваров;
	ВсеОк = Истина;
	
	ПолучитьСборкуТоваровДляпитРазделки(ДокРазделкапит, ДокСборкаТоваров);
	Если ДокСборкаТоваров = Неопределено Тогда
		// Например исходный документ удален, а подкладных для удаления нет.
		Возврат Истина;
	КонецЕсли;
	 
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокРазделкапит.Проведен,ДокРазделкапит.ПометкаУдаления,
		ДокСборкаТоваров.Проведен,ДокСборкаТоваров.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	//!!!!!!!!
	// Если документы "Выпуск продукции" проведены, то будет происходить перепроведение или отмена проведения.
	// Для этого необходимо сначала отменить проведение списаний затарат в производство, т.к.
	// в них есть ссылки на строки ТЧ "Товары" типовых документов "Выпуск продукции".
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			ДокСборкаТоваров.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ДокСборкаТоваров.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ДокСборкаТоваров.Метаданные().Представление() + """(в подр.)
			| по документу Общепит """+ДокРазделкапит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
		
	КонецЕсли;
		
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	
	МетаданныеСборкаТоваров = ДокСборкаТоваров.Метаданные();
	ДокСборкаТоваров.Дата	= ДокРазделкапит.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ТипОперации", МетаданныеСборкаТоваров) Тогда
		ДокСборкаТоваров.ТипОперации	= Перечисления.ТипыОперацийЗаказаНаСборку.РазборкаНаКомплектующие;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ХозяйственнаяОперация", МетаданныеСборкаТоваров) Тогда
		ДокСборкаТоваров.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.РазборкаТоваров;
	КонецЕсли;
	
	ДокСборкаТоваров.Количество         = ДокРазделкапит.Количество;
	ДокСборкаТоваров.КоличествоУпаковок = ДокРазделкапит.КоличествоУпаковок;
	ДокСборкаТоваров.Упаковка           = ДокРазделкапит.Упаковка;
	
	ДокСборкаТоваров.Комментарий = ДокРазделкапит.Комментарий;
	ДокСборкаТоваров.Номенклатура = ДокРазделкапит.Номенклатура;
	ДокСборкаТоваров.Организация = ДокРазделкапит.Организация;
	
	
	ДокСборкаТоваров.Склад = ДокРазделкапит.Склад;
	ДокСборкаТоваров.Подразделение = ДокРазделкапит.Подразделение;
	
	ДокСборкаТоваров.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
	
	
	
	ДокСборкаТоваров.СборкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; ///***--- НДС
	ДокСборкаТоваров.ВидыЗапасовУказаныВручную = Ложь;
	
	
	/// Сделка, ВариантКомплектации, СтатусУказанияСерий, ВидЗапасов,НомерГТД, Назначение, Ответственный
	// Серия - вроде обязательный
	//НоменклатураОсновногоКомпонента , 
	//АналитикаУчетаНоменклатуры АналитикаУчетаПартий
	//+25
	//ДокСборкаТоваров.ДатаРаспоряжения = ТекущаяДата();
	//-25
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ДокСборкаТоваров.Товары.Очистить();
	Для Каждого Стр из ДокРазделкапит.Товары Цикл
		
		Если Стр.Номенклатура.питВидНоменклатуры = Перечисления.питВидыНоменклатуры.ТехнологическийИнгредиент Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = ДокСборкаТоваров.товары.Добавить();
		НовСтр.Номенклатура = Стр.Номенклатура;
		
		НовСтр.Упаковка = Стр.Упаковка;
		НовСтр.КоличествоУпаковок = Стр.КоличествоУпаковок;
		НовСтр.Количество = Стр.Количество;
		
		НовСтр.ДоляСтоимости = Стр.ПроцентСебестоимости;
		
		//НовСтр. = Стр.;
		//НовСтр. = Стр.;
		//НовСтр. = Стр.;
		//НовСтр. = Стр.;
		//НовСтр. = Стр.;
		//НовСтр. = Стр.;
		//НовСтр. = Стр.;
		//НовСтр. = Стр.;
		//НовСтр. = Стр.;
		//НовСтр. = Стр.;

		
		//Обязательные
		//НовСтр.КодСтроки = Стр.;// Вроде обязательный, не понятно
		//НовСтр.Серия = 
		//
		//
		
		//Необязательн
		//НовСтр.СтатусУказанияСерий
		//НовСтр.ВидЗапасов
		//НовСтр.
		//НовСтр.Назначение 
		//       НомерГТД
		//   АналитикаУчетаПартий
		//   АналитикаУчетаНоменклатуры
		//
		

		
	КонецЦикла;
	
	
	Попытка
		ДокСборкаТоваров.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		
		ДокСборкаТоваров.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ДокСборкаТоваров.Метаданные().Представление() + """
		| по документу Общепит """+ДокРазделкапит+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокРазделкапит, ДокСборкаТоваров, тблСозданныеДокументы);
	
	Возврат ВсеОк;
	
КонецФункции

// Процедура по переданной ссылке на выпуск блюд ищет типовые документы "Выпуск продукции" с хоз. операцией
//  "В подразделение" или "На склад" возвращая ДокОбъект. Если не находит, то создает для них пустой объект.
//
// Параметры:
//  ДокументВыпускБлюд			 - ДокументСсылка	 - Ссылка на документ, для которого ищем "Выпуски продукции".
//  выхДокВыпускПродукцииНаСклад - ДокументОбъект	 - Документ "Выпуск продукции"(на склад).
//  выхДокВыпускПродукцииВПодр	 - ДокументОбъект	 - Документ "Выпуск продукции"(в подразделение).
//
Процедура ПолучитьСборкуТоваровДляпитРазделки(ДокументПланМеню, выхДокЗаказНаПередачуВПроизводство)
	
	Запрос = Новый Запрос;
	
	// Поиск всех выпусков продукции "В подразделение" или "На склад", 
	// связанных с текущим выпуском блюд.
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	втДокументыВыпускПродукции.ТиповойДокумент КАК ДокументОбщепита
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ВыпускПродукции
	|		ПО (втДокументыВыпускПродукции.ТиповойДокумент = ВыпускПродукции.Ссылка)";
	
	Запрос.УстановитьПараметр("Документпит",				ДокументПланМеню);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документы найдены, то инициализируем соответствующие переменные.
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ДокументОбщепита) = Тип("ДокументСсылка.СборкаТоваров") Тогда
			выхДокЗаказНаПередачуВПроизводство = Выборка.ДокументОбщепита.ПолучитьОбъект();
		Иначе
			// возможно, производственные документы, игнорируем
		КонецЕсли;
		
	КонецЦикла;
	
	// Если переменные не инициализированны, значит документы не были найдены
	// и необходимо создать пустые документы-объекты, которые далее будут заполняться.
	Если (выхДокЗаказНаПередачуВПроизводство = Неопределено) И НЕ ДокументПланМеню.ПометкаУдаления Тогда
		выхДокЗаказНаПередачуВПроизводство = Документы.СборкаТоваров.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеТиповыхДокументовПоРазделке22

// Процедура формирования типовых документов по переданному выпуску блюд.
//
// Параметры:
//  ДокРазделкапит		 - ДокументСсылка	 - Ссылка на документ "Разделка", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоРазделкеПоДолямСебестоимости22(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	Перем ДокПроизводствоБезЗаказа;
	ВсеОк = Истина;
	
	//+Получение данных разделки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питРазделка.Ссылка КАК Ссылка,
	|	питРазделка.ПометкаУдаления КАК ПометкаУдаления,
	|	питРазделка.Номер КАК Номер,
	|	питРазделка.Дата КАК Дата,
	|	питРазделка.Проведен КАК Проведен,
	|	питРазделка.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	питРазделка.Организация КАК Организация,
	|	питРазделка.Склад КАК Склад,
	|	питРазделка.Подразделение КАК Подразделение,
	|	питРазделка.ТипЦен КАК ТипЦен,
	|	питРазделка.СуммаДокумента КАК СуммаДокумента,
	|	питРазделка.ВалютаДокумента КАК ВалютаДокумента,
	|	питРазделка.Ответственный КАК Ответственный,
	|	питРазделка.Комментарий КАК Комментарий,
	|	питРазделка.Номенклатура КАК Номенклатура,
	|	питРазделка.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(питРазделкаСерии.Серия, питРазделка.Серия) КАК Серия,
	|	питРазделка.Упаковка КАК Упаковка,
	|	ЕСТЬNULL(питРазделкаСерии.Количество, питРазделка.Количество) КАК Количество,
	|	питРазделка.Рецептура КАК Рецептура,
	|	питРазделка.СтатьяКалькуляции КАК СтатьяКалькуляции
	|ИЗ
	|	Документ.питРазделка КАК питРазделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питРазделка.Серии КАК питРазделкаСерии
	|		ПО (питРазделкаСерии.Ссылка = питРазделка.Ссылка)
	|			И (питРазделкаСерии.Номенклатура = питРазделка.Номенклатура)
	|			И (питРазделкаСерии.Характеристика = питРазделка.Характеристика)
	|			И (питРазделкаСерии.Назначение = питРазделка.Назначение)
	|ГДЕ
	|	питРазделка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРазделкаТовары.Номенклатура КАК Номенклатура,
	|	питРазделкаТовары.Характеристика КАК Характеристика,
	|	питРазделкаТовары.Серия КАК Серия,
	|	питРазделкаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	питРазделкаТовары.Упаковка КАК Упаковка,
	|	питРазделкаТовары.КоличествоУпаковокНорма КАК КоличествоУпаковокНорма,
	|	питРазделкаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	питРазделкаТовары.КоличествоНорма КАК КоличествоНорма,
	|	питРазделкаТовары.Количество КАК Количество,
	|	питРазделкаТовары.СчетУчета КАК СчетУчета,
	|	питРазделкаТовары.ПроцентВыхода КАК ПроцентВыхода,
	|	питРазделкаТовары.ПроцентСебестоимости КАК ПроцентСебестоимости,
	|	питРазделкаТовары.СпособУчетаНДС КАК СпособУчетаНДС,
	|	питРазделкаТовары.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	питРазделкаТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.питРазделка.Товары КАК питРазделкаТовары
	|ГДЕ
	|	питРазделкаТовары.Ссылка = &Ссылка
	|	И НЕ питРазделкаТовары.Номенклатура.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|ИТОГИ
	|	СУММА(ПроцентСебестоимости)
	|ПО
	|	ОБЩИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРазделкаТоварыСерии.Серия КАК Серия,
	|	питРазделкаТоварыСерии.Номенклатура КАК Номенклатура,
	|	питРазделкаТоварыСерии.Характеристика КАК Характеристика,
	|	питРазделкаТоварыСерии.Назначение КАК Назначение,
	|	питРазделкаТоварыСерии.Количество КАК Количество,
	|	питРазделкаТоварыСерии.Ссылка.Склад КАК Получатель
	|ИЗ
	|	Документ.питРазделка.ТоварыСерии КАК питРазделкаТоварыСерии
	|ГДЕ
	|	питРазделкаТоварыСерии.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРазделкаПобочныеИзделия.Ссылка КАК Ссылка,
	|	питРазделкаПобочныеИзделия.НомерСтроки КАК НомерСтроки,
	|	питРазделкаПобочныеИзделия.Подразделение КАК Подразделение,
	|	питРазделкаПобочныеИзделия.Получатель КАК Получатель,
	|	питРазделкаПобочныеИзделия.Номенклатура КАК Номенклатура,
	|	питРазделкаПобочныеИзделия.Характеристика КАК Характеристика,
	|	питРазделкаПобочныеИзделия.Серия КАК Серия,
	|	питРазделкаПобочныеИзделия.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	питРазделкаПобочныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
	|	питРазделкаПобочныеИзделия.Количество КАК Количество,
	|	питРазделкаПобочныеИзделия.Упаковка КАК Упаковка,
	|	питРазделкаПобочныеИзделия.Цена КАК Цена,
	|	питРазделкаПобочныеИзделия.Сумма КАК Сумма,
	|	питРазделкаПобочныеИзделия.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	питРазделкаПобочныеИзделия.Назначение КАК Назначение,
	|	питРазделкаПобочныеИзделия.КоличествоУпаковок КАК ОсталосьКоличестваУпаковок,
	|	питРазделкаПобочныеИзделия.Количество КАК ОсталосьКоличества
	|ИЗ
	|	Документ.питРазделка.ПобочныеИзделия КАК питРазделкаПобочныеИзделия
	|ГДЕ
	|	питРазделкаПобочныеИзделия.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокРазделкапит);
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса = РезультатЗапросаПакет[0];
	
	ШапкаРазделки = РезультатЗапроса.Выбрать();
	ШапкаРазделки.Следующий();
	
	РезультатЗапроса = РезультатЗапросаПакет[1];
	ВыборкаДоляСС = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СуммарнаяДоляСС = 1;
	Если ВыборкаДоляСС.Следующий() Тогда
		СуммарнаяДоляСС = ?(ВыборкаДоляСС.ПроцентСебестоимости = 0, 1, ВыборкаДоляСС.ПроцентСебестоимости);
	Иначе
		Возврат Истина;
	КонецЕсли;
	ВыборкаБлюда = ВыборкаДоляСС.Выбрать();
	
	РезультатЗапроса = РезультатЗапросаПакет[2];
	ТаблицаСерииТовары = РезультатЗапроса.Выгрузить();
	//-Получение данных разделки
	
	ПолучитьПроизводствоБезЗаказаДляпитРазделки(ДокРазделкапит, ДокПроизводствоБезЗаказа);
	Если ДокПроизводствоБезЗаказа = Неопределено Тогда
		// Например исходный документ удален, а подкладных для удаления нет.
		Возврат Истина;
	КонецЕсли;
	 
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокРазделкапит.Проведен,ДокРазделкапит.ПометкаУдаления,
		ДокПроизводствоБезЗаказа.Проведен,ДокПроизводствоБезЗаказа.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	//!!!!!!!!
	// Если документы "Выпуск продукции" проведены, то будет происходить перепроведение или отмена проведения.
	// Для этого необходимо сначала отменить проведение списаний затарат в производство, т.к.
	// в них есть ссылки на строки ТЧ "Товары" типовых документов "Выпуск продукции".
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			ДокПроизводствоБезЗаказа.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ДокПроизводствоБезЗаказа.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ДокПроизводствоБезЗаказа.Метаданные().Представление() + """
			| по документу Общепит """+ДокРазделкапит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	
	МетаданныеСборкаТоваров = ДокПроизводствоБезЗаказа.Метаданные();
	
	///////////
	
	// Заполнение шапки.
	ДокПроизводствоБезЗаказа.Дата					= ШапкаРазделки.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ДокПроизводствоБезЗаказа.Организация			= ШапкаРазделки.Организация;
	ДокПроизводствоБезЗаказа.Подразделение			= ШапкаРазделки.Подразделение;
	ДокПроизводствоБезЗаказа.ГруппировкаЗатрат		= Перечисления.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукции;
	ДокПроизводствоБезЗаказа.Ответственный			= ШапкаРазделки.Ответственный;
	ДокПроизводствоБезЗаказа.Валюта					= Константы.ВалютаРегламентированногоУчета.Получить();
	
	// Автоопределение значения налогообложения НДС.
	ДокПроизводствоБезЗаказа.ВыпускПодДеятельность	= Неопределено;
	ПараметрыЗаполнения = Документы.ПроизводствоБезЗаказа.ПараметрыЗаполненияВидаДеятельностиНДС(ДокПроизводствоБезЗаказа);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ДокПроизводствоБезЗаказа.ВыпускПодДеятельность, ПараметрыЗаполнения);
	
	// Очистка табличных частей для избежания дублирования информации.
	ДокПроизводствоБезЗаказа.ВыходныеИзделия.Очистить();
	ДокПроизводствоБезЗаказа.ВыходныеИзделияСерии.Очистить();
	ДокПроизводствоБезЗаказа.МатериалыИРаботы.Очистить();
	ДокПроизводствоБезЗаказа.Трудозатраты.Очистить();
	ДокПроизводствоБезЗаказа.ПобочныеИзделия.Очистить();
	ДокПроизводствоБезЗаказа.ПобочныеИзделияСерии.Очистить();
	
	ТекНомерГруппыЗатрат = 1; // номер, по которому сопоставляются ТЧ "ВыходныеИзделия" и ТЧ "МатериалыИРаботы".
	
	Коэф = питОбщегоНазначения.ПолучитьКоэффициентУпаковки(ШапкаРазделки.Номенклатура,ШапкаРазделки.Упаковка);
	Коэф = ?(Коэф = 0, 1, Коэф);
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ДокПроизводствоБезЗаказа, Документы.ПроизводствоБезЗаказа));
	
	ТаблицаПобочныеИзделия = РезультатЗапросаПакет[3].Выгрузить();
	
	ШапкаРазделки.Сбросить();
	Пока ШапкаРазделки.Следующий() Цикл
		
		ОсталосьСписатьДоли = СуммарнаяДоляСС;
		ОсталосьКоличества = ШапкаРазделки.Количество;
		ШапкаКоличествоУпаковок = ШапкаРазделки.Количество / Коэф;
		ОсталосьКоличестваУпаковок = ШапкаКоличествоУпаковок;
		
		Пока ВыборкаБлюда.Следующий() И ОсталосьСписатьДоли > 0 Цикл
			
			КСписаниюДоли = Мин(ВыборкаБлюда.ПроцентСебестоимости, ОсталосьСписатьДоли);
			
			Если НЕ КСписаниюДоли = 0 Тогда
				
				НовСтрокаТЧ						= ДокПроизводствоБезЗаказа.МатериалыИРаботы.Добавить();
				НовСтрокаТЧ.Склад				= ШапкаРазделки.Склад;			// Отправитель всегда склад из шапки выпуска, потому что мы именно его обеспечиваем.
				НовСтрокаТЧ.Подразделение		= ШапкаРазделки.Подразделение;	// Отправитель всегда подразделение из шапки выпуска, потому что мы именно его обеспечиваем.
				НовСтрокаТЧ.Номенклатура		= ШапкаРазделки.Номенклатура;
				НовСтрокаТЧ.Характеристика		= ШапкаРазделки.Характеристика;
				НовСтрокаТЧ.Серия				= ШапкаРазделки.Серия;
				НовСтрокаТЧ.КоличествоУпаковок	= ?(ОсталосьСписатьДоли = КСписаниюДоли, ОсталосьКоличестваУпаковок, КСписаниюДоли/СуммарнаяДоляСС*ШапкаКоличествоУпаковок);
				НовСтрокаТЧ.Количество			= ?(ОсталосьСписатьДоли = КСписаниюДоли, ОсталосьКоличества, КСписаниюДоли/СуммарнаяДоляСС*ШапкаРазделки.Количество);
				НовСтрокаТЧ.Упаковка			= ШапкаРазделки.Упаковка;
				НовСтрокаТЧ.СтатьяКалькуляции	= ШапкаРазделки.СтатьяКалькуляции;
				//+25
				НовСтрокаТЧ.ИдентификаторСтроки	= Новый УникальныйИдентификатор;
				//-25
				
				// Побочные изделия.
				Для каждого ВыборкаПобочныеИзделия Из ТаблицаПобочныеИзделия Цикл
					НовСтрокаТЧПобочныеИзделия						= ДокПроизводствоБезЗаказа.ПобочныеИзделия.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрокаТЧПобочныеИзделия, ВыборкаПобочныеИзделия);
					НовСтрокаТЧПобочныеИзделия.НомерГруппыЗатрат	= ТекНомерГруппыЗатрат;
					НовСтрокаТЧПобочныеИзделия.НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад;
					НовСтрокаТЧПобочныеИзделия.ПодразделениеПолучатель = ВыборкаПобочныеИзделия.Подразделение;
					НовСтрокаТЧПобочныеИзделия.КоличествоУпаковок	= ?(ОсталосьСписатьДоли = КСписаниюДоли, ВыборкаПобочныеИзделия.ОсталосьКоличестваУпаковок, КСписаниюДоли/СуммарнаяДоляСС*ВыборкаПобочныеИзделия.КоличествоУпаковок);
					НовСтрокаТЧПобочныеИзделия.Количество			= ?(ОсталосьСписатьДоли = КСписаниюДоли, ВыборкаПобочныеИзделия.ОсталосьКоличества, КСписаниюДоли/СуммарнаяДоляСС*ВыборкаПобочныеИзделия.Количество);
					НовСтрокаТЧПобочныеИзделия.Сумма			= ?(ОсталосьСписатьДоли = КСписаниюДоли, ВыборкаПобочныеИзделия.Сумма, НовСтрокаТЧПобочныеИзделия.КоличествоУпаковок * НовСтрокаТЧПобочныеИзделия.Цена);
					//+25
					НовСтрокаТЧПобочныеИзделия.ИдентификаторСтроки	= Новый УникальныйИдентификатор;
					//-25
					ВыборкаПобочныеИзделия.Сумма = ВыборкаПобочныеИзделия.Сумма - НовСтрокаТЧПобочныеИзделия.Сумма;
					ВыборкаПобочныеИзделия.ОсталосьКоличества = ВыборкаПобочныеИзделия.ОсталосьКоличества - НовСтрокаТЧПобочныеИзделия.Количество;
					ВыборкаПобочныеИзделия.ОсталосьКоличестваУпаковок = ВыборкаПобочныеИзделия.ОсталосьКоличестваУпаковок - НовСтрокаТЧПобочныеИзделия.КоличествоУпаковок;
				КонецЦикла;
				
				ОсталосьСписатьДоли = ОсталосьСписатьДоли - КСписаниюДоли;
				ОсталосьКоличества = ОсталосьКоличества - НовСтрокаТЧ.Количество;
				ОсталосьКоличестваУпаковок = ОсталосьКоличестваУпаковок - НовСтрокаТЧ.КоличествоУпаковок;
				
			КонецЕсли;
			
			СПВыходныеИзделия = Новый Структура("Номенклатура, Характеристика, Серия");
			ЗаполнитьЗначенияСвойств(СПВыходныеИзделия, ВыборкаБлюда);
			НайденныеСтрокиВыхИзделия = ДокПроизводствоБезЗаказа.ВыходныеИзделия.НайтиСтроки(СПВыходныеИзделия);
			Если НайденныеСтрокиВыхИзделия.Количество() Тогда
				НовСтрокаТЧВыхИзделия = НайденныеСтрокиВыхИзделия[0];
			Иначе
				// Заполнение табличной части "Выходные изделия".
				НовСтрокаТЧВыхИзделия							= ДокПроизводствоБезЗаказа.ВыходныеИзделия.Добавить();
				НовСтрокаТЧВыхИзделия.НаправлениеВыпуска		= Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад;
				НовСтрокаТЧВыхИзделия.Получатель				= ШапкаРазделки.Склад;
				НовСтрокаТЧВыхИзделия.Номенклатура				= ВыборкаБлюда.Номенклатура;
				НовСтрокаТЧВыхИзделия.Характеристика			= ВыборкаБлюда.Характеристика;
				НовСтрокаТЧВыхИзделия.Серия						= ВыборкаБлюда.Серия;
				НовСтрокаТЧВыхИзделия.СтатусУказанияСерий		= ВыборкаБлюда.СтатусУказанияСерий;
				НовСтрокаТЧВыхИзделия.КоличествоУпаковок		= ВыборкаБлюда.КоличествоУпаковок;
				НовСтрокаТЧВыхИзделия.Количество				= ВыборкаБлюда.Количество;
				НовСтрокаТЧВыхИзделия.Упаковка					= ВыборкаБлюда.Упаковка;
				НовСтрокаТЧВыхИзделия.ИдентификаторСтроки		= Новый УникальныйИдентификатор;
				НовСтрокаТЧВыхИзделия.НомерГруппыЗатрат			= ТекНомерГруппыЗатрат;
				НовСтрокаТЧВыхИзделия.Подразделение				= ШапкаРазделки.Подразделение;
				//ВидЗапасов
				ТекНомерГруппыЗатрат = ТекНомерГруппыЗатрат + 1;
			КонецЕсли;
			
			Если НЕ КСписаниюДоли = 0 Тогда
				НовСтрокаТЧ.НомерГруппыЗатрат	= НовСтрокаТЧВыхИзделия.НомерГруппыЗатрат;
			КонецЕсли;
			
		КонецЦикла;
		ВыборкаБлюда.Сбросить();
		
	КонецЦикла;
	
	//+Серии
	ДокПроизводствоБезЗаказа.ВыходныеИзделияСерии.Загрузить(ТаблицаСерииТовары);
	
	// Пересчет статусов, которые могли поменяться.
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокПроизводствоБезЗаказа, ПараметрыУказанияСерий["ВыходныеИзделия"]);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокПроизводствоБезЗаказа, ПараметрыУказанияСерий["МатериалыИРаботы"]);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокПроизводствоБезЗаказа, ПараметрыУказанияСерий["ПобочныеИзделия"]);
	//-Серии
	
	/////////////
	
	Попытка
		ДокПроизводствоБезЗаказа.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ДокПроизводствоБезЗаказа.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ДокПроизводствоБезЗаказа.Метаданные().Представление() + """
		| по документу Общепит """+ДокРазделкапит+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокРазделкапит, ДокПроизводствоБезЗаказа, тблСозданныеДокументы);
	
	Возврат ВсеОк;
	
КонецФункции

// Процедура по переданной ссылке на разделку ищет типовые документы "Производство без заказа"
//  Если не находит, то создает для них пустой объект.
//
// Параметры:
//  ДокументРазделка			 - ДокументСсылка	 - Ссылка на документ, для которого ищем "Разделка".
//  выхДокПроизводствоБезЗаказа	 - ДокументОбъект	 - Документ "Производство без заказа"(в подразделение).
//
Процедура ПолучитьПроизводствоБезЗаказаДляпитРазделки(ДокументРазделка, выхДокПроизводствоБезЗаказа)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	питТиповыеДокументы.ТиповойДокумент
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|";
	
	Запрос.УстановитьПараметр("Документпит",				ДокументРазделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документы найдены, то инициализируем соответствующие переменные.
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ТиповойДокумент) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
			выхДокПроизводствоБезЗаказа = Выборка.ТиповойДокумент.ПолучитьОбъект();
		Иначе
			// возможно, производственные документы, игнорируем
		КонецЕсли;
		
	КонецЦикла;
	
	// Если переменные не инициализированны, значит документы не были найдены
	// и необходимо создать пустые документы-объекты, которые далее будут заполняться.
	Если (выхДокПроизводствоБезЗаказа = Неопределено) И НЕ ДокументРазделка.ПометкаУдаления Тогда
		выхДокПроизводствоБезЗаказа = Документы.ПроизводствоБезЗаказа.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Функция помечает на удаление неиспользуемые типовые документы разделки в зависимости от текущего режима
//
// Параметры:
//  ДокРазделкапит		 - ДокументСсылка	 - Ссылка на документ "Разделка", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция ПометитьНаУдалениеНеиспользуемыеТиповыеДокументыРазделки(ДокРазделкапит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	ВсеОк = Истина;
	
	ПроизводственныйПуть = Истина;
	Если СтруктураПараметров.Свойство("ПроизводственныйПуть") Тогда
		ПроизводственныйПуть = СтруктураПараметров.ПроизводственныйПуть;
	Иначе
		ПроизводственныйПуть = ФормироватьДокументыПоРазделкеПоФиксированнойСтоимости(ДокРазделкапит);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// Поиск связанных с данной разделкой типовых документов.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыСписание
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.СписаниеЗатратНаВыпуск
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И НЕ питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.СписаниеЗатратНаВыпуск
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент КАК ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ВыпускПродукции
	|		ПО втДокументыВыпускПродукции.ТиповойДокумент = ВыпускПродукции.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыСписание.ТиповойДокумент КАК ТиповойДокумент
	|ИЗ
	|	втДокументыСписание КАК втДокументыСписание";
	
	Запрос.УстановитьПараметр("Документпит",				ДокРазделкапит);
	Результат =  Запрос.ВыполнитьПакет();
	
	Если НЕ ПроизводственныйПуть Тогда
		// Сначала помечаем списания.
		ВыбораСписанияЗатрат = Результат[3].Выбрать();
		Пока ВыбораСписанияЗатрат.Следующий() Цикл
			
			
			// Неактуальные для данного типа разделки доки, помечаем на удаление.
			Попытка
				ДокОбъект = ВыбораСписанияЗатрат.ТиповойДокумент.ПолучитьОбъект();
				ДокОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ДокОбъект.УстановитьПометкуУдаления(Истина);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ДокОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокРазделкапит+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
			
			// Добавление записи в результирующую таблицу в случае успешной записи документов.
			ДобавитьНовуюЗапись(ДокРазделкапит, ДокОбъект, тблСозданныеДокументы);
			
		КонецЦикла;
	КонецЕсли;
	
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если (ТипЗнч(Выборка.ТиповойДокумент) = Тип("ДокументСсылка.СборкаТоваров") И ПроизводственныйПуть) 
			ИЛИ (НЕ ТипЗнч(Выборка.ТиповойДокумент) = Тип("ДокументСсылка.СборкаТоваров") И НЕ ПроизводственныйПуть) Тогда
			
			// Неактуальные для данного типа разделки доки, помечаем на удаление.
			Попытка
				ДокОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
				ДокОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ДокОбъект.УстановитьПометкуУдаления(Истина);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ДокОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокРазделкапит+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
			// Добавление записи в результирующую таблицу в случае успешной записи документов.
			ДобавитьНовуюЗапись(ДокРазделкапит, ДокОбъект, тблСозданныеДокументы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВсеОк;
	
КонецФункции

#КонецОбласти

#Область ФормированиеТиповыхДокументовПоПлануМеню

// Процедура формирования типовых документов по переданному выпуску блюд.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоПлануМеню(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	Перем ВсеОк;
	ВсеОк = Истина;
	
	Если СтруктураПараметров.Свойство("ФормироватьДокументыПроизводства22") Тогда
		ФормироватьДокументыПроизводства22 = СтруктураПараметров.ФормироватьДокументыПроизводства22;
	Иначе
		ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
		СтруктураПараметров.Вставить("ФормироватьДокументыПроизводства22", ФормироватьДокументыПроизводства22);
	КонецЕсли;
	
	ТиповыеДокументы = ПолучитьТиповыеДокументыДляДокументаПитПоРежимуПроизводства(ДокПланМеню, ?(ФормироватьДокументыПроизводства22,"2.1","2.2"));
	Если ТиповыеДокументы.Количество() Тогда
		
		УдалятьДокументыСтаройСхемыПроведения = Истина;
		Если СтруктураПараметров.Свойство("УдалятьДокументыСтаройСхемыПроведения") Тогда
			УдалятьДокументыСтаройСхемыПроведения = СтруктураПараметров.УдалятьДокументыСтаройСхемыПроведения;
		КонецЕсли;
		
		Если УдалятьДокументыСтаройСхемыПроведения Тогда
			
			Если СтруктураПараметров.Свойство("РежимЗаписи") И СтруктураПараметров.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				// Для документов общепит при перепроведении выполняется сначала отмена проведения явным образом, 
				// чтобы отменить проведение всех типовых документов.
				// В этот момент, мы отменим проведение документов старой схемы.
				ФормироватьДокументыПроизводства22 = НЕ ФормироватьДокументыПроизводства22;
			Иначе
				
				// "Обрываем" связь документов старой схемы производства!
				ВсеОк = ПометитьНаУдалениеИОтвязатьТиповыеДокументы(ДокПланМеню, ТиповыеДокументы, СтруктураПараметров, ТекстОшибки);
				
			КонецЕсли;
			
		Иначе
			
			ТекстОшибки = ТекстОшибки + "
			| Не выполнено формирование типовых документов производства "+?(ФормироватьДокументыПроизводства22,"2.2","2.1")+" по документу общепит <"+ДокПланМеню+"> !!
			| По данному документу уже созданы документы производства "+?(ФормироватьДокументыПроизводства22,"2.1","2.2")+"!";
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ФормироватьДокументыПроизводства22 Тогда
		
		// ДОКУМЕНТЫ 2.2
		
	Иначе // Документы 2.1
		
	КонецЕсли;
	
	ЕстьИнгредиентыБезСхемыОбеспечения = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(питПланМенюИнгредиенты.ЕстьСхемаОбеспечения, ЛОЖЬ) КАК ЕстьСхемаОбеспечения
	|ПОМЕСТИТЬ втЕстьСхема
	|ИЗ
	|	Документ.питПланМеню.Ингредиенты КАК питПланМенюИнгредиенты
	|ГДЕ
	|	питПланМенюИнгредиенты.Ссылка = &Ссылка
	|	И НЕ питПланМенюИнгредиенты.Ингредиент.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|	И питПланМенюИнгредиенты.ИзАвтопеределов = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(питПланМенюИнгредиенты.ЕстьСхемаОбеспечения, ЛОЖЬ)
	|ИЗ
	|	Документ.питПланМеню.Замены КАК питПланМенюИнгредиенты
	|ГДЕ
	|	питПланМенюИнгредиенты.Ссылка = &Ссылка
	|	И НЕ питПланМенюИнгредиенты.ИнгредиентЗамена.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МИНИМУМ(втЕстьСхема.ЕстьСхемаОбеспечения), ЛОЖЬ) КАК ЕстьСхемаОбеспечения
	|ИЗ
	|	втЕстьСхема КАК втЕстьСхема";
	Запрос.УстановитьПараметр("Ссылка", ДокПланМеню);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЕстьИнгредиентыБезСхемыОбеспечения = ТипЗнч(ВыборкаДетальныеЗаписи.ЕстьСхемаОбеспечения) = Тип("Булево") И НЕ ВыборкаДетальныеЗаписи.ЕстьСхемаОбеспечения;
	КонецЦикла;
	
	СтруктураСкладовКладовая = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокПланМеню, "Склад, Склад.ЦеховаяКладовая, ЦеховаяКладовая, ЦеховаяКладовая.ЦеховаяКладовая");
	Если СтруктураСкладовКладовая.СкладЦеховаяКладовая = NULL Тогда
		СтруктураСкладовКладовая.СкладЦеховаяКладовая = Ложь;
	КонецЕсли;
	Если СтруктураСкладовКладовая.ЦеховаяКладоваяЦеховаяКладовая = NULL Тогда
		СтруктураСкладовКладовая.ЦеховаяКладоваяЦеховаяКладовая = Ложь;
	КонецЕсли;
	
	Если НЕ ЕстьИнгредиентыБезСхемыОбеспечения 
		ИЛИ СтруктураСкладовКладовая.Склад = СтруктураСкладовКладовая.ЦеховаяКладовая Тогда
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ЗаказНаПеремещение",,Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ЗаказМатериаловВПроизводство",,Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли СтруктураСкладовКладовая.ЦеховаяКладоваяЦеховаяКладовая Тогда
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ЗаказНаПеремещение",,Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		///////////////////////////////////////////////////
		// ЗАКАЗ МАТЕРИАЛОВ В ПРОИЗВОДСТВО
		ВсеОк = СформироватьЗаказМатериаловВПроизводствоПоПлануМеню(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
	Иначе
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ЗаказМатериаловВПроизводство",,Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		///////////////////////////////////////////////////
		// ЗАКАЗ НА ПЕРЕМЕЩЕНИЕ
		ВсеОк = СформироватьЗаказНаПеремещениеПоПлануМеню(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВсеОк;
	
КонецФункции

// Функция формирует документы "Заказ материалов в производство".
//
// Параметры:
//  ДокПланМеню		 - ДокументСсылка	 - Ссылка на документ "План-меню", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьЗаказМатериаловВПроизводствоПоПлануМеню(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Перем ДатаФормированияПотребности, мМетаданныеТиповогоОбъекта, мМетаданныеТЧ, НовСтр, ПараметрыЗаписи, Стр, ТекРежимЗаписи;
	
	Если СтруктураПараметров.Свойство("ФормироватьДокументыПроизводства22") Тогда
		ФормироватьДокументыПроизводства22 = СтруктураПараметров.ФормироватьДокументыПроизводства22;
	Иначе
		ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
		СтруктураПараметров.Вставить("ФормироватьДокументыПроизводства22", ФормироватьДокументыПроизводства22);
	КонецЕсли;
	
	ДокЗаказНаПередачуВПроизводство = Неопределено;
	ВсеОк = Истина;
	
	ПолучитьТиповойДокументДляПланаМеню(ДокПланМеню, ДокЗаказНаПередачуВПроизводство, "ЗаказМатериаловВПроизводство");
	Если ДокЗаказНаПередачуВПроизводство = Неопределено Тогда
		// Например изходный документ удален, а подкладных для удаления нет.
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокЗаказНаПередачуВПроизводство.ВерсияДанных) 
		И ДокЗаказНаПередачуВПроизводство.Статус <> Перечисления.СтатусыЗаказовМатериаловВПроизводство.КВыполнению Тогда
		// Статус был изменен пользователем, синхронизацию данных не проводим
		
		// Добавление записи в результирующую таблицу в случае успешной записи документов.
		ДобавитьНовуюЗапись(ДокПланМеню, ДокЗаказНаПередачуВПроизводство, тблСозданныеДокументы);
		
		Возврат Истина;
		
	КонецЕсли;
	
	// Запрос данных.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питПланМеню.Дата КАК Дата,
	|	питПланМеню.Автор КАК Автор,
	|	питПланМеню.Организация КАК Организация,
	|	питПланМеню.Подразделение КАК Подразделение,
	|	питПланМеню.ЦеховаяКладовая КАК ЦеховаяКладовая,
	|	питПланМеню.Комментарий КАК Комментарий,
	|	питПланМеню.Склад КАК Склад,
	|	питПланМеню.ДатаПлан КАК ДатаПлан,
	|	питПланМеню.Ответственный КАК Ответственный,
	|	питПланМеню.Проведен КАК Проведен,
	|	питПланМеню.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.питПланМеню КАК питПланМеню
	|ГДЕ
	|	питПланМеню.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питПланМенюИнгредиенты.Ингредиент КАК Ингредиент,
	|	питПланМенюИнгредиенты.Характеристика КАК Характеристика,
	|	питПланМенюИнгредиенты.Назначение КАК Назначение,
	|	питПланМенюИнгредиенты.УпаковкаИнгредиента КАК УпаковкаИнгредиента,
	|	питПланМенюИнгредиенты.КоличествоУпаковокИнгредиентаНорма КАК КоличествоУпаковокИнгредиентаНорма,
	|	питПланМенюИнгредиенты.КоличествоИнгредиентаНорма КАК КоличествоИнгредиентаНорма,
	|	питПланМенюИнгредиенты.ИзАвтопеределов КАК ИзАвтопеределов,
	|	питПланМенюИнгредиенты.ЕстьСхемаОбеспечения КАК ЕстьСхемаОбеспечения,
	|	питПланМенюИнгредиенты.РецептураАвтопередела КАК РецептураАвтопередела
	|ПОМЕСТИТЬ втИнгредиенты
	|ИЗ
	|	Документ.питПланМеню.Ингредиенты КАК питПланМенюИнгредиенты
	|ГДЕ
	|	питПланМенюИнгредиенты.Ссылка = &Ссылка
	|	И НЕ питПланМенюИнгредиенты.Ингредиент.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	питПланМенюЗамены.ИнгредиентЗамена,
	|	питПланМенюЗамены.ХарактеристикаИнгредиентаЗамена,
	|	питПланМенюЗамены.НазначениеИнгредиентаЗамена,
	|	питПланМенюЗамены.УпаковкаИнгредиентаЗамена,
	|	питПланМенюЗамены.КоличествоУпаковокИнгредиентаЗамена,
	|	питПланМенюЗамены.КоличествоИнгредиентаЗамена,
	|	ЛОЖЬ,
	|	питПланМенюЗамены.ЕстьСхемаОбеспечения,
	|	ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка)
	|ИЗ
	|	Документ.питПланМеню.Замены КАК питПланМенюЗамены
	|ГДЕ
	|	питПланМенюЗамены.Ссылка = &Ссылка
	|	И НЕ питПланМенюЗамены.ИнгредиентЗамена.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питПланМенюИнгредиенты.Ингредиент КАК Ингредиент,
	|	питПланМенюИнгредиенты.Характеристика КАК Характеристика,
	|	питПланМенюИнгредиенты.Назначение КАК Назначение,
	|	питПланМенюИнгредиенты.УпаковкаИнгредиента КАК УпаковкаИнгредиента,
	|	СУММА(питПланМенюИнгредиенты.КоличествоУпаковокИнгредиентаНорма) КАК КоличествоУпаковокИнгредиентаНорма,
	|	СУММА(питПланМенюИнгредиенты.КоличествоИнгредиентаНорма) КАК КоличествоИнгредиентаНорма,
	|	питПланМенюИнгредиенты.ИзАвтопеределов КАК ИзАвтопеределов,
	|	питПланМенюИнгредиенты.ЕстьСхемаОбеспечения КАК ЕстьСхемаОбеспечения,
	|	питПланМенюИнгредиенты.РецептураАвтопередела КАК РецептураАвтопередела
	|ИЗ
	|	втИнгредиенты КАК питПланМенюИнгредиенты
	|
	|СГРУППИРОВАТЬ ПО
	|	питПланМенюИнгредиенты.УпаковкаИнгредиента,
	|	питПланМенюИнгредиенты.Ингредиент,
	|	питПланМенюИнгредиенты.Характеристика,
	|	питПланМенюИнгредиенты.Назначение,
	|	питПланМенюИнгредиенты.ИзАвтопеределов,
	|	питПланМенюИнгредиенты.ЕстьСхемаОбеспечения,
	|	питПланМенюИнгредиенты.РецептураАвтопередела";
	Запрос.УстановитьПараметр("Ссылка", ДокПланМеню);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДокПланМенюДанные = РезультатЗапроса[0].Выбрать();
	ДокПланМенюДанные.Следующий();
	ДокПланМенюИнгредиенты = РезультатЗапроса[2].Выбрать();
	
	Если ДокПланМенюДанные.Склад = ДокПланМенюДанные.ЦеховаяКладовая Тогда
		
		// Если в плане меню склад производства = складу материалов, то подкладной документ "Заказ материалов в производство" создаваться не должен.
		ВсеОк = ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ЗаказМатериаловВПроизводство");
		Возврат ВсеОк;
		
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокПланМенюДанные.Проведен,ДокПланМенюДанные.ПометкаУдаления,
	ДокЗаказНаПередачуВПроизводство.Проведен,ДокЗаказНаПередачуВПроизводство.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	//!!!!!!!!!!
	// Если документы "Выпуск продукции" проведены, то будет происходить перепроведение или отмена проведения.
	// Для этого необходимо сначала отменить проведение списаний затарат в производство, т.к.
	// в них есть ссылки на строки ТЧ "Товары" типовых документов "Выпуск продукции".
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			ДокЗаказНаПередачуВПроизводство.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ДокЗаказНаПередачуВПроизводство.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокПланМеню);
			ДокЗаказНаПередачуВПроизводство.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ДокЗаказНаПередачуВПроизводство.Метаданные().Представление() + """(в подр.)
			| по документу Общепит """+ДокПланМеню+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
		
	КонецЕсли;
	
	// В "План меню" был добавлен новый реквизит "Дата план", потребность формируем именно на дату плана.
	ДатаФормированияПотребности = ?(ЗначениеЗаполнено(ДокПланМенюДанные.ДатаПлан), ДокПланМенюДанные.ДатаПлан, ДокПланМенюДанные.Дата);
	
	мМетаданныеТиповогоОбъекта		= ДокЗаказНаПередачуВПроизводство.Метаданные();
	
	мМетаданныеТЧ = мМетаданныеТиповогоОбъекта.ТабличныеЧасти["Товары"];
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	
	ДокЗаказНаПередачуВПроизводство.Дата	= ДокПланМенюДанные.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ДокЗаказНаПередачуВПроизводство.МаксимальныйКодСтроки	= 0;
	
	ДокЗаказНаПередачуВПроизводство.Организация				= ДокПланМенюДанные.Организация;
	ДокЗаказНаПередачуВПроизводство.Подразделение			= ДокПланМенюДанные.Подразделение;
	ДокЗаказНаПередачуВПроизводство.Склад					= ДокПланМенюДанные.Склад;
	ДокЗаказНаПередачуВПроизводство.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(Неопределено);
	
	///***---Даты!!!!
	ДокЗаказНаПередачуВПроизводство.ДатаОтгрузки			= ДатаФормированияПотребности + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ЖелаемаяДатаОтгрузки", мМетаданныеТиповогоОбъекта) Тогда
		ДокЗаказНаПередачуВПроизводство.ЖелаемаяДатаОтгрузки	=ДатаФормированияПотребности + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	КонецЕсли;
	ДокЗаказНаПередачуВПроизводство.Статус = Перечисления.СтатусыЗаказовМатериаловВПроизводство.КВыполнению;///***---????
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("УправлениеПроизводством2_2", мМетаданныеТиповогоОбъекта) Тогда
		ДокЗаказНаПередачуВПроизводство.УправлениеПроизводством2_2 = ФормироватьДокументыПроизводства22;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ЦеховаяКладовая", мМетаданныеТиповогоОбъекта) Тогда
		ДокЗаказНаПередачуВПроизводство.ЦеховаяКладовая = ДокПланМенюДанные.ЦеховаяКладовая;
	КонецЕсли;
	
	Если ДокЗаказНаПередачуВПроизводство.УправлениеПроизводством2_2 Тогда
		ДокЗаказНаПередачуВПроизводство.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;
	Иначе
		ДокЗаказНаПередачуВПроизводство.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ПередачаВПроизводство;
	КонецЕсли;
	
	//Если ФормироватьДокументыПроизводства22 Тогда
	
	ДокЗаказНаПередачуВПроизводство.НеОтгружатьЧастями		= Ложь; ///***---
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", мМетаданныеТиповогоОбъекта) Тогда
		ДокЗаказНаПередачуВПроизводство.Ответственный = ДокПланМенюДанные.Ответственный;
	КонецЕсли;
	
	ДокЗаказНаПередачуВПроизводство.Комментарий					= ДокПланМенюДанные.Комментарий;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ДокЗаказНаПередачуВПроизводство.Товары.Очистить();
	Пока ДокПланМенюИнгредиенты.Следующий() Цикл
		
		Если ДокПланМенюИнгредиенты.ИзАвтопеределов ИЛИ (НЕ ДокПланМенюИнгредиенты.ИзАвтопеределов И ДокПланМенюИнгредиенты.ЕстьСхемаОбеспечения) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокПланМенюИнгредиенты.Ингредиент) Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = ДокЗаказНаПередачуВПроизводство.товары.Добавить();
		НовСтр.Номенклатура = ДокПланМенюИнгредиенты.Ингредиент;
		НовСтр.Характеристика = ДокПланМенюИнгредиенты.Характеристика;
		НовСтр.Назначение = ДокПланМенюИнгредиенты.Назначение;
		НовСтр.Упаковка = ДокПланМенюИнгредиенты.УпаковкаИнгредиента;
		
		НовСтр.КоличествоУпаковок = ДокПланМенюИнгредиенты.КоличествоУпаковокИнгредиентаНорма;
		НовСтр.Количество = ДокПланМенюИнгредиенты.КоличествоИнгредиентаНорма;
		
		НовСтр.Отменено = Ложь;
		
		НовСтр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;///***---????
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаОтгрузки", мМетаданныеТЧ) Тогда
			НовСтр.ДатаОтгрузки = ДатаФормированияПотребности + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("НачалоОтгрузки", мМетаданныеТЧ) Тогда
			НовСтр.НачалоОтгрузки = ДатаФормированияПотребности + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
		КонецЕсли;
		
		
		//Обязательные
		//НовСтр.Серия = 
		
		//Необязательн
		//НовСтр.ГруппаПродукции
		//НовСтр.СтатусУказанияСерий
		
		//НовСтр.КодСтроки
		//НовСтр.Назначение = Стр.
		
	КонецЦикла;
	
	Если НЕ ДокЗаказНаПередачуВПроизводство.Товары.Количество() Тогда
		//  Если в плане меню склад производства <> складу материалов, но в
		//  него не попадает ни одна позиция (по всем позициям к обеспечению 
		//  настроено обеспечение потребностей). В таком случае пустой подкладной
		//  документ "Заказ материалов в производство" также создаваться не должен.
		ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
	КонецЕсли;
	Если ПустаяСтрока(ДокЗаказНаПередачуВПроизводство.ВерсияДанных) И ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		// Новые документы нельзя отменить.
		Возврат ВсеОк;
	КонецЕсли;
	
	Попытка
		ДокЗаказНаПередачуВПроизводство.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ДокЗаказНаПередачуВПроизводство.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокПланМеню);
		
		ДокЗаказНаПередачуВПроизводство.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ДокЗаказНаПередачуВПроизводство.Метаданные().Представление() + """
		| по документу Общепит """+ДокПланМеню+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокПланМеню, ДокЗаказНаПередачуВПроизводство, тблСозданныеДокументы);
	
	Возврат ВсеОк;
	
КонецФункции


// Функция формирует документы "Заказ на перемещение".
//
// Параметры:
//  ДокПланМеню		 - ДокументСсылка	 - Ссылка на документ "План-меню", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьЗаказНаПеремещениеПоПлануМеню(ДокПланМеню, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Перем ДатаФормированияПотребности, мМетаданныеТиповогоОбъекта, мМетаданныеТЧ, НовСтр, ПараметрыЗаписи, Стр, ТекРежимЗаписи;
	
	ДокЗаказНаПеремещение = Неопределено;
	ВсеОк = Истина;
	
	ПолучитьТиповойДокументДляПланаМеню(ДокПланМеню, ДокЗаказНаПеремещение, "ЗаказНаПеремещение");
	Если ДокЗаказНаПеремещение = Неопределено Тогда
		// Например изходный документ удален, а подкладных для удаления нет.
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокЗаказНаПеремещение.ВерсияДанных) 
		И ДокЗаказНаПеремещение.Статус <> Перечисления.СтатусыВнутреннихЗаказов.КВыполнению Тогда
		// Статус был изменен пользователем, синхронизацию данных не проводим
		
		// Добавление записи в результирующую таблицу в случае успешной записи документов.
		ДобавитьНовуюЗапись(ДокПланМеню, ДокЗаказНаПеремещение, тблСозданныеДокументы);
		
		Возврат Истина;
		
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокПланМеню.Проведен,ДокПланМеню.ПометкаУдаления,
	ДокЗаказНаПеремещение.Проведен,ДокЗаказНаПеремещение.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	//УстановкаПометкиУдаления
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		Попытка
			ДокЗаказНаПеремещение.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ДокЗаказНаПеремещение.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокПланМеню);
			ДокЗаказНаПеремещение.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ДокЗаказНаПеремещение.Метаданные().Представление() + """(в подр.)
			| по документу Общепит """+ДокПланМеню+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питПланМеню.Дата КАК Дата,
	|	питПланМеню.Автор КАК Автор,
	|	питПланМеню.Организация КАК Организация,
	|	питПланМеню.Подразделение КАК Подразделение,
	|	питПланМеню.ЦеховаяКладовая КАК ЦеховаяКладовая,
	|	питПланМеню.Комментарий КАК Комментарий,
	|	питПланМеню.Склад КАК Склад,
	|	питПланМеню.ДатаПлан КАК ДатаПлан,
	|	питПланМеню.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.питПланМеню КАК питПланМеню
	|ГДЕ
	|	питПланМеню.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питПланМенюИнгредиенты.Ингредиент КАК Ингредиент,
	|	питПланМенюИнгредиенты.Характеристика КАК Характеристика,
	|	питПланМенюИнгредиенты.Назначение КАК Назначение,
	|	питПланМенюИнгредиенты.УпаковкаИнгредиента КАК УпаковкаИнгредиента,
	|	питПланМенюИнгредиенты.КоличествоУпаковокИнгредиентаНорма КАК КоличествоУпаковокИнгредиентаНорма,
	|	питПланМенюИнгредиенты.КоличествоИнгредиентаНорма КАК КоличествоИнгредиентаНорма,
	|	питПланМенюИнгредиенты.ИзАвтопеределов КАК ИзАвтопеределов,
	|	питПланМенюИнгредиенты.ЕстьСхемаОбеспечения КАК ЕстьСхемаОбеспечения,
	|	питПланМенюИнгредиенты.РецептураАвтопередела КАК РецептураАвтопередела
	|ПОМЕСТИТЬ втИнгредиенты
	|ИЗ
	|	Документ.питПланМеню.Ингредиенты КАК питПланМенюИнгредиенты
	|ГДЕ
	|	питПланМенюИнгредиенты.Ссылка = &Ссылка
	|	И НЕ питПланМенюИнгредиенты.Ингредиент.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	питПланМенюЗамены.ИнгредиентЗамена,
	|	питПланМенюЗамены.ХарактеристикаИнгредиентаЗамена,
	|	питПланМенюЗамены.НазначениеИнгредиентаЗамена,
	|	питПланМенюЗамены.УпаковкаИнгредиентаЗамена,
	|	питПланМенюЗамены.КоличествоУпаковокИнгредиентаЗамена,
	|	питПланМенюЗамены.КоличествоИнгредиентаЗамена,
	|	ЛОЖЬ,
	|	питПланМенюЗамены.ЕстьСхемаОбеспечения,
	|	ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка)
	|ИЗ
	|	Документ.питПланМеню.Замены КАК питПланМенюЗамены
	|ГДЕ
	|	питПланМенюЗамены.Ссылка = &Ссылка
	|	И НЕ питПланМенюЗамены.ИнгредиентЗамена.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.ТехнологическийИнгредиент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питПланМенюИнгредиенты.Ингредиент КАК Ингредиент,
	|	питПланМенюИнгредиенты.Характеристика КАК Характеристика,
	|	питПланМенюИнгредиенты.УпаковкаИнгредиента КАК УпаковкаИнгредиента,
	|	питПланМенюИнгредиенты.Назначение КАК Назначение,
	|	СУММА(питПланМенюИнгредиенты.КоличествоУпаковокИнгредиентаНорма) КАК КоличествоУпаковокИнгредиентаНорма,
	|	СУММА(питПланМенюИнгредиенты.КоличествоИнгредиентаНорма) КАК КоличествоИнгредиентаНорма,
	|	питПланМенюИнгредиенты.ИзАвтопеределов КАК ИзАвтопеределов,
	|	питПланМенюИнгредиенты.ЕстьСхемаОбеспечения КАК ЕстьСхемаОбеспечения,
	|	питПланМенюИнгредиенты.РецептураАвтопередела КАК РецептураАвтопередела
	|ИЗ
	|	втИнгредиенты КАК питПланМенюИнгредиенты
	|
	|СГРУППИРОВАТЬ ПО
	|	питПланМенюИнгредиенты.ИзАвтопеределов,
	|	питПланМенюИнгредиенты.Ингредиент,
	|	питПланМенюИнгредиенты.Характеристика,
	|	питПланМенюИнгредиенты.Назначение,
	|	питПланМенюИнгредиенты.РецептураАвтопередела,
	|	питПланМенюИнгредиенты.ЕстьСхемаОбеспечения,
	|	питПланМенюИнгредиенты.УпаковкаИнгредиента";
	Запрос.УстановитьПараметр("Ссылка", ДокПланМеню);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДокПланМенюДанные = РезультатЗапроса[0].Выбрать();
	ДокПланМенюДанные.Следующий();
	ДокПланМенюИнгредиенты = РезультатЗапроса[2].Выбрать();
	
	// В "План меню" был добавлен новый реквизит "Дата план", потребность формируем именно на дату плана.
	ДатаФормированияПотребности = ?(ЗначениеЗаполнено(ДокПланМенюДанные.ДатаПлан), ДокПланМенюДанные.ДатаПлан, ДокПланМенюДанные.Дата);
	
	// Метаданные.
	мМетаданныеТиповогоОбъекта		= ДокЗаказНаПеремещение.Метаданные();
	мМетаданныеТЧ = мМетаданныеТиповогоОбъекта.ТабличныеЧасти["Товары"];
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	ДокЗаказНаПеремещение.Дата								= ДокПланМенюДанные.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ДокЗаказНаПеремещение.Организация						= ДокПланМенюДанные.Организация;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", мМетаданныеТиповогоОбъекта) Тогда
		ДокЗаказНаПеремещение.Ответственный					= ДокПланМенюДанные.Ответственный;
	КонецЕсли;
	ДокЗаказНаПеремещение.Подразделение						= ДокПланМенюДанные.Подразделение;
	ДокЗаказНаПеремещение.СкладОтправитель					= ДокПланМенюДанные.Склад;
	ДокЗаказНаПеремещение.СкладПолучатель					= ДокПланМенюДанные.ЦеховаяКладовая;
	ДокЗаказНаПеремещение.Статус							= Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	ДокЗаказНаПеремещение.МаксимальныйКодСтроки				= 0;
	ДокЗаказНаПеремещение.ХозяйственнаяОперация				= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокЗаказНаПеремещение.ЖелаемаяДатаПоступления			= ДатаФормированияПотребности + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ДокЗаказНаПеремещение.Комментарий						= ДокПланМенюДанные.Комментарий;
	ДокЗаказНаПеремещение.СпособДоставки					= Перечисления.СпособыДоставки.Самовывоз;
	ДокЗаказНаПеремещение.ВариантПриемкиТоваров				= Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ДокЗаказНаПеремещение.Товары.Очистить();
	Пока ДокПланМенюИнгредиенты.Следующий() Цикл
		
		Если ДокПланМенюИнгредиенты.ИзАвтопеределов ИЛИ (НЕ ДокПланМенюИнгредиенты.ИзАвтопеределов И ДокПланМенюИнгредиенты.ЕстьСхемаОбеспечения) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокПланМенюИнгредиенты.Ингредиент) Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = ДокЗаказНаПеремещение.товары.Добавить();
		НовСтр.НачалоОтгрузки				= ДатаФормированияПотребности + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
		НовСтр.НачалоОтгрузки				= ДатаФормированияПотребности + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
		НовСтр.КоличествоУпаковок			= ДокПланМенюИнгредиенты.КоличествоУпаковокИнгредиентаНорма;
		НовСтр.Количество					= ДокПланМенюИнгредиенты.КоличествоИнгредиентаНорма;
		НовСтр.Номенклатура					= ДокПланМенюИнгредиенты.Ингредиент;
		НовСтр.Характеристика				= ДокПланМенюИнгредиенты.Характеристика;
		НовСтр.Назначение					= ДокПланМенюИнгредиенты.Назначение;
		НовСтр.Упаковка						= ДокПланМенюИнгредиенты.УпаковкаИнгредиента;
		НовСтр.Отменено						= Ложь;
		НовСтр.ВариантОбеспечения			= Перечисления.ВариантыОбеспечения.КОбеспечению;
		
		//Обязательные
		//НовСтр.Серия = 
		//Необязательн
		//НовСтр.ГруппаПродукции
		//НовСтр.СтатусУказанияСерий
		//НовСтр.КодСтроки
		
	КонецЦикла;
	
	Попытка
		ДокЗаказНаПеремещение.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ДокЗаказНаПеремещение.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокПланМеню);
		ДокЗаказНаПеремещение.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ДокЗаказНаПеремещение.Метаданные().Представление() + """
		| по документу Общепит """+ДокПланМеню+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокПланМеню, ДокЗаказНаПеремещение, тблСозданныеДокументы);
	
	Возврат ВсеОк;
	
КонецФункции

// Процедура по переданной ссылке на план-меню ищет типовые документы. Если не находит, то создает для них пустой объект.
//
// Параметры:
//  ДокументВыпускБлюд			 - ДокументСсылка	 - Ссылка на документ, для которого ищем "Выпуски продукции".
//  выхДокВыпускПродукцииНаСклад - ДокументОбъект	 - Документ "Выпуск продукции"(на склад).
//  выхДокВыпускПродукцииВПодр	 - ДокументОбъект	 - Документ "Выпуск продукции"(в подразделение).
//
Процедура ПолучитьТиповойДокументДляПланаМеню(ДокументПланМеню, выхДокЗаказ, ИмяТиповогоДокумента)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	питТиповыеДокументы.ТиповойДокумент КАК ДокументОбщепита
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ."+ИмяТиповогоДокумента+"
	|";
	
	Запрос.УстановитьПараметр("Документпит",				ДокументПланМеню);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документы найдены, то инициализируем соответствующие переменные.
	Пока Выборка.Следующий() Цикл
		
		выхДокЗаказ = Выборка.ДокументОбщепита.ПолучитьОбъект();
	КонецЦикла;
	
	// Если переменные не инициализированны, значит документы не были найдены
	// и необходимо создать пустые документы-объекты, которые далее будут заполняться.
	Если (выхДокЗаказ = Неопределено) И НЕ ДокументПланМеню.ПометкаУдаления Тогда
		выхДокЗаказ = Документы[ИмяТиповогоДокумента].СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеТиповыхДокументовПоРецептуре

// Процедура формирования типовых документов по переданному выпуску блюд.
//
// Параметры:
//  ДокРазделкапит		 - ДокументСсылка	 - Ссылка на документ "Разделка", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоРецептуре(ДокРецептура, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	ВсеОк = Истина;
	
	// В режиме синхронизации нет проверки статуса спецификации.
	Если СтруктураПараметров.Свойство("ЭтоРежимСинхронизации") Тогда
		ЭтоРежимСинхронизации = СтруктураПараметров.ЭтоРежимСинхронизации;
	Иначе
		ЭтоРежимСинхронизации = Ложь;
	КонецЕсли;
	
	//+питКА
	Если НЕ (питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "УправлениеПредприятием"
		ИЛИ питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "ERPWE") Тогда
		Возврат ВсеОк;
	КонецЕсли;
	//-питКА
	
	Если СтруктураПараметров.Свойство("ФормироватьДокументыПроизводства22") Тогда
		ФормироватьДокументыПроизводства22 = СтруктураПараметров.ФормироватьДокументыПроизводства22;
	Иначе
		ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
	КонецЕсли;
	
	ТиповыеДокументы = ПолучитьТиповыеДокументыДляДокументаПитПоРежимуПроизводства(ДокРецептура, ?(ФормироватьДокументыПроизводства22,"2.1","2.2"));
	Если ТиповыеДокументы.Количество() Тогда
		
		УдалятьДокументыСтаройСхемыПроведения = Истина;
		Если СтруктураПараметров.Свойство("УдалятьДокументыСтаройСхемыПроведения") Тогда
			УдалятьДокументыСтаройСхемыПроведения = СтруктураПараметров.УдалятьДокументыСтаройСхемыПроведения;
		КонецЕсли;
		
		Если УдалятьДокументыСтаройСхемыПроведения Тогда
			
			Если СтруктураПараметров.Свойство("РежимЗаписи") И СтруктураПараметров.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				// Для документов общепит при перепроведении выполняется сначала отмена проведения явным образом, 
				// чтобы отменить проведение всех типовых документов.
				// В этот момент, мы отменим проведение документов старой схемы.
				ФормироватьДокументыПроизводства22 = НЕ ФормироватьДокументыПроизводства22;
			Иначе
				
				// "Обрываем" связь документов старой схемы производства!
				ВсеОк = ПометитьНаУдалениеИОтвязатьТиповыеДокументы(ДокРецептура, ТиповыеДокументы, СтруктураПараметров, ТекстОшибки);
				
			КонецЕсли;
			
		Иначе
			
			ТекстОшибки = ТекстОшибки + "
			| Не выполнено формирование типовых документов производства "+?(ФормироватьДокументыПроизводства22,"2.2","2.1")+" по документу общепит <"+ДокРецептура+"> !!
			| По данному документу уже созданы документы производства "+?(ФормироватьДокументыПроизводства22,"2.1","2.2")+"!";
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	// Ничего не формируем, если не стоит настройка. Но это не ошибка, поэтому возвращаем, что все ок.
	Если НЕ ЭтоРежимСинхронизации И (НЕ Константы.питФормироватьСпецификацииПоРецептурам.Получить()) Тогда
		//ИЛИ НЕ (ДокРецептура.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.РецептураПриготовление)) 
		Возврат ВсеОк;
	КонецЕсли;
	
	//////////////////////////////////
	// ФОРМИРОВАНИЕ СПЕЦИФИКАЦИЙ
	//
	
	// Получение документов-объектов "Выпуск продукции" с направлением "На склад" и "В подразделение".
	Спецификация	= Неопределено;
	ПолучитьСпецификациюПоРецептуре(ДокРецептура, Спецификация);
	
	ЭтоНоваяСпецификация = Спецификация.ЭтоНовый();
	
	// Для помеченый на удаление рецептур ничего не создаем, если раньше не было создано.
	Если ЭтоНоваяСпецификация И ДокРецептура.ПометкаУдаления Тогда
		Возврат ВсеОК;
	КонецЕсли;
	
	// Для существующих спецификаций, если изменился статус и уже не равен "В разработке",
	// то переформирования не происходит.
	Если НЕ ЭтоРежимСинхронизации И НЕ ЭтоНоваяСпецификация 
		И Спецификация.Статус <> Перечисления.СтатусыСпецификаций.ВРазработке Тогда
		
		ТекстРецептура = "Для рецептуры """+ДокРецептура.Ссылка+""" уже утверждена спецификация """+Спецификация.Ссылка+" #"+Спецификация.Код+""". 
		|Синхронизация данных рецептуры и связанной спецификации возможна только для спецификаций в статусе ""В разработке""";
		СтруктураПараметров.Вставить("питСообщениеПоРецептуре", ТекстРецептура);
		СтруктураПараметров.Вставить("питСсылкаНаСпецификацию", Спецификация.Ссылка);
		
		Возврат ВсеОк;
		
	Иначе
		
		ТекстРецептура = "";
		
	КонецЕсли;
	
	// Определение параметров записи.
	
	// Для справочника, коим является спецификация, не определяем режим записи.
	Если СтруктураПараметров.Свойство("ОпределятьРежимЗаписи") Тогда
		ОпределятьРежимЗаписи = Ложь;
	Иначе
		СтруктураПараметров.Вставить("ОпределятьРежимЗаписи", Ложь);
	КонецЕсли;
	
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокРецептура.Проведен,ДокРецептура.ПометкаУдаления,
		,Спецификация.ПометкаУдаления,СтруктураПараметров);
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			Спецификация.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			Спецификация.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + Спецификация.Метаданные().Представление() + "
			| по документу Общепит """+ДокРецептура+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	
	мМетаданныеДокументапит			= ДокРецептура.Метаданные();
	мМетаданныеТиповогоОбъекта		= Спецификация.Метаданные();
	
	мМетаданныеТЧМатериалыИУслуги = мМетаданныеТиповогоОбъекта.ТабличныеЧасти["МатериалыИУслуги"];
	
	Если ЭтоНоваяСпецификация Тогда
		// В режиме синхронизации для не новых рецептур не меняем статус.
		// В остальных случаях перезаполняем ниже указанные реквизиты.
		
		Спецификация.Статус										= Перечисления.СтатусыСпецификаций.ВРазработке;
		Спецификация.МногоэтапныйПроизводственныйПроцесс		= Ложь;
		Спецификация.ОптимальноеКоличествоПередачиМеждуЭтапами	= 1;
		Спецификация.СпособРаспределенияЗатратНаВыходныеИзделия	= Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости;
		
		
	КонецЕсли;
	
	Спецификация.Наименование								= ДокРецептура.Наименование;
	Спецификация.НачалоДействия								= ДокРецептура.ДатаНачала;
	Спецификация.КонецДействия								= ДокРецептура.ДатаКонца;
	Спецификация.Ответственный								= ДокРецептура.Ответственный;
	Спецификация.Описание									= ДокРецептура.ТехнологияПриготовления;
	Если ДокРецептура.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.РецептураПриготовление Тогда
		Спецификация.ТипПроизводственногоПроцесса			= Перечисления.ТипыПроизводственныхПроцессов.Сборка;
	Иначе
		Спецификация.ТипПроизводственногоПроцесса			= Перечисления.ТипыПроизводственныхПроцессов.Разборка;
		//Спецификация.ОсновноеИзделиеВидНоменклатуры
		Спецификация.ОсновноеИзделиеНоменклатура			= ДокРецептура.Номенклатура;
		Спецификация.ОсновноеИзделиеХарактеристика			= ДокРецептура.Характеристика;
		Спецификация.ОсновноеИзделиеУпаковка				= ДокРецептура.Номенклатура;
		Спецификация.ОсновноеИзделиеКоличествоУпаковок		= ДокРецептура.КоличествоУпаковок;
	КонецЕсли;
	Спецификация.ВыходныеИзделия.Очистить();
	
	//+25
	Спецификация.ВариантПодбораВДокументы	= Перечисления.ВариантыПодбораСпецификацииВДокументы.Автоматически;
	Спецификация.ВариантНазначения			= Перечисления.ВариантыНазначенияСпецификации.Номенклатура;
	СтруктураДанных = Новый Структура("Номенклатура,Характеристика,Упаковка,КоличествоУпаковок");
	Для каждого КлючИЗначение Из СтруктураДанных Цикл
		РеквизитОбъекта = "ОсновноеИзделие"+КлючИЗначение.Ключ;
		Спецификация[РеквизитОбъекта] = ДокРецептура[КлючИЗначение.Ключ];
	КонецЦикла;
	Спецификация.ОсновноеИзделиеВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокРецептура.Номенклатура, "ВидНоменклатуры");
	ПервыйЭтап    = Новый Структура("Ссылка");
	ПоследнийЭтап = Новый Структура("Ссылка");
	Справочники.РесурсныеСпецификации.ПолучитьПервыйИПоследнийЭтап(Спецификация.Ссылка, ПервыйЭтап, ПоследнийЭтап);
	Спецификация.ОсновноеИзделиеЭтап = ПервыйЭтап.Ссылка;
	Спецификация.ЗаполнитьСлужебныеРеквизитыПовтИсп();
	ПустойУИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	//-25
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	//Спецификация.ВыходныеИзделия.Очистить();
	//Спецификация.МатериалыИУслуги.Очистить();
	//Спецификация.ВозвратныеОтходы.Очистить();
	//Спецификация.Трудозатраты.Очистить();
	
	// Получение данных по табличной части "Производство" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	ТекстЗапроса=
	"ВЫБРАТЬ
	|	питРецептураИнгридиенты.Номенклатура КАК Номенклатура,
	|	питРецептураИнгридиенты.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	питРецептураИнгридиенты.Характеристика КАК Характеристика,
	|	питРецептураИнгридиенты.Упаковка КАК УпаковкаНоменклатуры,
	|	питРецептураИнгридиенты.КоличествоУпаковокБрутто КАК КоличествоУпаковокНоменклатуры,
	|	питРецептураИнгридиенты.КоличествоБрутто КАК КоличествоНоменклатуры,
	|	питРецептураИнгридиенты.ПроцентСебестоимости КАК ПроцентСебестоимости,
	|	питРецептураИнгридиенты.Рецептура КАК Рецептура,
	|	питРецептураИнгридиенты.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	питРецептураИнгридиенты.КлючСвязи КАК КлючСвязи,
	|	питРецептураИнгридиенты.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
	|	питРецептураИнгридиенты.СпособАвтовыбораНоменклатуры КАК СпособАвтовыбораНоменклатуры,
	|	питРецептураИнгридиенты.СпособАвтовыбораХарактеристики КАК СпособАвтовыбораХарактеристики,
	|	питРецептураИнгридиенты.СвойствоСодержащееНоменклатуру КАК СвойствоСодержащееНоменклатуру,
	|	питРецептураИнгридиенты.АлгоритмАвтовыбораХарактеристики КАК АлгоритмАвтовыбораХарактеристики
	|ИЗ
	|	Документ.питРецептура.Ингредиенты КАК питРецептураИнгридиенты
	|ГДЕ
	|	питРецептураИнгридиенты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРецептураТрудозатраты.ВидРабот КАК ВидРабот,
	|	питРецептураТрудозатраты.Количество КАК Количество,
	|	питРецептураТрудозатраты.НазначениеРабот КАК НазначениеРабот,
	|	питРецептураТрудозатраты.СтатьяКалькуляции КАК СтатьяКалькуляции
	|ИЗ
	|	Документ.питРецептура.Трудозатраты КАК питРецептураТрудозатраты
	|ГДЕ
	|	питРецептураТрудозатраты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРецептураПобочныеИзделия.Ссылка КАК Ссылка,
	|	питРецептураПобочныеИзделия.НомерСтроки КАК НомерСтроки,
	|	питРецептураПобочныеИзделия.Подразделение КАК Подразделение,
	|	питРецептураПобочныеИзделия.Получатель КАК Получатель,
	|	питРецептураПобочныеИзделия.Номенклатура КАК Номенклатура,
	|	питРецептураПобочныеИзделия.Характеристика КАК Характеристика,
	|	питРецептураПобочныеИзделия.Серия КАК Серия,
	|	питРецептураПобочныеИзделия.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	питРецептураПобочныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
	|	питРецептураПобочныеИзделия.Количество КАК Количество,
	|	питРецептураПобочныеИзделия.Упаковка КАК Упаковка,
	|	питРецептураПобочныеИзделия.Цена КАК Цена,
	|	питРецептураПобочныеИзделия.Сумма КАК Сумма,
	|	питРецептураПобочныеИзделия.СтатьяКалькуляции КАК СтатьяКалькуляции
	|ИЗ
	|	Документ.питРецептура.ПобочныеИзделия КАК питРецептураПобочныеИзделия
	|ГДЕ
	|	питРецептураПобочныеИзделия.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРецептураОтборПоСвойствам.КлючСвязи КАК КлючСвязи,
	|	питРецептураОтборПоСвойствам.Свойство КАК Свойство,
	|	питРецептураОтборПоСвойствам.Условие КАК Условие,
	|	питРецептураОтборПоСвойствам.Значение КАК Значение
	|ИЗ
	|	Документ.питРецептура.ОтборПоСвойствам КАК питРецептураОтборПоСвойствам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|			ПО ДополнительныеРеквизитыИСведения.НаборСвойств = НаборыДополнительныхРеквизитовИСведений.Ссылка
	|		ПО питРецептураОтборПоСвойствам.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(НаборыДополнительныхРеквизитовИСведений.ИмяПредопределенногоНабора, """") <> ""Документ_питРецептура""
	|	И питРецептураОтборПоСвойствам.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРецептураСоответствиеСвойств.СвойствоМатериала КАК СвойствоМатериала,
	|	питРецептураСоответствиеСвойств.СвойствоПродукции КАК СвойствоПродукции,
	|	питРецептураСоответствиеСвойств.ЗначениеСвойства КАК ЗначениеСвойства,
	|	питРецептураСоответствиеСвойств.АлгоритмРасчетаЗначения КАК АлгоритмРасчетаЗначения,
	|	питРецептураСоответствиеСвойств.СпособПодбораЗначения КАК СпособПодбораЗначения,
	|	питРецептураСоответствиеСвойств.КлючСвязи КАК КлючСвязи
	|ИЗ
	|	Документ.питРецептура.СоответствиеСвойств КАК питРецептураСоответствиеСвойств
	|ГДЕ
	|	питРецептураСоответствиеСвойств.Ссылка = &Ссылка";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокРецептура.Ссылка);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	//+ПараметризацияРецептур
	ТаблицаСвойств = РезультатПакет[3].Выгрузить();
	ТаблицаСвойствПустая = ТаблицаСвойств.Количество() = 0;
	//-ПараметризацияРецептур
	
	//+АвтовыборНоменклатуры
	ТаблицаСвойствАвтовыбор			= РезультатПакет[4].Выгрузить();
	ТаблицаСвойствАвтовыборПустая	= ТаблицаСвойствАвтовыбор.Количество() = 0;
	//-АвтовыборНоменклатуры
	
	// Массив уже перезаполненных строк ТЧ.
	ПерезаполненныеСтроки = Новый Массив;
	ЭтоНоваяСтрока = Истина;
	
	// Обход таб. части и заполнение таб. частей спецификации.
	Выборка = РезультатПакет[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ДокРецептура.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.РецептураРазделка Тогда
			НовСтрока = Спецификация.ВыходныеИзделия.Добавить();
			НовСтрока.Номенклатура			= Выборка.Номенклатура;
			НовСтрока.Характеристика		= Выборка.Характеристика;
			НовСтрока.Упаковка				= Выборка.УпаковкаНоменклатуры;
			НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковокНоменклатуры;
			//+25
			Если НовСтрока.КлючСвязи = ПустойУИД Тогда
				НовСтрока.КлючСвязи				= Новый УникальныйИдентификатор;
			КонецЕсли;
			НовСтрока.СпособАвтовыбораНоменклатуры		= Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ;
			НовСтрока.СпособАвтовыбораХарактеристики	= Перечисления.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ;
			НовСтрока.ВидНоменклатуры					= Выборка.ВидНоменклатуры;
			//-25
			НовСтрока.ДоляСтоимости			= Выборка.ПроцентСебестоимости;
			Продолжить;
		КонецЕсли;
		
		///////////////////////////////////////////////
		// +Поиск строки в ТЧ.
		ЭтоНоваяСтрока = Истина;
		Если НЕ ЭтоНоваяСпецификация Тогда
			// Поиск в существующей спецификации строки, соответствующей текущей строке рецептуры.
			//+ПараметризацияРецептур
			СП = Новый Структура("КлючСвязи");
			//-ПараметризацияРецептур
			ЗаполнитьЗначенияСвойств(СП, Выборка);
			НайденныеСтроки = Спецификация.МатериалыИУслуги.НайтиСтроки(СП);
			НайденныеСтрокиВрем = Новый Массив;
			Для Инд = 0 По НайденныеСтроки.Количество()-1 Цикл
				Если ПерезаполненныеСтроки.Найти(НайденныеСтроки[Инд]) = Неопределено Тогда
					НайденныеСтрокиВрем.Добавить(НайденныеСтроки[Инд]);
				КонецЕсли;
			КонецЦикла;
			НайденныеСтроки = НайденныеСтрокиВрем;
			
			КоличествоНайденных = НайденныеСтроки.Количество();
			Если КоличествоНайденных = 1 Тогда
				// Найдена одна строка, ее и перезаполняем.
				НовСтрока = НайденныеСтроки[0];
				ЭтоНоваяСтрока = Ложь;
			ИначеЕсли КоличествоНайденных > 1 Тогда
				// Найдено несколько строк
				НовСтрока = НайтиСтрокуСМинимальнымЭтапом(НайденныеСтроки);
				ЭтоНоваяСтрока = Ложь;
			Иначе
				// Ничего не найдено, добавить новую строку
				НовСтрока = Спецификация.МатериалыИУслуги.Добавить();
			КонецЕсли;
		Иначе
			// Ничего не найдено, добавить новую строку
			НовСтрока = Спецификация.МатериалыИУслуги.Добавить();
		КонецЕсли;
		// -Поиск строки в ТЧ.
		//////////////////////////////////////////////////////////////
		
		НовСтрока.Номенклатура			= Выборка.Номенклатура;
		НовСтрока.Характеристика		= Выборка.Характеристика;
		НовСтрока.Упаковка				= Выборка.УпаковкаНоменклатуры;
		НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковокНоменклатуры;
		//+25
		//НовСтрока.Количество			= Выборка.КоличествоНоменклатуры;
		//-25
		НовСтрока.СтатьяКалькуляции		= ?(ЗначениеЗаполнено(Выборка.СтатьяКалькуляции), Выборка.СтатьяКалькуляции,ДокРецептура.СтатьяКалькуляции);
		НовСтрока.АлгоритмРасчетаКоличества	= ?(ЗначениеЗаполнено(Выборка.АлгоритмРасчетаКоличества), Строка(Выборка.КоличествоУпаковокНоменклатуры), "");
		//+25
		НовСтрока.АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы = НовСтрока.АлгоритмРасчетаКоличества;
		//-25
		//+АвтовыборНоменклатуры
		
		Если Не ЗначениеЗаполнено(Выборка.СпособАвтовыбораНоменклатуры) Тогда
			НовСтрока.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ;
		Иначе	
			НовСтрока.СпособАвтовыбораНоменклатуры		= Выборка.СпособАвтовыбораНоменклатуры; 
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Выборка.СпособАвтовыбораХарактеристики) Тогда
			НовСтрока.СпособАвтовыбораХарактеристики = Перечисления.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ;
		Иначе	
			НовСтрока.СпособАвтовыбораХарактеристики	= Выборка.СпособАвтовыбораХарактеристики;
		КонецЕсли;
		НовСтрока.СвойствоСодержащееНоменклатуру	= Выборка.СвойствоСодержащееНоменклатуру;
		НовСтрока.АлгоритмАвтовыбораХарактеристики	= Выборка.АлгоритмАвтовыбораХарактеристики;
		//-АвтовыборНоменклатуры
		Если ЭтоНоваяСтрока Тогда
			// Значения по умолчанию для реквизитов ТЧ.
			НовСтрока.КлючСвязи							= Выборка.КлючСвязи;
			НовСтрока.ПроизводитсяВПроцессе				= Ложь;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СпособПолученияМатериала", мМетаданныеТЧМатериалыИУслуги) Тогда
				НовСтрока.СпособПолученияМатериала			= Перечисления.СпособыПолученияМатериаловВСпецификации.Обеспечивать;
			КонецЕсли;
			НовСтрока.ИсточникПолученияПолуфабриката	= Справочники.РесурсныеСпецификации.ПустаяСсылка();
		КонецЕсли;
		
		//+ПараметризацияРецептур
		Если НЕ ТаблицаСвойствПустая Тогда
			Если НЕ ЭтоНоваяСтрока Тогда
				// Удалить строки отбора свойств, которые были в специцикации для данной строки.
				СтрокиСвойствСпец = Спецификация.ОтборПоСвойствам.НайтиСтроки(Новый Структура("КлючСвязи", Выборка.КлючСвязи));
				Для каждого ТекСтрокаСвойствСпец Из СтрокиСвойствСпец Цикл
					Спецификация.ОтборПоСвойствам.Удалить(ТекСтрокаСвойствСпец);
				КонецЦикла;
			КонецЕсли;
			// Заполнить строки отбора свойств в спецификации из рецептуры.
			СтрокиСвойств = ТаблицаСвойств.НайтиСтроки(Новый Структура("КлючСвязи", Выборка.КлючСвязи));
			Для каждого ТекСтрокаСвойств Из СтрокиСвойств Цикл
				НовСтрокаСвойствСпец = Спецификация.ОтборПоСвойствам.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрокаСвойствСпец, ТекСтрокаСвойств);
			КонецЦикла;
		КонецЕсли;
		//-ПараметризацияРецептур
		
		//+АвтовыборНоменклатуры
		Если НЕ ТаблицаСвойствАвтовыборПустая Тогда
			Если НЕ ЭтоНоваяСтрока Тогда
				// Удалить строки отбора свойств, которые были в специцикации для данной строки.
				СтрокиСвойствСпец = Спецификация.СоответствиеСвойств.НайтиСтроки(Новый Структура("КлючСвязи", Выборка.КлючСвязи));
				Для каждого ТекСтрокаСвойствСпец Из СтрокиСвойствСпец Цикл
					Спецификация.СоответствиеСвойств.Удалить(ТекСтрокаСвойствСпец);
				КонецЦикла;
			КонецЕсли;
			// Заполнить строки отбора свойств в спецификации из рецептуры.
			СтрокиСвойств = ТаблицаСвойствАвтовыбор.НайтиСтроки(Новый Структура("КлючСвязи", Выборка.КлючСвязи));
			Для каждого ТекСтрокаСвойств Из СтрокиСвойств Цикл
				НовСтрокаСвойствСпец = Спецификация.СоответствиеСвойств.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрокаСвойствСпец, ТекСтрокаСвойств);
			КонецЦикла;
		КонецЕсли;
		//-АвтовыборНоменклатуры
		
		Если ЗначениеЗаполнено(Выборка.Рецептура) Тогда
			
			// Получение спецификации производимого в процессе изделия.
			СпецификацияАвтопередел = Неопределено;
			ПараметрыПолучения = Новый Структура("УпорядочитьПоДатеИНомеру, ФильтрПоТипу", Ложь, "Справочник.РесурсныеСпецификации");
			НайтиТиповойДокументДляДокументапит(Выборка.Рецептура, СпецификацияАвтопередел, , ПараметрыПолучения);
			
			Если НЕ СпецификацияАвтопередел = Неопределено Тогда
				НовСтрока.ПроизводитсяВПроцессе		= Истина;
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СпособПолученияМатериала", мМетаданныеТЧМатериалыИУслуги) Тогда
					НовСтрока.СпособПолученияМатериала	= Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации; // по умолчанию
				КонецЕсли;
				НовСтрока.СтатьяКалькуляции			= Справочники.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе;
				НовСтрока.ИсточникПолученияПолуфабриката = СпецификацияАвтопередел;
			КонецЕсли;
			
		КонецЕсли;
		
		ПерезаполненныеСтроки.Добавить(НовСтрока);
		
	КонецЦикла;
	// Удаление строк, которые не перезаполнялись(они не актуальны).
	СтрокиУдалить = Новый Массив;
	Для каждого ТекСтрокаТЧ Из Спецификация.МатериалыИУслуги Цикл
		Если ПерезаполненныеСтроки.Найти(ТекСтрокаТЧ) = Неопределено Тогда
			СтрокиУдалить.Добавить(ТекСтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	Для каждого ТекСтрокаУдалить Из СтрокиУдалить Цикл
		Спецификация.МатериалыИУслуги.Удалить(ТекСтрокаУдалить);
	КонецЦикла;
	
	Если ДокРецептура.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.РецептураПриготовление Тогда
		// В ТЧ "Выходные измелия" будет 1 строка с номенклатурой из шапки рецептуры.
		НовСтрока = Спецификация.ВыходныеИзделия.Добавить();
		НовСтрока.Номенклатура			= ДокРецептура.Номенклатура;
		НовСтрока.Характеристика		= ДокРецептура.Характеристика;
		НовСтрока.Упаковка				= ДокРецептура.Упаковка;
		НовСтрока.КоличествоУпаковок	= ДокРецептура.КоличествоУпаковок;
		//+25
		//НовСтрока.Количество			= ДокРецептура.Количество;
		Если НовСтрока.КлючСвязи = ПустойУИД Тогда
			НовСтрока.КлючСвязи				= Новый УникальныйИдентификатор;
		КонецЕсли;
		НовСтрока.СпособАвтовыбораНоменклатуры		= Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ;
		НовСтрока.СпособАвтовыбораХарактеристики	= Перечисления.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ;
		НовСтрока.ВидНоменклатуры					= Спецификация.ОсновноеИзделиеВидНоменклатуры;
		//-25
		НовСтрока.ДоляСтоимости			= 1; // В ТЧ "Выходные изделия всегда 1 строка"
	КонецЕсли;
	
	// ТРУДОЗАТРАТЫ
	ПерезаполненныеСтроки = Новый Массив;
	ЭтоНоваяСтрока = Истина;
	Если НЕ РезультатПакет[1].Пустой() Тогда
		ВыборкаТрудозатрат = РезультатПакет[1].Выбрать();
		Пока ВыборкаТрудозатрат.Следующий() Цикл
			
			///////////////////////////////////////////////
			// +Поиск строки в ТЧ.
			ЭтоНоваяСтрока = Истина;
			Если НЕ ЭтоНоваяСпецификация Тогда
				// Поиск в существующей спецификации строки, соответствующей текущей строке рецептуры.
				СП = Новый Структура("ВидРабот,СтатьяКалькуляции");
				ЗаполнитьЗначенияСвойств(СП, ВыборкаТрудозатрат);
				НайденныеСтроки = Спецификация.Трудозатраты.НайтиСтроки(СП);
				НайденныеСтрокиВрем = Новый Массив;
				Для Инд = 0 По НайденныеСтроки.Количество()-1 Цикл
					Если ПерезаполненныеСтроки.Найти(НайденныеСтроки[Инд]) = Неопределено Тогда
						НайденныеСтрокиВрем.Добавить(НайденныеСтроки[Инд]);
					КонецЕсли;
				КонецЦикла;
				НайденныеСтроки = НайденныеСтрокиВрем;
				
				КоличествоНайденных = НайденныеСтроки.Количество();
				Если КоличествоНайденных = 1 Тогда
					// Найдена одна строка, ее и перезаполняем.
					НовТрудозатрата = НайденныеСтроки[0];
					ЭтоНоваяСтрока = Ложь;
				ИначеЕсли КоличествоНайденных > 1 Тогда
					// Найдено несколько строк
					НовТрудозатрата = НайтиСтрокуСМинимальнымЭтапом(НайденныеСтроки);
					ЭтоНоваяСтрока = Ложь;
				Иначе
					// Ничего не найдено, добавить новую строку
					НовТрудозатрата = Спецификация.Трудозатраты.Добавить();
				КонецЕсли;
			Иначе
				// Ничего не найдено, добавить новую строку
				НовТрудозатрата = Спецификация.Трудозатраты.Добавить();
			КонецЕсли;
			// -Поиск строки в ТЧ.
			//////////////////////////////////////////////////////////////
			
			НовТрудозатрата.ВидРабот = ВыборкаТрудозатрат.ВидРабот;
			НовТрудозатрата.Количество = ВыборкаТрудозатрат.Количество;
			НовТрудозатрата.НазначениеРабот = ВыборкаТрудозатрат.НазначениеРабот;
			НовТрудозатрата.СтатьяКалькуляции = ВыборкаТрудозатрат.СтатьяКалькуляции;
			//+25
			Если НовТрудозатрата.КлючСвязи = ПустойУИД Тогда
				НовТрудозатрата.КлючСвязи = Новый УникальныйИдентификатор;
			КонецЕсли;
			//-25
			
			// Если этап не указан, то это означает, что используется для первого по порядку этапа.
			//НовТрудозатрата.Этап = ПроизводственныйПроцессОбъект;
			
			ПерезаполненныеСтроки.Добавить(НовТрудозатрата);
			
		КонецЦикла;
	КонецЕсли;
	// Удаление строк, которые не перезаполнялись(они не актуальны).
	СтрокиУдалить = Новый Массив;
	Для каждого ТекСтрокаТЧ Из Спецификация.Трудозатраты Цикл
		Если ПерезаполненныеСтроки.Найти(ТекСтрокаТЧ) = Неопределено Тогда
			СтрокиУдалить.Добавить(ТекСтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	Для каждого ТекСтрокаУдалить Из СтрокиУдалить Цикл
		Спецификация.Трудозатраты.Удалить(ТекСтрокаУдалить);
	КонецЦикла;
	
	// Побочные выпуски
	ПерезаполненныеСтроки = Новый Массив;
	ЭтоНоваяСтрока = Истина;
	Если НЕ РезультатПакет[2].Пустой() Тогда
		ВыборкаПобочные = РезультатПакет[2].Выбрать();
		Пока ВыборкаПобочные.Следующий() Цикл
			
			///////////////////////////////////////////////
			// +Поиск строки в ТЧ.
			ЭтоНоваяСтрока = Истина;
			Если НЕ ЭтоНоваяСпецификация Тогда
				// Поиск в существующей спецификации строки, соответствующей текущей строке рецептуры.
				СП = Новый Структура("Номенклатура,Характеристика,Упаковка");
				ЗаполнитьЗначенияСвойств(СП, ВыборкаПобочные);
				НайденныеСтроки = Спецификация.ВозвратныеОтходы.НайтиСтроки(СП);
				НайденныеСтрокиВрем = Новый Массив;
				Для Инд = 0 По НайденныеСтроки.Количество()-1 Цикл
					Если ПерезаполненныеСтроки.Найти(НайденныеСтроки[Инд]) = Неопределено Тогда
						НайденныеСтрокиВрем.Добавить(НайденныеСтроки[Инд]);
					КонецЕсли;
				КонецЦикла;
				НайденныеСтроки = НайденныеСтрокиВрем;
				
				КоличествоНайденных = НайденныеСтроки.Количество();
				Если КоличествоНайденных = 1 Тогда
					// Найдена одна строка, ее и перезаполняем.
					НовПобочное = НайденныеСтроки[0];
					ЭтоНоваяСтрока = Ложь;
				ИначеЕсли КоличествоНайденных > 1 Тогда
					// Найдено несколько строк
					НовПобочное = НайтиСтрокуСМинимальнымЭтапом(НайденныеСтроки, 999);
					ЭтоНоваяСтрока = Ложь;
				Иначе
					// Ничего не найдено, добавить новую строку
					НовПобочное = Спецификация.ВозвратныеОтходы.Добавить();
				КонецЕсли;
			Иначе
				// Ничего не найдено, добавить новую строку
				НовПобочное = Спецификация.ВозвратныеОтходы.Добавить();
			КонецЕсли;
			// -Поиск строки в ТЧ.
			//////////////////////////////////////////////////////////////
			
			НовПобочное.Номенклатура		= ВыборкаПобочные.Номенклатура;
			НовПобочное.Характеристика		= ВыборкаПобочные.Характеристика;
			НовПобочное.Упаковка			= ВыборкаПобочные.Упаковка;
			НовПобочное.КоличествоУпаковок	= ВыборкаПобочные.КоличествоУпаковок;
			НовПобочное.СтатьяКалькуляции	= ВыборкаПобочные.СтатьяКалькуляции;
			НовПобочное.СпособАвтовыбораНоменклатуры		= Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ;
			НовПобочное.СпособАвтовыбораХарактеристики	= Перечисления.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ;
			
			// Если этап не указан, то это означает, что используется для последнего по порядку этапа.
			НовПобочное.Этап = Неопределено;
			
			ПерезаполненныеСтроки.Добавить(НовПобочное);
			
		КонецЦикла;
	КонецЕсли;
	// Удаление строк, которые не перезаполнялись(они не актуальны).
	СтрокиУдалить = Новый Массив;
	Для каждого ТекСтрокаТЧ Из Спецификация.ВозвратныеОтходы Цикл
		Если ПерезаполненныеСтроки.Найти(ТекСтрокаТЧ) = Неопределено Тогда
			СтрокиУдалить.Добавить(ТекСтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	Для каждого ТекСтрокаУдалить Из СтрокиУдалить Цикл
		Спецификация.ВозвратныеОтходы.Удалить(ТекСтрокаУдалить);
	КонецЦикла;
	
	//////////////////////////////////
	// ЗАПИСЬ ЭТАПА ПРОИЗВОДСТВА
	
	Если НЕ Спецификация.МногоэтапныйПроизводственныйПроцесс Тогда
		
		//////////////////////////////////
		// Данные по производству
		
		ПроизводственныйПроцессОбъект = ПолучитьОбъектЭтапПроизводства(Спецификация.Ссылка, ЭтоНоваяСпецификация);
		
		ПроизводственныйПроцессОбъект.Владелец =		Спецификация.Ссылка;
		ПроизводственныйПроцессОбъект.Подразделение =	ДокРецептура.Подразделение;
		
		Если НЕ ЗначениеЗаполнено(ПроизводственныйПроцессОбъект.ЕдиницаИзмеренияДлительностиЭтапа) Тогда
			ПроизводственныйПроцессОбъект.ЕдиницаИзмеренияДлительностиЭтапа = Перечисления.ЕдиницыИзмеренияВремени.День;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ПроизводственныйПроцессОбъект.ЕдиницаИзмеренияПредварительногоБуфера) Тогда
			ПроизводственныйПроцессОбъект.ЕдиницаИзмеренияПредварительногоБуфера = Перечисления.ЕдиницыИзмеренияВремени.День;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ПроизводственныйПроцессОбъект.ЕдиницаИзмеренияЗавершающегоБуфера) Тогда
			ПроизводственныйПроцессОбъект.ЕдиницаИзмеренияЗавершающегоБуфера = Перечисления.ЕдиницыИзмеренияВремени.День;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ПроизводственныйПроцессОбъект.ЗанимаемаяМощность) Тогда
			ПроизводственныйПроцессОбъект.ЗанимаемаяМощность = 100;
		КонецЕсли;
		
		Если ЭтоНоваяСпецификация Тогда
			СсылкаНового = Справочники.РесурсныеСпецификации.ПолучитьСсылку();
			ПроизводственныйПроцессОбъект.Владелец = СсылкаНового;
			ПроизводственныйПроцессОбъект.ОбменДанными.Загрузка = Истина;
			Спецификация.УстановитьСсылкуНового(СсылкаНового);
		КонецЕсли;
		
		ПроизводственныйПроцессОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗапись");
		ПроизводственныйПроцессОбъект.НомерЭтапа            = 1;
		ПроизводственныйПроцессОбъект.НомерСледующегоЭтапа  = 0;
		
		Если ПустаяСтрока(ПроизводственныйПроцессОбъект.Наименование) Тогда
			ИмяЭтапа = ?(ДокРецептура.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.РецептураРазделка, 
				"Производство", "Разборка");
			ПроизводственныйПроцессОбъект.Наименование = НСтр(СтрШаблон("ru = '%1'", ИмяЭтапа));
		КонецЕсли;
		
		Попытка
			ПроизводственныйПроцессОбъект.Записать();
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка записи справочника """ + Спецификация.Метаданные().Представление() + """
			| по документу Общепит """+ДокРецептура+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	//////////////////////////////////
	// ЗАПИСЬ СПЕЦИФИКАЦИИ
	
	Попытка
		Спецификация.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		Спецификация.Записать();
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи справочника """ + Спецификация.Метаданные().Представление() + """
		| по документу Общепит """+ДокРецептура+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокРецептура, Спецификация, тблСозданныеДокументы);
	
	Возврат ВсеОк;
	
КонецФункции

Функция НайтиСтрокуСМинимальнымЭтапом(НайденныеСтроки, ТекПорядокПустогоЭтапа = 0)
	
	// Массив этапов производства, по которым будем получать порядок.
	МассивСсылокЭтапов = Новый Массив;
	
	// Поиск строки с минимальным этапом.
	Для каждого ТекНайденнаяСтрока Из НайденныеСтроки Цикл
		Если ЗначениеЗаполнено(ТекНайденнаяСтрока.Этап) Тогда
			МассивСсылокЭтапов.Добавить(ТекНайденнаяСтрока.Этап);
		КонецЕсли;
	КонецЦикла;
	СоответствиеЭтапПорядок = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСсылокЭтапов, "НомерЭтапа");
	МинЭтап = Справочники.ЭтапыПроизводства.ПустаяСсылка();
	МинПорядокЭтап = 0;
	СчетчикСтрок = 0;
	СтрокаМинЭтап = Неопределено;
	Для каждого ТекНайденнаяСтрока Из НайденныеСтроки Цикл
		Если СчетчикСтрок = 0 Тогда
			МинЭтап = ТекНайденнаяСтрока.Этап;
			МинПорядокЭтап = СоответствиеЭтапПорядок.Получить(МинЭтап);
			Если МинПорядокЭтап = Неопределено Тогда
				МинПорядокЭтап = ТекПорядокПустогоЭтапа;
			КонецЕсли;
			СтрокаМинЭтап = ТекНайденнаяСтрока;
		Иначе
			ТекЭтап = ТекНайденнаяСтрока.Этап;
			ТекПорядокЭтап = СоответствиеЭтапПорядок.Получить(ТекЭтап);
			Если ТекПорядокЭтап = Неопределено Тогда
				ТекПорядокЭтап = ТекПорядокПустогоЭтапа;
			КонецЕсли;
			МинПорядокЭтап = Мин(МинПорядокЭтап, ТекПорядокЭтап);
			Если МинПорядокЭтап = ТекПорядокЭтап Тогда
				МинЭтап = ТекЭтап;
				СтрокаМинЭтап = ТекНайденнаяСтрока;
			КонецЕсли;
		КонецЕсли;
		СчетчикСтрок = СчетчикСтрок + 1;
	КонецЦикла;
	Возврат СтрокаМинЭтап;
	
КонецФункции


// Процедура по переданной ссылке на рецептуру ищет типовые элементы справочника "Ресурсные спецификации".
//  Если не находит, то создает для них пустой объект.
//
// Параметры:
//  ДокументРецептура			 - ДокументСсылка	 - Ссылка на документ, для которого ищем "Ресурсные спецификации".
//  выхСпецификация				 - СправочникОбъект	 - Справочник "Ресурсные спецификации".
//
Процедура ПолучитьСпецификациюПоРецептуре(ДокументРецептура, выхСпецификация = Неопределено)
	
	Запрос = Новый Запрос;
	
	// Поиск связанных с рецептурой спецификаций изделия.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Справочник.РесурсныеСпецификации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент КАК Спецификация
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции
	|";
	
	Запрос.УстановитьПараметр("Документпит", ДокументРецептура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документы найдены, то инициализируем соответствующие переменные.
	Пока Выборка.Следующий() Цикл
		выхСпецификация = Выборка.Спецификация.ПолучитьОбъект();
	КонецЦикла;
	
	// Если переменные не инициализированны, значит документы не были найдены
	// и необходимо создать пустые документы-объекты, которые далее будут заполняться.
	Если (выхСпецификация = Неопределено) Тогда
		выхСпецификация = Справочники.РесурсныеСпецификации.СоздатьЭлемент();
	КонецЕсли;
	
КонецПроцедуры

// Процедура по переданной ссылке на спецификацию изделия ищет типовой элементы справочника "ЭтапыПроизводства",
//  владельцем которого является переданная спецификация.
//  Если не находит, то создает для пустой объект.
//
// Параметры:
//  Спецификация			 - СправочникСсылка	 - Ссылка на документ, для которого ищем "Ресурсные спецификации".
//
Функция ПолучитьОбъектЭтапПроизводства(Спецификация, ЭтоНоваяСпецификация = Ложь)
	
	Если ЭтоНоваяСпецификация Тогда
		ОбъектЭтапПроизводства = Справочники.ЭтапыПроизводства.СоздатьЭлемент();
		ОбъектЭтапПроизводства.Владелец = Спецификация;
		Возврат ОбъектЭтапПроизводства;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Этапы.Ссылка
	|ИЗ
	|	Справочник.ЭтапыПроизводства КАК Этапы
	|ГДЕ
	|	НЕ Этапы.ПометкаУдаления
	|	И Этапы.Владелец = &Спецификация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этапы.Ссылка";
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбъектЭтапПроизводства = Справочники.ЭтапыПроизводства.СоздатьЭлемент();
		ОбъектЭтапПроизводства.Владелец = Спецификация;
		Возврат ОбъектЭтапПроизводства;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	ОбъектЭтапПроизводства = Выборка.Ссылка.ПолучитьОбъект();
	ОбъектЭтапПроизводства.Владелец = Спецификация;
	
	Возврат ОбъектЭтапПроизводства;
	
КонецФункции

#КонецОбласти

#Область ФормированиеТиповыхДокументовПоРегистрацииЗамен

// Процедура формирования типовых документов по переданному выпуску блюд.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоРегистрацииЗамен(ДокРегистрацияЗамен, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	ВсеОк = Истина;
	
	ЭтоЕРП = питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "УправлениеПредприятием" 
		ИЛИ питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "ERPWE"
		ИЛИ питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "УправлениеПредприятиемДляБеларуси";
	ЭтоКА = питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "КомплекснаяАвтоматизация";
	
	Если ЭтоЕРП Тогда
		
		///////////////////////////////////////////////////
		// Разрешения на замену материалов
		ВсеОк = СформироватьРазрешенияНаЗаменуПоРегистрацииЗамен(ДокРегистрацияЗамен, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
	КонецЕсли;
	
	///////////////////////////////////////////////////
	// Разрешения на замену материалов
	
	ВсеОк = ОбновитьКоэффициентДокументаИсточникаПоРегистрацииЗамен(ДокРегистрацияЗамен, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	Если НЕ ВсеОк Тогда 
		Возврат ВсеОк;
	КонецЕсли;
	
	ВсеОк = СформироватьРегистрацииЗаменПоРегистрацииЗамен(ДокРегистрацияЗамен, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	Если НЕ ВсеОк Тогда 
		Возврат ВсеОк;
	КонецЕсли;
	
	Возврат ВсеОк;
	
КонецФункции

// Функция формирует документы "Разрешения на замену".
//
// Параметры:
//  ДокРегистрацияЗамен		 - ДокументСсылка	 - Ссылка на документ "Регистрация замен", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция ОбновитьКоэффициентДокументаИсточникаПоРегистрацииЗамен(ДокРегистрацияЗамен, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Перем ДатаФормированияПотребности, мМетаданныеТиповогоОбъекта, мМетаданныеТЧ, НовСтр, ПараметрыЗаписи, Стр, ТекРежимЗаписи;
	
	ВсеОк = Истина;
	
	Если НЕ Константы.питОбновлятьКоэффициентДокументаИсточникаПоРегистрацииЗамен.Получить() Тогда
		Возврат ВсеОк;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	питРегистрацияЗаменЗаменители.Коэффициент КАК Коэффициент,
	|	питРегистрацияЗаменЗаменители.Ссылка.Номенклатура КАК Заменяемое,
	|	питРегистрацияЗаменЗаменители.Ссылка.Характеристика КАК ЗаменяемоеХарактеристика,
	|	питРегистрацияЗаменЗаменители.ИсточникОбратимости КАК ИсточникОбратимости
	|ПОМЕСТИТЬ втПодкладнойДок
	|ИЗ
	|	Документ.питРегистрацияЗамен.Заменители КАК питРегистрацияЗаменЗаменители
	|ГДЕ
	|	питРегистрацияЗаменЗаменители.Ссылка = &Ссылка
	|	И питРегистрацияЗаменЗаменители.Обратимость
	|	И НЕ питРегистрацияЗаменЗаменители.ИсточникОбратимости = ЗНАЧЕНИЕ(Документ.питРегистрацияЗамен.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПодкладнойДок.Заменяемое КАК Заменяемое,
	|	втПодкладнойДок.ЗаменяемоеХарактеристика КАК ЗаменяемоеХарактеристика,
	|	втПодкладнойДок.Коэффициент КАК Коэффициент,
	|	питРегистрацияЗаменЗаменители.Коэффициент КАК КоэффициентИсходногоДока,
	|	втПодкладнойДок.ИсточникОбратимости КАК ИсходныйДок
	|ИЗ
	|	втПодкладнойДок КАК втПодкладнойДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питРегистрацияЗамен.Заменители КАК питРегистрацияЗаменЗаменители
	|		ПО втПодкладнойДок.ИсточникОбратимости = питРегистрацияЗаменЗаменители.Ссылка
	|			И втПодкладнойДок.Заменяемое = питРегистрацияЗаменЗаменители.Номенклатура
	|			И втПодкладнойДок.ЗаменяемоеХарактеристика = питРегистрацияЗаменЗаменители.Характеристика";
	Запрос.УстановитьПараметр("Ссылка", ДокРегистрацияЗамен);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		НовыйКэф = 1/Выборка.Коэффициент;
		Если НовыйКэф <> Выборка.КоэффициентИсходногоДока Тогда
			ТекДокументОбъект = Выборка.ИсходныйДок.ПолучитьОбъект();
			СтрокиИсходногоДока = ТекДокументОбъект.Заменители.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Выборка.Заменяемое,Выборка.ЗаменяемоеХарактеристика));
			Если СтрокиИсходногоДока.Количество() Тогда
				СтрокиИсходногоДока[0].Коэффициент = НовыйКэф;
			КонецЕсли;
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питБезОбновленияПодкладныхДокументов",Истина);
				ТекДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка обновления документа """ + ТекДокументОбъект.Метаданные().Представление() + """
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документы "Разрешения на замену".
//
// Параметры:
//  ДокРегистрацияЗамен		 - ДокументСсылка	 - Ссылка на документ "Регистрация замен", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьРазрешенияНаЗаменуПоРегистрацииЗамен(ДокРегистрацияЗамен, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Перем ДатаФормированияПотребности, мМетаданныеТиповогоОбъекта, мМетаданныеТЧ, НовСтр, ПараметрыЗаписи, Стр, ТекРежимЗаписи;
	
	ДокРазрешениеНаЗамену = Неопределено;
	ВсеОк = Истина;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент КАК ТиповойДокумент,
	|	питТиповыеДокументы.ТиповойДокумент.Проведен КАК Проведен,
	|	питТиповыеДокументы.ТиповойДокумент.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Ссылка
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.РазрешениеНаЗаменуМатериалов";
	Запрос.УстановитьПараметр("Ссылка", ДокРегистрацияЗамен);
	
	ВыборкаСуществующиеТиповыеДокументы		= Запрос.Выполнить().Выбрать();	// Существующие типовые доки.
	
	Пока ВыборкаСуществующиеТиповыеДокументы.Следующий() Цикл
		Если ВыборкаСуществующиеТиповыеДокументы.Проведен Тогда
			ТекДокументОбъект = ВыборкаСуществующиеТиповыеДокументы.ТиповойДокумент.ПолучитьОбъект();
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка отмены проведения документа """ + ТекДокументОбъект.Метаданные().Представление() + """
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	ВыборкаСуществующиеТиповыеДокументы.Сбросить();
	
	Если Константы.питФормироватьРазрешенияНаЗаменуПоРегистрациямЗамен.Получить() Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	питРегистрацияЗамен.Дата КАК Дата,
		|	питРегистрацияЗамен.Проведен КАК Проведен,
		|	питРегистрацияЗамен.Номенклатура КАК Заменяемое,
		|	питРегистрацияЗамен.Характеристика КАК ЗаменяемоеХарактеристика,
		|	питРегистрацияЗамен.Ответственный КАК Ответственный,
		|	питРегистрацияЗамен.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	питРегистрацияЗамен.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	питРегистрацияЗамен.Комментарий КАК Комментарий,
		|	питРегистрацияЗамен.ПометкаУдаления КАК ПометкаУдаления,
		|	питРегистрацияЗамен.Представление КАК Представление,
		|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Документ.питРегистрацияЗамен КАК питРегистрацияЗамен
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО питРегистрацияЗамен.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	питРегистрацияЗамен.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	питРегистрацияЗаменЗаменители.Номенклатура КАК Заменитель,
		|	питРегистрацияЗаменЗаменители.Характеристика КАК ЗаменительХарактеристика,
		|	питРегистрацияЗаменЗаменители.Коэффициент КАК Коэффициент,
		|	питРегистрацияЗаменЗаменители.Приоритет КАК Приоритет,
		|	питРегистрацияЗаменЗаменители.Обратимость КАК Обратимость,
		|	СпрНоменклатураЗаменители.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Документ.питРегистрацияЗамен.Заменители КАК питРегистрацияЗаменЗаменители
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатураЗаменители
		|		ПО питРегистрацияЗаменЗаменители.Номенклатура = СпрНоменклатураЗаменители.Ссылка
		|ГДЕ
		|	питРегистрацияЗаменЗаменители.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	питРегистрацияЗаменПодразделения.Подразделение КАК Подразделение,
		|	питРегистрацияЗаменПодразделения.ВключаяПодчиненные КАК ВключаяПодчиненные
		|ИЗ
		|	Документ.питРегистрацияЗамен.Подразделения КАК питРегистрацияЗаменПодразделения
		|ГДЕ
		|	питРегистрацияЗаменПодразделения.Ссылка = &Ссылка
		|";
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаШапка							= РезультатЗапроса[0].Выбрать();	// Шапка
		ВыборкаШапка.Следующий();
		ВыборкаЗаменители						= РезультатЗапроса[1].Выбрать();	// Заменители
		ТаблицаПодразделения					= РезультатЗапроса[2].Выгрузить();	// Подразделения
		
		// Структура текущего типового дока.
		ТекТиповойДокумент = Новый Структура("ТиповойДокумент,ПометкаУдаления,Проведен");
		
		// Получение всех подразделений, включая подчиненные.
		ВсеПодразделения = питПроизводство.НайтиПодразделенияПоРазрешенным(ТаблицаПодразделения);
		Для каждого ТекПодразделение Из ВсеПодразделения Цикл
			
			ТекДокументОбъект = Неопределено;
			
			// Выборка по типовым.
			// Если документ существует, тогда заполняем его данными структуру,
			// иначе - заполняем значениями по умолчанию.
			Если ВыборкаСуществующиеТиповыеДокументы.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ТекТиповойДокумент,ВыборкаСуществующиеТиповыеДокументы);
			Иначе
				ТекТиповойДокумент.ТиповойДокумент = Документы.РазрешениеНаЗаменуМатериалов.ПустаяСсылка();
				ТекТиповойДокумент.ПометкаУдаления = Ложь;
				ТекТиповойДокумент.Проведен = Ложь;
			КонецЕсли;
			
			////////////////////////////
			// Определение режима записи
			ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ВыборкаШапка.Проведен,ВыборкаШапка.ПометкаУдаления
			,ТекТиповойДокумент.Проведен,ТекТиповойДокумент.ПометкаУдаления,СтруктураПараметров);
			ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
			////////////////////////////
			
			// Если тек списание затрат не было найдено, то создаем новый объект.
			Если ТекТиповойДокумент.ТиповойДокумент = Документы.РазрешениеНаЗаменуМатериалов.ПустаяСсылка() Тогда
				ТекДокументОбъект = Документы.РазрешениеНаЗаменуМатериалов.СоздатьДокумент();
			Иначе
				ТекДокументОбъект = ТекТиповойДокумент.ТиповойДокумент.ПолучитьОбъект();
				
				// Если нужно установить пометку удаления, то перед синхронизацией сделаем это.
				Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
					
					// Помечаем на удаление / снимаем пометку в док. "Списание затрат...".
					Попытка
						ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
						ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
					Исключение
						ТекстОшибки = ТекстОшибки + "
						|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
						| по документу Общепит """+ВыборкаШапка.Представление+"""
						|по причине: <"+ОписаниеОшибки()+">";
						Возврат Ложь;
					КонецПопытки;
					
				КонецЕсли;
				
				// Очистка табличных частей для избежания дублирования информации.
				ТекДокументОбъект.Материалы.Очистить();
				ТекДокументОбъект.Аналоги.Очистить();
				ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
				
			КонецЕсли;
			
			// Заполнение шапки.
			ТекДокументОбъект.Дата					= ВыборкаШапка.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
			ТекДокументОбъект.Подразделение			= ТекПодразделение;
			ТекДокументОбъект.Ответственный			= ВыборкаШапка.Ответственный;
			ТекДокументОбъект.УказаниеПоПрименению	= "Введен автоматически по документу ""Общепит"" <"+ВыборкаШапка.Представление+">";
			ТекДокументОбъект.ЗаказНаПроизводство	= Неопределено;
			ТекДокументОбъект.Спецификация			= Неопределено;
			ТекДокументОбъект.Изделие				= Неопределено;
			ТекДокументОбъект.ХарактеристикаИзделия	= Неопределено;
			ТекДокументОбъект.ЗаказКлиента			= Неопределено;
			ТекДокументОбъект.ДатаНачалаДействия	= ВыборкаШапка.ДатаНачалаДействия;
			ТекДокументОбъект.ДатаОкончанияДействия	= ВыборкаШапка.ДатаОкончанияДействия;
			ТекДокументОбъект.Статус				= Перечисления.СтатусыРазрешенийНаЗаменуМатериалов.Утверждено;
			ТекДокументОбъект.Комментарий			= ВыборкаШапка.Комментарий;
			
			Пока ВыборкаЗаменители.Следующий() Цикл
				НовСтрокаАналоги = ТекДокументОбъект.Аналоги.Добавить();
				НовСтрокаАналоги.Номенклатура			= ВыборкаЗаменители.Заменитель;
				НовСтрокаАналоги.Характеристика			= ВыборкаЗаменители.ЗаменительХарактеристика;
				//+25
				//НовСтрокаАналоги.Количество				= ВыборкаЗаменители.Коэффициент;
				//-25
				НовСтрокаАналоги.КоличествоУпаковок		= ВыборкаЗаменители.Коэффициент;
				НовСтрокаАналоги.Упаковка				= ВыборкаЗаменители.ЕдиницаИзмерения;
			КонецЦикла;
			ВыборкаЗаменители.Сбросить();
			
			НовСтрокаАналоги = ТекДокументОбъект.Материалы.Добавить();
			НовСтрокаАналоги.Номенклатура				= ВыборкаШапка.Заменяемое;
			НовСтрокаАналоги.Характеристика				= ВыборкаШапка.ЗаменяемоеХарактеристика;
			//+25
			//НовСтрокаАналоги.Количество					= 1;
			//-25
			НовСтрокаАналоги.КоличествоУпаковок			= 1;
			НовСтрокаАналоги.Упаковка					= ВыборкаШапка.ЕдиницаИзмерения;
			
			// Запись заполненного документа.
			Если НЕ ТекДокументОбъект = Неопределено Тогда
				
				Попытка
					Если НЕ ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда // Отмена проведения произошла ранее
						ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
						ТекДокументОбъект.Записать(ТекРежимЗаписи);
					КонецЕсли;
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ВыборкаШапка.Представление+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
				// Добавление записи в результирующую таблицу в случае успешной записи документов.
				ДобавитьНовуюЗапись(ДокРегистрацияЗамен, ТекДокументОбъект, тблСозданныеДокументы);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// "Обнуление" переменной текущего объекта.
	ТекДокументОбъект = Неопределено;
	
	// Если остались лишние типовые документы, то нужно пометить их на удаление.
	Пока ВыборкаСуществующиеТиповыеДокументы.Следующий() Цикл
		
		ТекДокументОбъект = ВыборкаСуществующиеТиповыеДокументы.ТиповойДокумент.ПолучитьОбъект();
		
		// Помечаем на удаление "Производство без заказа", если он еще не помечен.
		Если НЕ ВыборкаСуществующиеТиповыеДокументы.ПометкаУдаления Тогда
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(Истина);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ВыборкаШапка.Представление+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
		
		// Добавление записи в результирующую таблицу.
		ДобавитьНовуюЗапись(ДокРегистрацияЗамен, ТекДокументОбъект, тблСозданныеДокументы);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документы "Разрешения на замену".
//
// Параметры:
//  ДокРегистрацияЗамен		 - ДокументСсылка	 - Ссылка на документ "Регистрация замен", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьРегистрацииЗаменПоРегистрацииЗамен(ДокРегистрацияЗамен, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Перем ДатаФормированияПотребности, мМетаданныеТиповогоОбъекта, мМетаданныеТЧ, НовСтр, ПараметрыЗаписи, Стр, ТекРежимЗаписи;
	
	ВсеОк = Истина;
	
	// 1. Выбираются существующие связанные документы
	// 2. Выбираются данные шапки из связанных документов
	// 3. Делается матрица Данные шапки + Данные ТЧ "Заменители" в найденных документах.
	// 4. Выбирается шапка исходного документа
	// 5. Выбирается ТЧ "Заменители" исходного документа + ТЧ "Заменители" найденных документов. Итоги по Заменителям из исходного дока.
	// 6. Выбираются подразделения исходногодокумента
	// 7. Выбираются найденные документы.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(питТиповыеДокументы.ТиповойДокумент КАК Документ.питРегистрацияЗамен) КАК ТиповойДокумент
	|ПОМЕСТИТЬ втТиповые
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Ссылка
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.питРегистрацияЗамен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТиповые.ТиповойДокумент КАК ТиповойДокумент,
	|	втТиповые.ТиповойДокумент.Проведен КАК Проведен,
	|	втТиповые.ТиповойДокумент.ПометкаУдаления КАК ПометкаУдаления,
	|	втТиповые.ТиповойДокумент.Номенклатура КАК Заменяемое,
	|	втТиповые.ТиповойДокумент.Характеристика КАК ЗаменяемоеХарактеристика,
	|	втТиповые.ТиповойДокумент.ДокументИсточник КАК ДокументИсточник
	|ПОМЕСТИТЬ втДанныеТиповые
	|ИЗ
	|	втТиповые КАК втТиповые
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТиповые.ТиповойДокумент КАК ТиповойДокумент,
	|	втТиповые.ТиповойДокумент.ПометкаУдаления КАК ПометкаУдаления,
	|	втТиповые.ТиповойДокумент.Проведен КАК Проведен,
	|	втТиповые.ТиповойДокумент.Номенклатура КАК Заменяемое,
	|	втТиповые.ТиповойДокумент.Характеристика КАК ЗаменяемоеХарактеристика,
	|	питРегистрацияЗаменЗаменители.Номенклатура КАК Заменитель,
	|	питРегистрацияЗаменЗаменители.Характеристика КАК ЗаменительХарактеристика,
	|	питРегистрацияЗаменЗаменители.Коэффициент КАК Коэффициент,
	|	питРегистрацияЗаменЗаменители.Приоритет КАК Приоритет,
	|	питРегистрацияЗаменЗаменители.Обратимость КАК Обратимость,
	|	питРегистрацияЗаменЗаменители.ИсточникОбратимости КАК ИсточникОбратимости
	|ПОМЕСТИТЬ втСущЗамены
	|ИЗ
	|	втТиповые КАК втТиповые
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питРегистрацияЗамен.Заменители КАК питРегистрацияЗаменЗаменители
	|		ПО втТиповые.ТиповойДокумент = питРегистрацияЗаменЗаменители.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРегистрацияЗамен.Дата КАК Дата,
	|	питРегистрацияЗамен.Проведен КАК Проведен,
	|	питРегистрацияЗамен.Номенклатура КАК Заменяемое,
	|	питРегистрацияЗамен.Характеристика КАК ЗаменяемоеХарактеристика,
	|	питРегистрацияЗамен.Ответственный КАК Ответственный,
	|	питРегистрацияЗамен.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	питРегистрацияЗамен.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	питРегистрацияЗамен.Комментарий КАК Комментарий,
	|	питРегистрацияЗамен.ПометкаУдаления КАК ПометкаУдаления,
	|	питРегистрацияЗамен.Представление КАК Представление
	|ИЗ
	|	Документ.питРегистрацияЗамен КАК питРегистрацияЗамен
	|ГДЕ
	|	питРегистрацияЗамен.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРегистрацияЗаменЗаменители.Номенклатура КАК Заменитель,
	|	питРегистрацияЗаменЗаменители.Характеристика КАК ЗаменительХарактеристика,
	|	питРегистрацияЗаменЗаменители.Коэффициент КАК Коэффициент,
	|	питРегистрацияЗаменЗаменители.Приоритет КАК Приоритет,
	|	питРегистрацияЗаменЗаменители.Обратимость КАК Обратимость,
	|	питРегистрацияЗаменЗаменители.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(втТЧ.Заменитель, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ТиповойЗаменитель,
	|	ЕСТЬNULL(втТЧ.ЗаменительХарактеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ТиповойЗаменительХарактеристика,
	|	ЕСТЬNULL(втТЧ.Коэффициент, 1) КАК ТиповойКоэффициент,
	|	ЕСТЬNULL(втТЧ.Приоритет, 1) КАК ТиповойПриоритет,
	|	ЕСТЬNULL(втТЧ.Обратимость, ЛОЖЬ) КАК ТиповойОбратимость,
	|	ЕСТЬNULL(втТЧ.ИсточникОбратимости, ЗНАЧЕНИЕ(Документ.питРегистрацияЗамен.ПустаяСсылка)) КАК ТиповойИсточникОбратимости
	|ИЗ
	|	Документ.питРегистрацияЗамен.Заменители КАК питРегистрацияЗаменЗаменители
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСущЗамены КАК втТЧ
	|		ПО питРегистрацияЗаменЗаменители.Номенклатура = втТЧ.Заменяемое
	|			И питРегистрацияЗаменЗаменители.Характеристика = втТЧ.ЗаменяемоеХарактеристика
	|ГДЕ
	|	питРегистрацияЗаменЗаменители.Ссылка = &Ссылка
	|	И питРегистрацияЗаменЗаменители.Обратимость
	|	И питРегистрацияЗаменЗаменители.ИсточникОбратимости = ЗНАЧЕНИЕ(Документ.питРегистрацияЗамен.ПустаяСсылка)
	|ИТОГИ
	|	МАКСИМУМ(Коэффициент),
	|	МАКСИМУМ(Приоритет)
	|ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питРегистрацияЗаменПодразделения.Подразделение КАК Подразделение,
	|	питРегистрацияЗаменПодразделения.ВключаяПодчиненные КАК ВключаяПодчиненные
	|ИЗ
	|	Документ.питРегистрацияЗамен.Подразделения КАК питРегистрацияЗаменПодразделения
	|ГДЕ
	|	питРегистрацияЗаменПодразделения.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСущЗамены.ТиповойДокумент КАК ТиповойДокумент,
	|	втСущЗамены.ПометкаУдаления КАК ПометкаУдаления,
	|	втСущЗамены.Проведен КАК Проведен
	|ИЗ
	|	втСущЗамены КАК втСущЗамены";
	Запрос.УстановитьПараметр("Ссылка", ДокРегистрацияЗамен);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка							= РезультатЗапроса[3].Выбрать();	// Шапка
	ВыборкаШапка.Следующий();
	ВыборкаЗаменителиНоменклатура			= РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	// Заменители
	ВыборкаПодразделения					= РезультатЗапроса[5].Выбрать();	// Подразделения
	ВыборкаСуществующиеТиповыеДокументы		= РезультатЗапроса[6].Выбрать();
	
	// Отмена проведения существующих доков.
	Пока ВыборкаСуществующиеТиповыеДокументы.Следующий() Цикл
		Если ВыборкаСуществующиеТиповыеДокументы.Проведен Тогда
			ТекДокументОбъект = ВыборкаСуществующиеТиповыеДокументы.ТиповойДокумент.ПолучитьОбъект();
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка отмены проведения документа """ + ТекДокументОбъект.Метаданные().Представление() + """
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	ВыборкаСуществующиеТиповыеДокументы.Сбросить();
	
	// Структура текущего типового дока.
	ТекТиповойДокумент = Новый Структура("ТиповойДокумент,ПометкаУдаления,Проведен");
	
	// Обход Заменителей(По группировкам).
	// Для каждой группировки Заменитель,ХарактеристикаЗаменителя из исходного документа(для которых стоит флаг ""Обратимость"")
	//  создается подкладной документ "Регистрация замен" или используется существующий из списка существующих.
	Пока ВыборкаЗаменителиНоменклатура.Следующий() Цикл // Ном-ра
		ВыборкаЗаменителиХарактеристика = ВыборкаЗаменителиНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗаменителиХарактеристика.Следующий() Цикл
			
			ТекДокументОбъект = Неопределено;
			
			// Выборка по типовым.
			// Если документ существует, тогда заполняем его данными структуру,
			// иначе - заполняем значениями по умолчанию.
			Если ВыборкаСуществующиеТиповыеДокументы.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ТекТиповойДокумент,ВыборкаСуществующиеТиповыеДокументы);
			Иначе
				ТекТиповойДокумент.ТиповойДокумент = Документы.питРегистрацияЗамен.ПустаяСсылка();
				ТекТиповойДокумент.ПометкаУдаления = Ложь;
				ТекТиповойДокумент.Проведен = Ложь;
			КонецЕсли;
			
			////////////////////////////
			// Определение режима записи
			ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ВыборкаШапка.Проведен,ВыборкаШапка.ПометкаУдаления
			,ТекТиповойДокумент.Проведен,ТекТиповойДокумент.ПометкаУдаления,СтруктураПараметров);
			ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
			////////////////////////////
			
			// Если тек документ не был найден, то создаем новый объект.
			Если ТекТиповойДокумент.ТиповойДокумент = Документы.питРегистрацияЗамен.ПустаяСсылка() Тогда
				ТекДокументОбъект = Документы.питРегистрацияЗамен.СоздатьДокумент();
			Иначе
				ТекДокументОбъект = ТекТиповойДокумент.ТиповойДокумент.ПолучитьОбъект();
				
				// Если нужно установить пометку удаления, то перед синхронизацией сделаем это.
				Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
					
					// Помечаем на удаление / снимаем пометку в док. "Списание затрат...".
					Попытка
						ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
						ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
					Исключение
						ТекстОшибки = ТекстОшибки + "
						|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
						| по документу Общепит """+ВыборкаШапка.Представление+"""
						|по причине: <"+ОписаниеОшибки()+">";
						Возврат Ложь;
					КонецПопытки;
					
				КонецЕсли;
				
				// Очистка табличных частей для избежания дублирования информации.
				ТекДокументОбъект.Заменители.Очистить();
				ТекДокументОбъект.Подразделения.Очистить();
				
			КонецЕсли;
			
			// Заполнение шапки.
			// У подкладного документа в качестве заменяемого выступает заменитель из ТЧ "Заменители" с флагом "Обратимость".
			ТекДокументОбъект.Дата						= ВыборкаШапка.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
			ТекДокументОбъект.Номенклатура				= ВыборкаЗаменителиХарактеристика.Заменитель;
			ТекДокументОбъект.Характеристика			= ВыборкаЗаменителиХарактеристика.ЗаменительХарактеристика;
			ТекДокументОбъект.Ответственный				= ВыборкаШапка.Ответственный;
			ТекДокументОбъект.ДатаНачалаДействия		= ВыборкаШапка.ДатаНачалаДействия;
			ТекДокументОбъект.ДатаОкончанияДействия		= ВыборкаШапка.ДатаОкончанияДействия;
			ТекДокументОбъект.Комментарий				= ВыборкаШапка.Комментарий;
			ТекДокументОбъект.ДокументИсточник			= ДокРегистрацияЗамен;
			
			ВыборкаЗаменители = ВыборкаЗаменителиХарактеристика.Выбрать();
			ОбратимостьВключенаВДок = Ложь;
			Пока ВыборкаЗаменители.Следующий() Цикл
				
				// Детальные записи, обход заменителей в подкладном документе.
				// Для строки заменителя, которая соответствует заменяемому в основном документе обновляем все данные
				// Для остальных строк переносим 1к1
				// Если нет связанных данных, то добавляется 1 строка - данные из шапки исходного документа.
				НовСтрокаЗаменители							= ТекДокументОбъект.Заменители.Добавить();
				Если (ВыборкаШапка.Заменяемое = ВыборкаЗаменители.ТиповойЗаменитель 
					И ВыборкаШапка.ЗаменяемоеХарактеристика = ВыборкаЗаменители.ТиповойЗаменительХарактеристика)
					ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЗаменители.ТиповойЗаменитель) Тогда
					ОбратимостьВключенаВДок = Истина;
					НовСтрокаЗаменители.Номенклатура			= ВыборкаШапка.Заменяемое;
					НовСтрокаЗаменители.Характеристика			= ВыборкаШапка.ЗаменяемоеХарактеристика;
					НовСтрокаЗаменители.Коэффициент				= 1/ВыборкаЗаменители.Коэффициент;
					НовСтрокаЗаменители.Приоритет				= ?(ВыборкаЗаменители.ТиповойПриоритет>1,ВыборкаЗаменители.ТиповойПриоритет,ВыборкаЗаменители.Приоритет);
					НовСтрокаЗаменители.Обратимость				= Истина;
					НовСтрокаЗаменители.ИсточникОбратимости		= ДокРегистрацияЗамен;
				Иначе
					НовСтрокаЗаменители.Номенклатура			= ВыборкаЗаменители.ТиповойЗаменитель;
					НовСтрокаЗаменители.Характеристика			= ВыборкаЗаменители.ТиповойЗаменительХарактеристика;
					НовСтрокаЗаменители.Коэффициент				= ВыборкаЗаменители.ТиповойКоэффициент;
					НовСтрокаЗаменители.Приоритет				= ВыборкаЗаменители.ТиповойПриоритет;
					НовСтрокаЗаменители.Обратимость				= ВыборкаЗаменители.ТиповойОбратимость;
					НовСтрокаЗаменители.ИсточникОбратимости		= ВыборкаЗаменители.ТиповойИсточникОбратимости;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ОбратимостьВключенаВДок Тогда
				НовСтрокаЗаменители							= ТекДокументОбъект.Заменители.Добавить();
				НовСтрокаЗаменители.Номенклатура			= ВыборкаШапка.Заменяемое;
				НовСтрокаЗаменители.Характеристика			= ВыборкаШапка.ЗаменяемоеХарактеристика;
				НовСтрокаЗаменители.Коэффициент				= 1/ВыборкаЗаменителиХарактеристика.Коэффициент;
				НовСтрокаЗаменители.Приоритет				= 1;
				НовСтрокаЗаменители.Обратимость				= Истина;
				НовСтрокаЗаменители.ИсточникОбратимости		= ДокРегистрацияЗамен;
			КонецЕсли;
			
			// Заполнение ТЧ "Подразделения"
			Пока ВыборкаПодразделения.Следующий() Цикл
				НовСтрокаПодразделения = ТекДокументОбъект.Подразделения.Добавить();
				НовСтрокаПодразделения.Подразделение		= ВыборкаПодразделения.Подразделение;
				НовСтрокаПодразделения.ВключаяПодчиненные	= ВыборкаПодразделения.ВключаяПодчиненные;
			КонецЦикла;
			ВыборкаПодразделения.Сбросить();
			
			// Запись заполненного документа.
			Если НЕ ТекДокументОбъект = Неопределено Тогда
				
				Попытка
					Если НЕ ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда // Отмена проведения произошла ранее
						ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
						ТекДокументОбъект.Записать(ТекРежимЗаписи);
					КонецЕсли;
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ВыборкаШапка.Представление+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
				
				// Добавление записи в результирующую таблицу в случае успешной записи документов.
				ДобавитьНовуюЗапись(ДокРегистрацияЗамен, ТекДокументОбъект, тблСозданныеДокументы);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	// "Обнуление" переменной текущего объекта.
	ТекДокументОбъект = Неопределено;
	
	// Если остались лишние типовые документы.
	СПЗаменители = Новый Структура("Номенклатура, Характеристика");
	Пока ВыборкаСуществующиеТиповыеДокументы.Следующий() Цикл
		
		ТекДокументОбъект = ВыборкаСуществующиеТиповыеДокументы.ТиповойДокумент.ПолучитьОбъект();
		
		// Если в заменителях незаиспользованного документа больше 1 строки, то удалим строку, которая соответствует исходному доку и отвяжем такой док
		// от исходного.
		Если ТекДокументОбъект.Заменители.Количество() > 1 Тогда
			
			// У оставшегося неиспользованным документа удалим строки из заменителей, которая соответствует заменяемому из шапки основного документа.
			СПЗаменители.Номенклатура				= ВыборкаШапка.Заменяемое;
			СПЗаменители.Характеристика				= ВыборкаШапка.ЗаменяемоеХарактеристика;
			НайденныеЗаменители = ТекДокументОбъект.Заменители.НайтиСтроки(СПЗаменители);
			Если НайденныеЗаменители.Количество() Тогда
				ТекДокументОбъект.Заменители.Удалить(НайденныеЗаменители[0]);
			КонецЕсли;
			
			ТекДокументОбъект.ДокументИсточник = Неопределено;
			
			Если ВыборкаСуществующиеТиповыеДокументы.Проведен Тогда
				РежимОтвязываемогоДокумента = РежимЗаписиДокумента.Проведение;
			Иначе
				РежимОтвязываемогоДокумента = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.Записать(РежимОтвязываемогоДокумента);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ВыборкаШапка.Представление+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
			// Отвязываем док.
			ВсеОк = УдалитьСвязьТиповогоДокументаСДокументомПит(ТекДокументОбъект.Ссылка,ДокРегистрацияЗамен,ТекстОшибки);
			Если НЕ ВсеОк Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Возврат ВсеОк;
			КонецЕсли;
			
		Иначе
			
			// Иначе помечаем док на удаление.
			
			
			Если НЕ ВыборкаСуществующиеТиповыеДокументы.ПометкаУдаления Тогда
				Попытка
					ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокументОбъект.УстановитьПометкуУдаления(Истина);
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
					| по документу Общепит """+ВыборкаШапка.Представление+"""
					|по причине: <"+ОписаниеОшибки()+">";
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
			
			// Добавление записи в результирующую таблицу.
			ДобавитьНовуюЗапись(ДокРегистрацияЗамен, ТекДокументОбъект, тблСозданныеДокументы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ФормированиеТиповыхДокументовПоИнвентаризацииТоваровОбщепита

// Процедура формирования типовых документов по переданному документу инвентаризации.
//
// Параметры:
//  ДокИнвентаризация		 - ДокументСсылка	 - Ссылка на документ "питИнвентаризацияТоваров", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоИнвентаризацииТоваровОбщепит(ДокИнвентаризация, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	ВсеОк = Истина;
	
	ВсеОк = СформироватьПересчетТоваровПоИнвентаризацииОбщепит(ДокИнвентаризация, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	Если НЕ ВсеОк Тогда 
		Возврат ВсеОк;
	КонецЕсли;
	
	Если Константы.питФормироватьСкладскиеАктыПоИнвентаризацииТоваров.Получить() Тогда
		
		ВсеОк = СформироватьОприходованиеИзлишковПоИнвентаризацииОбщепит(ДокИнвентаризация, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
		ВсеОк = СформироватьСписаниеНедостачПоИнвентаризацииОбщепит(ДокИнвентаризация, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
	Иначе
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокИнвентаризация, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "СписаниеНедостачТоваров") Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокИнвентаризация, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ОприходованиеИзлишковТоваров") Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВсеОк;
	
КонецФункции

// Функция формирует документ "ПересчетТоваров" для инвентаризации.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьПересчетТоваровПоИнвентаризацииОбщепит(ДокументОбщепит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	//<< Портал-Юг, Свинцов И.И., 2019.03.26 [5.3.6 Чтение и изменение данных инвентаризации товаров]
	Если ТипЗнч(ДокументОбщепит) = Тип("ДокументСсылка.питИнвентаризацияТоваров") Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	//>> Портал-Юг, Свинцов И.И., 2019.03.26	
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Списание недостач товаров",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ПересчетТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции";
	Запрос.УстановитьПараметр("Документпит",				ДокументОбщепит);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
		ЭтоНовый = Ложь;
	Иначе
		ЭтоНовый = Истина;
		ТекДокументОбъект = Документы.ПересчетТоваров.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументОбщепит.Проведен,ДокументОбщепит.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	// Для нового дока отменять проведения не требуется.
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И ЭтоНовый Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументОбщепит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	ТекДокументОбъект.Дата								= ДокументОбщепит.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.Исполнитель						= Справочники.Пользователи.ПустаяСсылка();
	ТекДокументОбъект.Комментарий						= ДокументОбщепит.Комментарий;
	// << MRS #ERP-5670 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 11.02.26, (Проблема с документом "Инвентаризация товаров")
	//ТекДокументОбъект.ОтборПересчета					= ДокументОбщепит.ОтборПересчета;
	СтруктураХранимыхДанных = ДокументОбщепит.ОтборПересчета.Получить();
	Если ТипЗнч(СтруктураХранимыхДанных) = Тип("Структура") Тогда		
		ОтборПересчета = СтруктураХранимыхДанных.ОтборПересчета;		
	Иначе	
		ОтборПересчета = СтруктураХранимыхДанных;
	КонецЕсли;	
	ТекДокументОбъект.ОтборПересчета					= ОтборПересчета;
	// >> MRS #ERP-5670 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 11.02.26, (Проблема с документом "Инвентаризация товаров")
	ТекДокументОбъект.Ответственный						= ДокументОбщепит.Ответственный;
	ТекДокументОбъект.Помещение							= Справочники.СкладскиеПомещения.ПустаяСсылка();
	ТекДокументОбъект.Склад								= ДокументОбщепит.Склад;
	ТекДокументОбъект.ПечататьКоличествоПоУчету			= Ложь;
	ТекДокументОбъект.УчетныеДанныеЗаполнены			= Истина;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	
	// Получение данных по табличной части "Товары" отраслевого документа "Выпуск блюд".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питИнвентаризацияТоваров.Номенклатура КАК Номенклатура,
	|	питИнвентаризацияТоваров.Характеристика КАК Характеристика,
	|	питИнвентаризацияТоваров.Серия КАК Серия,
	|	питИнвентаризацияТоваров.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	питИнвентаризацияТоваров.Назначение КАК Назначение,   
	|	Значение(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	|	питИнвентаризацияТоваров.Количество КАК КоличествоУпаковок,
	|	питИнвентаризацияТоваров.Количество КАК Количество,
	|	питИнвентаризацияТоваров.КоличествоФакт КАК КоличествоУпаковокФакт,
	|	питИнвентаризацияТоваров.КоличествоФакт КАК КоличествоФакт
	|ИЗ
	|	Документ.питИнвентаризацияТоваров.Товары КАК питИнвентаризацияТоваров
	|ГДЕ
	|	питИнвентаризацияТоваров.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументОбщепит.Ссылка);
	
	// Обход таб. части и заполнение таб. частей "Товары" документа "Передача материалов в производство". 
	// << MRS #VINE-94 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 12.05.25, (Единица измерения в документы)
	ТекКэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	// >> MRS #VINE-94 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 12.05.25, (Единица измерения в документы)
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовСтрока							= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура				= Выборка.Номенклатура;
		НовСтрока.Характеристика			= Выборка.Характеристика;
		НовСтрока.Серия						= Выборка.Серия;
		//НовСтрока.СтатусУказанияСерий		= Выборка.СтатусУказанияСерий;
		НовСтрока.Назначение				= Выборка.Назначение;
		НовСтрока.Упаковка					= Выборка.Упаковка;
		НовСтрока.КоличествоУпаковок		= Выборка.КоличествоУпаковок;
		НовСтрока.Количество				= Выборка.Количество;
		НовСтрока.КоличествоУпаковокФакт	= Выборка.КоличествоУпаковокФакт;
		НовСтрока.КоличествоФакт			= Выборка.КоличествоФакт;   
		
		// << MRS #VINE-94 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 13.05.25, (Единица измерения потребительской упаковки)
		СтруктураДействий = Новый Структура;     
		СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковокСуффикс", "Факт");
		СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НовСтрока, СтруктураДействий, ТекКэшированныеЗначения);
		// >> MRS #VINE-94 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 13.05.25, (Единица измерения потребительской упаковки)
	КонецЦикла;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	Попытка
		
		//+Серии
		Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
			ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументОбщепит);
		КонецЕсли;
		//-Серии
		
		ТекДокументОбъект.Статус							= Перечисления.СтатусыПересчетовТоваров.ВРаботе;
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
		
		ТекДокументОбъект.Статус							= Перечисления.СтатусыПересчетовТоваров.Выполнено;
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
		
		СтруктураПараметров.Вставить("питДокументПересчетТоваров", ТекДокументОбъект.Ссылка);
		
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументОбщепит+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументОбщепит, ТекДокументОбъект, тблСозданныеДокументы);
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "ОприходованиеИзлишковТоваров" для инвентаризации.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьОприходованиеИзлишковПоИнвентаризацииОбщепит(ДокументОбщепит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Списание недостач товаров",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ОприходованиеИзлишковТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции";
	Запрос.УстановитьПараметр("Документпит",				ДокументОбщепит);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
		ЭтоНовый = Ложь;
	ИначеЕсли НЕ ДокументОбщепит.Проведен Тогда
		Возврат Истина; // Для непроведенного выпуска, если раньше не было оприходования, то не создаем.
	Иначе
		ЭтоНовый = Истина;
		ТекДокументОбъект = Документы.ОприходованиеИзлишковТоваров.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументОбщепит.Проведен,ДокументОбщепит.ПометкаУдаления,
	ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	// Для нового дока отменять проведения не требуется.
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И ЭтоНовый Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Получение данных по табличной части "Товары" отраслевого документа "питИнвентаризацияТоваров".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питИнвентаризацияТоваров.Номенклатура КАК Номенклатура,
	|	питИнвентаризацияТоваров.Характеристика КАК Характеристика,
	|	питИнвентаризацияТоваров.Серия КАК Серия,
	|	питИнвентаризацияТоваров.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	питИнвентаризацияТоваров.Назначение КАК Назначение,
	|	питИнвентаризацияТоваров.Упаковка КАК Упаковка,
	|	питИнвентаризацияТоваров.КоличествоФакт - питИнвентаризацияТоваров.Количество КАК Количество
	|ИЗ
	|	Документ.питИнвентаризацияТоваров.Товары КАК питИнвентаризацияТоваров
	|ГДЕ
	|	питИнвентаризацияТоваров.Ссылка = &Ссылка
	|	И питИнвентаризацияТоваров.КоличествоФакт > питИнвентаризацияТоваров.Количество";
	Запрос.УстановитьПараметр("Ссылка", ДокументОбщепит.Ссылка);
	
	РезультатЗапросаТовары = Запрос.Выполнить();
	ПодкладнойДокументПустой = Ложь;
	Если РезультатЗапросаТовары.Пустой() Тогда
		ПодкладнойДокументПустой = Истина;
		НоваяПометкаУдаления = ?(НЕ ЭтоНовый, Истина, Неопределено);
	ИначеЕсли ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		НоваяПометкаУдаления = ПараметрыЗаписи.ПометкаУдаления;
	Иначе
		НоваяПометкаУдаления = Неопределено;
	КонецЕсли;
	
	Если НЕ НоваяПометкаУдаления = Неопределено Тогда
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ТекДокументОбъект.УстановитьПометкуУдаления(НоваяПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументОбщепит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ПодкладнойДокументПустой Тогда
		Если НЕ ЭтоНовый Тогда
			ДобавитьНовуюЗапись(ДокументОбщепит, ТекДокументОбъект, тблСозданныеДокументы);
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	ТекДокументОбъект.Дата						= ДокументОбщепит.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.Комментарий				= ДокументОбщепит.Комментарий;
	ТекДокументОбъект.Ответственный				= ДокументОбщепит.Ответственный;
	ТекДокументОбъект.Подразделение				= ДокументОбщепит.Подразделение;
	ТекДокументОбъект.Склад						= ДокументОбщепит.Склад;
	ТекДокументОбъект.СтатьяДоходов				= ДокументОбщепит.СтатьяДоходов;
	ТекДокументОбъект.АналитикаДоходов			= ДокументОбщепит.АналитикаДоходов;
	ТекДокументОбъект.ВидЦены					= питОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбщепит.Склад,"УчетныйВидЦены");
	ТекДокументОбъект.ПересчетТоваров			= ?(СтруктураПараметров.Свойство("питДокументПересчетТоваров"),СтруктураПараметров.питДокументПересчетТоваров,Неопределено);
	ТекДокументОбъект.Организация				= ДокументОбщепит.ОрганизацияСкладскихАктов;
	ТекДокументОбъект.Валюта					= Константы.ВалютаУправленческогоУчета.Получить();
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	
	Выборка = РезультатЗапросаТовары.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока						= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура			= Выборка.Номенклатура;
		НовСтрока.Характеристика		= Выборка.Характеристика;
		НовСтрока.Количество			= Выборка.Количество;
	КонецЦикла;
	
	// Заполнение ЦЕН
	Если ЗначениеЗаполнено(ТекДокументОбъект.ВидЦены) Тогда
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
		КолонкиПоЗначению = Новый Структура("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Дата", ТекДокументОбъект.Дата);
		ПараметрыЗаполнения.Вставить("Валюта", Константы.ВалютаУправленческогоУчета.Получить());
		ПараметрыЗаполнения.Вставить("ВидЦены", ТекДокументОбъект.ВидЦены);
		ПараметрыЗаполнения.Вставить("КолонкиПоЗначению", КолонкиПоЗначению);
		ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
		ТекДокументОбъект.Товары, // Табличная часть
		, // Выделенные строки (заполнять во всех строках)
		ПараметрыЗаполнения,
		СтруктураДействий);
	КонецЕсли;
	
	// Проверка на заполненность цен, отсутствие цен критично и это ошибка!
	ТоварыСНезаполненнымиЦенами = Новый Массив;
	Для каждого ТекСтрокаТовары Из ТекДокументОбъект.Товары Цикл
		Если ТекСтрокаТовары.Цена = 0 ИЛИ ТекСтрокаТовары.Сумма = 0 Тогда
			ТоварыСНезаполненнымиЦенами.Добавить(ТекСтрокаТовары.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	Если ТоварыСНезаполненнымиЦенами.Количество() Тогда
		
		ТекстОшибки = ТекстОшибки + "
		|Ошибка заполнения документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументОбщепит+"""
		|по причине: Не заполнены цены по виду цен <"+ТекДокументОбъект.ВидЦены+"> для следующих номенклатурных позиций:
		|";
		Для Сч = 0 По ТоварыСНезаполненнымиЦенами.Количество()-1 Цикл
			ТекстОшибки = ТекстОшибки + ?(Сч=0,"",",")+"<"+ТоварыСНезаполненнымиЦенами[Сч]+">";
		КонецЦикла;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	Попытка
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументОбщепит+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументОбщепит, ТекДокументОбъект, тблСозданныеДокументы);
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "СписаниеНедостачТоваров" для инвентаризации.
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьСписаниеНедостачПоИнвентаризацииОбщепит(ДокументОбщепит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Списание недостач товаров",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.СписаниеНедостачТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции";
	Запрос.УстановитьПараметр("Документпит",				ДокументОбщепит);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
		ЭтоНовый = Ложь;
	ИначеЕсли НЕ ДокументОбщепит.Проведен Тогда
		Возврат Истина; // Для непроведенного выпуска, если раньше не было оприходования, то не создаем.
	Иначе
		ЭтоНовый = Истина;
		ТекДокументОбъект = Документы.СписаниеНедостачТоваров.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументОбщепит.Проведен,ДокументОбщепит.ПометкаУдаления,
	ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	// Для нового дока отменять проведения не требуется.
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И ЭтоНовый Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Получение данных по табличной части "Товары" отраслевого документа "питИнвентаризацияТоваров".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питИнвентаризацияТоваров.Номенклатура КАК Номенклатура,
	|	питИнвентаризацияТоваров.Характеристика КАК Характеристика,
	|	питИнвентаризацияТоваров.Серия КАК Серия,
	|	питИнвентаризацияТоваров.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	питИнвентаризацияТоваров.Назначение КАК Назначение,
	|	питИнвентаризацияТоваров.Упаковка КАК Упаковка,
	|	питИнвентаризацияТоваров.Количество - питИнвентаризацияТоваров.КоличествоФакт КАК Количество
	|ИЗ
	|	Документ.питИнвентаризацияТоваров.Товары КАК питИнвентаризацияТоваров
	|ГДЕ
	|	питИнвентаризацияТоваров.Ссылка = &Ссылка
	|	И питИнвентаризацияТоваров.Количество > питИнвентаризацияТоваров.КоличествоФакт";
	Запрос.УстановитьПараметр("Ссылка", ДокументОбщепит.Ссылка);
	
	РезультатЗапросаТовары = Запрос.Выполнить();
	ПодкладнойДокументПустой = Ложь;
	Если РезультатЗапросаТовары.Пустой() Тогда
		ПодкладнойДокументПустой = Истина;
		НоваяПометкаУдаления = ?(НЕ ЭтоНовый, Истина, Неопределено);
	ИначеЕсли ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		НоваяПометкаУдаления = ПараметрыЗаписи.ПометкаУдаления;
	Иначе
		НоваяПометкаУдаления = Неопределено;
	КонецЕсли;
	
	Если НЕ НоваяПометкаУдаления = Неопределено Тогда
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ТекДокументОбъект.УстановитьПометкуУдаления(НоваяПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументОбщепит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ПодкладнойДокументПустой Тогда
		Если НЕ ЭтоНовый Тогда
			ДобавитьНовуюЗапись(ДокументОбщепит, ТекДокументОбъект, тблСозданныеДокументы);
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	ТекДокументОбъект.Дата						= ДокументОбщепит.Дата + ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.АналитикаРасходов			= ДокументОбщепит.АналитикаРасходов;
	ТекДокументОбъект.Комментарий				= ДокументОбщепит.Комментарий;
	ТекДокументОбъект.Организация				= ДокументОбщепит.ОрганизацияСкладскихАктов;
	ТекДокументОбъект.Ответственный				= ДокументОбщепит.Ответственный;
	ТекДокументОбъект.Подразделение				= ДокументОбщепит.Подразделение;
	ТекДокументОбъект.Склад						= ДокументОбщепит.Склад;
	ТекДокументОбъект.СтатьяРасходов			= ДокументОбщепит.СтатьяРасходов;
	ТекДокументОбъект.ВидЦены					= питОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбщепит.Склад,"УчетныйВидЦены");
	ТекДокументОбъект.ПересчетТоваров			= ?(СтруктураПараметров.Свойство("питДокументПересчетТоваров"),СтруктураПараметров.питДокументПересчетТоваров,Неопределено);
	ТекДокументОбъект.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен;
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
	
	Выборка = РезультатЗапросаТовары.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока						= ТекДокументОбъект.Товары.Добавить();
		НовСтрока.Номенклатура			= Выборка.Номенклатура;
		НовСтрока.Характеристика		= Выборка.Характеристика;
		НовСтрока.Количество			= Выборка.Количество;
		НовСтрока.Назначение			= Выборка.Назначение;
	КонецЦикла;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	Попытка
		ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
		ТекДокументОбъект.Записать(ТекРежимЗаписи);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
		| по документу Общепит """+ДокументОбщепит+"""
		|по причине: <"+ОписаниеОшибки()+">";
		Возврат Ложь;
	КонецПопытки;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументОбщепит, ТекДокументОбъект, тблСозданныеДокументы);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ФормированиеТиповыхДокументовПоПеремещениюНоменклатурыСкладаПроизводства

// Процедура формирования типовых документов по переданному документу питПеремещениеНоменклатурыСкладаПроизводства.
//
// Параметры:
//  ДокПеремещение			 - ДокументСсылка.питПеремещениеНоменклатурыСкладаПроизводства	 - Ссылка на документ "питПеремещениеНоменклатурыСкладаПроизводства", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьТиповыеДокументыПоПеремещениюНоменклатурыСкладаПроизводства(ДокПеремещение, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	ВсеОк = Истина;
	
	ВсеОк = СформироватьПроизводствоБезЗаказовПоПеремещениюНоменклатурыСкладаПроизводства(ДокПеремещение, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
	Если НЕ ВсеОк Тогда 
		Возврат ВсеОк;
	КонецЕсли;
	
	СтруктураСкладовКладовая = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокПеремещение, "СкладОтправитель, СкладОтправитель.ЦеховаяКладовая, СкладПолучатель, СкладПолучатель.ЦеховаяКладовая");
	
	Если СтруктураСкладовКладовая.СкладОтправитель = СтруктураСкладовКладовая.СкладПолучатель Тогда
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокПеремещение, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ПеремещениеТоваров",,Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокПеремещение, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ДвижениеПродукцииИМатериалов",,Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли СтруктураСкладовКладовая.СкладОтправительЦеховаяКладовая
		ИЛИ СтруктураСкладовКладовая.СкладПолучательЦеховаяКладовая Тогда
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокПеремещение, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ПеремещениеТоваров",,Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ВсеОк = СформироватьДвижениеПродукцииИМатериаловПоПеремещениюНоменклатурыСкладаПроизводства(ДокПеремещение, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
	Иначе
		
		Если НЕ ОтменитьПроведениеТиповогоДокументаПоДокументупит(ДокПеремещение, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки, "ДвижениеПродукцииИМатериалов",,Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ВсеОк = СформироватьПеремещениеТоваровПеремещениюНоменклатурыСкладаПроизводства(ДокПеремещение, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки);
		Если НЕ ВсеОк Тогда 
			Возврат ВсеОк;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВсеОк;
	
КонецФункции

// Функция формирует документ "ПроизводствоБезЗаказа".
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьПроизводствоБезЗаказовПоПеремещениюНоменклатурыСкладаПроизводства(ДокументОбщепит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Производство без заказа",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ПроизводствоБезЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции";
	Запрос.УстановитьПараметр("Документпит",				ДокументОбщепит);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
		ЭтоНовый = Ложь;
	ИначеЕсли НЕ ДокументОбщепит.Проведен Тогда
		Возврат Истина; // Для непроведенного выпуска, если раньше не было оприходования, то не создаем.
	Иначе
		ЭтоНовый = Истина;
		ТекДокументОбъект = Документы.ПроизводствоБезЗаказа.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументОбщепит.Проведен,ДокументОбщепит.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			Если ЗначениеЗаполнено(ДокументОбщепит.ДокументИсточник) Тогда
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументОбщепит);
			КонецЕсли;
			ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументОбщепит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	// Получение данных отраслевого документа "питПеремещениеНоменклатурыСкладаПроизводства".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питПеремещениеНоменклатурыСкладаПроизводства.Номер КАК Номер,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Дата КАК Дата,
	|	питПеремещениеНоменклатурыСкладаПроизводства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Организация КАК Организация,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Подразделение КАК Подразделение,
	|	питПеремещениеНоменклатурыСкладаПроизводства.СкладОтправитель КАК СкладОтправитель,
	|	питПеремещениеНоменклатурыСкладаПроизводства.СкладПолучатель КАК СкладПолучатель,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Ответственный КАК Ответственный,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Комментарий КАК Комментарий,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Валюта КАК Валюта,
	|	питПеремещениеНоменклатурыСкладаПроизводства.СтатьяКалькуляции КАК СтатьяКалькуляции
	|ИЗ
	|	Документ.питПеремещениеНоменклатурыСкладаПроизводства КАК питПеремещениеНоменклатурыСкладаПроизводства
	|ГДЕ
	|	питПеремещениеНоменклатурыСкладаПроизводства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Назначение КАК Назначение,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ТаблицаТоваров.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ТаблицаТоваров.НоменклатураОприходование КАК НоменклатураОприходование,
	|	ТаблицаТоваров.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
	|	ТаблицаТоваров.НазначениеОприходование КАК НазначениеОприходование,
	|	ТаблицаТоваров.СерияОприходование КАК СерияОприходование,
	|	ТаблицаТоваров.СтатусУказанияСерийОприходование КАК СтатусУказанияСерийОприходование,
	|	ТаблицаТоваров.УпаковкаОприходование КАК УпаковкаОприходование,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.КоличествоОприходование КАК КоличествоОприходование,
	|	ТаблицаТоваров.КоэффициентПроизводства КАК КоэффициентПроизводства,
	|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаТоваров.КоличествоУпаковокОприходование КАК КоличествоУпаковокОприходование
	|ИЗ
	|	Документ.питПеремещениеНоменклатурыСкладаПроизводства.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|	И НЕ(ТаблицаТоваров.Номенклатура = ТаблицаТоваров.НоменклатураОприходование
	|				И ТаблицаТоваров.Характеристика = ТаблицаТоваров.ХарактеристикаОприходование
	|				И ТаблицаТоваров.Серия = ТаблицаТоваров.СерияОприходование)";
	Запрос.УстановитьПараметр("Ссылка", ДокументОбщепит.Ссылка);
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	
	ШапкаДокументаОбщепит = РезультатЗапросаПакет[0].Выбрать();
	ШапкаДокументаОбщепит.Следующий();
	
	// Заполнение шапки.
	ТекДокументОбъект.Дата					= ШапкаДокументаОбщепит.Дата 
		+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.Организация			= ШапкаДокументаОбщепит.Организация;
	ТекДокументОбъект.Подразделение			= ШапкаДокументаОбщепит.Подразделение;
	ТекДокументОбъект.ГруппировкаЗатрат		= Перечисления.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукции;
	ТекДокументОбъект.Ответственный			= ШапкаДокументаОбщепит.Ответственный;
	ТекДокументОбъект.Комментарий			= ШапкаДокументаОбщепит.Комментарий;
	ТекДокументОбъект.Валюта				= ШапкаДокументаОбщепит.Валюта;
	
	// Автоопределение значения налогообложения НДС.
	ТекДокументОбъект.ВыпускПодДеятельность = Неопределено;
	ПараметрыЗаполнения = Документы.ПроизводствоБезЗаказа.ПараметрыЗаполненияВидаДеятельностиНДС(ТекДокументОбъект);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ТекДокументОбъект.ВыпускПодДеятельность, ПараметрыЗаполнения);
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.ВыходныеИзделия.Очистить();
	ТекДокументОбъект.ВыходныеИзделияСерии.Очистить();
	ТекДокументОбъект.ПобочныеИзделия.Очистить();
	ТекДокументОбъект.ПобочныеИзделияСерии.Очистить();
	ТекДокументОбъект.МатериалыИРаботы.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
	ТекДокументОбъект.ВидыЗапасовМатериалыИРаботы.Очистить();
	ТекДокументОбъект.ВидыЗапасовВыходныеИзделия.Очистить();
	ТекДокументОбъект.ВидыЗапасовПобочныеИзделия.Очистить();
	ТекДокументОбъект.Трудозатраты.Очистить();
	
	ВыборкаБлюда = РезультатЗапросаПакет[1].Выбрать();
	ТекНомерГруппыЗатрат = 1;
	Пока ВыборкаБлюда.Следующий() Цикл
		Если ВыборкаБлюда.Количество > 0 Тогда
			
			НовСтрокаТЧ						= ТекДокументОбъект.ВыходныеИзделия.Добавить();
			НовСтрокаТЧ.НаправлениеВыпуска	= Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад;
			НовСтрокаТЧ.Получатель			= ШапкаДокументаОбщепит.СкладПолучатель;
			НовСтрокаТЧ.Номенклатура		= ВыборкаБлюда.НоменклатураОприходование;
			НовСтрокаТЧ.Характеристика		= ВыборкаБлюда.ХарактеристикаОприходование;
			НовСтрокаТЧ.Серия				= ВыборкаБлюда.СерияОприходование;
			НовСтрокаТЧ.Назначение			= ВыборкаБлюда.НазначениеОприходование;
			НовСтрокаТЧ.КоличествоУпаковок	= ВыборкаБлюда.КоличествоУпаковокОприходование;
			НовСтрокаТЧ.Количество			= ВыборкаБлюда.КоличествоОприходование;
			НовСтрокаТЧ.Упаковка			= ВыборкаБлюда.УпаковкаОприходование;
			НовСтрокаТЧ.ИдентификаторСтроки	= Новый УникальныйИдентификатор;
			НовСтрокаТЧ.НомерГруппыЗатрат	= ТекНомерГруппыЗатрат;
			НовСтрокаТЧ.Подразделение		= ШапкаДокументаОбщепит.Подразделение;
			
			НовСтрокаТЧ						= ТекДокументОбъект.МатериалыИРаботы.Добавить();
			НовСтрокаТЧ.Склад				= ШапкаДокументаОбщепит.СкладОтправитель;
			НовСтрокаТЧ.Подразделение		= ШапкаДокументаОбщепит.Подразделение;
			НовСтрокаТЧ.Номенклатура		= ВыборкаБлюда.Номенклатура;
			НовСтрокаТЧ.Характеристика		= ВыборкаБлюда.Характеристика;
			НовСтрокаТЧ.Серия				= ВыборкаБлюда.Серия;
			НовСтрокаТЧ.КоличествоУпаковок	= ВыборкаБлюда.КоличествоУпаковок;
			НовСтрокаТЧ.Количество			= ВыборкаБлюда.Количество;
			НовСтрокаТЧ.Упаковка			= ВыборкаБлюда.Упаковка;
			//+25
			НовСтрокаТЧ.ИдентификаторСтроки	= Новый УникальныйИдентификатор;
			//-25
			Если ЗначениеЗаполнено(ШапкаДокументаОбщепит.СтатьяКалькуляции) Тогда
				НовСтрокаТЧ.СтатьяКалькуляции	= ШапкаДокументаОбщепит.СтатьяКалькуляции;
			Иначе
				НовСтрокаТЧ.СтатьяКалькуляции	= питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("СтатьяКалькуляцииПоУмолчанию");
			КонецЕсли;
			НовСтрокаТЧ.НомерГруппыЗатрат	= ТекНомерГруппыЗатрат;
			
			ТекНомерГруппыЗатрат = ТекНомерГруппыЗатрат + 1;
		КонецЕсли;
	КонецЦикла;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	//+Серии
	Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументОбщепит);
	КонецЕсли;
	//-Серии
	
	ОтменитьЗапись = ТекДокументОбъект.ЭтоНовый() И НЕ ТекДокументОбъект.ВыходныеИзделия.Количество();
	Если НЕ ОтменитьЗапись Тогда
		
		// Если табличная часть пустая, то либо отмена проведения либо запись.
		Если НЕ ТекДокументОбъект.ВыходныеИзделия.Количество() Тогда
			Если ТекДокументОбъект.Проведен Тогда
				ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			Иначе
				ТекРежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			Если ЗначениеЗаполнено(ДокументОбщепит.ДокументИсточник) Тогда
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументОбщепит);
			КонецЕсли;
			ТекДокументОбъект.Записать(ТекРежимЗаписи);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументОбщепит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументОбщепит, ТекДокументОбъект, тблСозданныеДокументы);
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "ДвижениеПродукцииИМатериалов".
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьДвижениеПродукцииИМатериаловПоПеремещениюНоменклатурыСкладаПроизводства(ДокументОбщепит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Производство без заказа",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции";
	Запрос.УстановитьПараметр("Документпит",				ДокументОбщепит);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
		ЭтоНовый = Ложь;
	ИначеЕсли НЕ ДокументОбщепит.Проведен Тогда
		Возврат Истина; // Для непроведенного выпуска, если раньше не было оприходования, то не создаем.
	Иначе
		ЭтоНовый = Истина;
		ТекДокументОбъект = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументОбщепит.Проведен,ДокументОбщепит.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			Если ЗначениеЗаполнено(ДокументОбщепит.ДокументИсточник) Тогда
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументОбщепит);
			КонецЕсли;
			ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументОбщепит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	// Получение данных отраслевого документа "питПеремещениеНоменклатурыСкладаПроизводства".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питПеремещениеНоменклатурыСкладаПроизводства.Дата КАК Дата,
	|	питПеремещениеНоменклатурыСкладаПроизводства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Организация КАК Организация,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Подразделение КАК Подразделение,
	|	питПеремещениеНоменклатурыСкладаПроизводства.СкладОтправитель КАК СкладОтправитель,
	|	питПеремещениеНоменклатурыСкладаПроизводства.СкладПолучатель КАК СкладПолучатель,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Ответственный КАК Ответственный,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Комментарий КАК Комментарий,
	|	ЕСТЬNULL(СпрСкладОтправитель.ЦеховаяКладовая, ИСТИНА) КАК СкладОтправительЦеховаяКладовая,
	|	ЕСТЬNULL(СпрСкладПолучатель.ЦеховаяКладовая, ИСТИНА) КАК СкладПолучательЦеховаяКладовая,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Валюта КАК Валюта
	|ИЗ
	|	Документ.питПеремещениеНоменклатурыСкладаПроизводства КАК питПеремещениеНоменклатурыСкладаПроизводства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладОтправитель
	|		ПО питПеремещениеНоменклатурыСкладаПроизводства.СкладОтправитель = СпрСкладОтправитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладПолучатель
	|		ПО питПеремещениеНоменклатурыСкладаПроизводства.СкладПолучатель = СпрСкладПолучатель.Ссылка
	|ГДЕ
	|	питПеремещениеНоменклатурыСкладаПроизводства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Назначение КАК Назначение,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ТаблицаТоваров.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.питПеремещениеНоменклатурыСкладаПроизводства.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|	И ТаблицаТоваров.Номенклатура = ТаблицаТоваров.НоменклатураОприходование
	|	И ТаблицаТоваров.Характеристика = ТаблицаТоваров.ХарактеристикаОприходование
	|	И ТаблицаТоваров.Серия = ТаблицаТоваров.СерияОприходование";
	Запрос.УстановитьПараметр("Ссылка", ДокументОбщепит.Ссылка);
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	
	ШапкаДокументаОбщепит = РезультатЗапросаПакет[0].Выбрать();
	ШапкаДокументаОбщепит.Следующий();
	
	// Заполнение шапки.
	ТекДокументОбъект.Дата							= ШапкаДокументаОбщепит.Дата 
		+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.Организация					= ШапкаДокументаОбщепит.Организация;
	ТекДокументОбъект.Отправитель					= ШапкаДокументаОбщепит.СкладОтправитель;
	ТекДокументОбъект.Получатель					= ШапкаДокументаОбщепит.СкладПолучатель;
	ТекДокументОбъект.Ответственный					= ШапкаДокументаОбщепит.Ответственный;
	ТекДокументОбъект.Комментарий					= ШапкаДокументаОбщепит.Комментарий;
	ТекДокументОбъект.Статус						= Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	//+25
	ТекДокументОбъект.Валюта						= ?(ЗначениеЗаполнено(ШапкаДокументаОбщепит.Валюта), ШапкаДокументаОбщепит.Валюта, Константы.ВалютаРегламентированногоУчета.Получить());
	ТекДокументОбъект.ВариантПриемкиТоваров			= Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	//-25
	
	// Матрица хоз операций движения продукции и материалов выглядит так:
	//							|| Перемещение в номенклатуру производства	|| Перемещение в номенклатуру склада
	//--------------------------------------------------------------------------------------------------------
	//Из кладовой на склад		|| Возврат материалов из кладовой			|| Возврат материалов из кладовой
	//Со склада в кладовую		|| Передача материалов в кладовую			|| Передача материалов в кладовую
	//Из кладовой в кладовую	|| Передача материалов в кладовую			|| Возврат материалов из кладовой
	Если ШапкаДокументаОбщепит.СкладОтправительЦеховаяКладовая И НЕ ШапкаДокументаОбщепит.СкладПолучательЦеховаяКладовая Тогда
		ТекДокументОбъект.ХозяйственнаяОперация			= Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой;
	ИначеЕсли НЕ ШапкаДокументаОбщепит.СкладОтправительЦеховаяКладовая И ШапкаДокументаОбщепит.СкладПолучательЦеховаяКладовая Тогда
		ТекДокументОбъект.ХозяйственнаяОперация			= Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;
	ИначеЕсли ШапкаДокументаОбщепит.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ПеремещениеСкладскойНоменклатурыВПроизводство Тогда
		ТекДокументОбъект.ХозяйственнаяОперация			= Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;
	Иначе
		ТекДокументОбъект.ХозяйственнаяОперация			= Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой;
	КонецЕсли;
	
	// Автоопределение значения налогообложения НДС.
	ТекДокументОбъект.НалогообложениеНДС = Неопределено;
	ПараметрыЗаполнения = Документы.ДвижениеПродукцииИМатериалов.ПараметрыЗаполненияВидаДеятельностиНДС(ТекДокументОбъект);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ТекДокументОбъект.НалогообложениеНДС, ПараметрыЗаполнения);
	
	// Очистка табличных частей для избежания дублирования информации.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.Серии.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
	
	Выборка = РезультатЗапросаПакет[1].Выбрать();
	ТекНомерГруппыЗатрат = 1;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 0 Тогда
			
			НовСтрока						= ТекДокументОбъект.Товары.Добавить();
			НовСтрока.Номенклатура			= Выборка.Номенклатура;
			НовСтрока.Характеристика		= Выборка.Характеристика;
			НовСтрока.Серия					= Выборка.Серия;
			НовСтрока.Назначение			= Выборка.Назначение;
			НовСтрока.НазначениеОтправителя	= Выборка.Назначение;
			НовСтрока.Упаковка				= Выборка.Упаковка;
			НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковок;
			НовСтрока.Количество			= Выборка.Количество;    
			НовСтрока.ИдентификаторСтроки	= Новый УникальныйИдентификатор;
			
		КонецЕсли;
	КонецЦикла;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	//+Серии
	Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументОбщепит);
	КонецЕсли;
	//-Серии
	
	ОтменитьЗапись = ТекДокументОбъект.ЭтоНовый() И НЕ ТекДокументОбъект.Товары.Количество();
	Если НЕ ОтменитьЗапись Тогда
		
		// Если табличная часть пустая, то либо отмена проведения либо запись.
		Если НЕ ТекДокументОбъект.Товары.Количество() Тогда
			Если ТекДокументОбъект.Проведен Тогда
				ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			Иначе
				ТекРежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			Если ЗначениеЗаполнено(ДокументОбщепит.ДокументИсточник) Тогда
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументОбщепит);
			КонецЕсли;
			ТекДокументОбъект.Записать(ТекРежимЗаписи);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументОбщепит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументОбщепит, ТекДокументОбъект, тблСозданныеДокументы);
	
	Возврат Истина;
	
КонецФункции

// Функция формирует документ "ПеремещениеТоваров".
//
// Параметры:
//  ДокументВыпускБлюд		 - ДокументСсылка	 - Ссылка на документ "Выпуск блюд", по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция СформироватьПеремещениеТоваровПеремещениюНоменклатурыСкладаПроизводства(ДокументОбщепит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки)
	
	Запрос = Новый Запрос;
	
	// Поиск существующего документа "Производство без заказа",
	// связанного с текущим "Выпуском блюд".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втДокументыВыпускПродукции
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.ПеремещениеТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыВыпускПродукции.ТиповойДокумент
	|ИЗ
	|	втДокументыВыпускПродукции КАК втДокументыВыпускПродукции";
	Запрос.УстановитьПараметр("Документпит",				ДокументОбщепит);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если документ найден, то получаем объект иначе создаем новый.
	Если Выборка.Следующий() Тогда
		ТекДокументОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
		ЭтоНовый = Ложь;
	ИначеЕсли НЕ ДокументОбщепит.Проведен Тогда
		Возврат Истина; // Для непроведенного выпуска, если раньше не было оприходования, то не создаем.
	Иначе
		ЭтоНовый = Истина;
		ТекДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	КонецЕсли;
	
	// Определение параметров записи.
	ПараметрыЗаписи = ОпределитьПараметрыЗаписиТиповогоДокумента(ДокументОбщепит.Проведен,ДокументОбщепит.ПометкаУдаления,
		ТекДокументОбъект.Проведен,ТекДокументОбъект.ПометкаУдаления,СтруктураПараметров);
	
	// Определение режима записи
	ТекРежимЗаписи = ПараметрыЗаписи.РежимЗаписи;
	
	Если ПараметрыЗаписи.НужнаУстановкаПометкиУдаления Тогда
		
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			Если ЗначениеЗаполнено(ДокументОбщепит.ДокументИсточник) Тогда
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументОбщепит);
			КонецЕсли;
			ТекДокументОбъект.УстановитьПометкуУдаления(ПараметрыЗаписи.ПометкаУдаления);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументОбщепит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	// Получение данных отраслевого документа "питПеремещениеНоменклатурыСкладаПроизводства".
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питПеремещениеНоменклатурыСкладаПроизводства.Дата КАК Дата,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Организация КАК Организация,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Подразделение КАК Подразделение,
	|	питПеремещениеНоменклатурыСкладаПроизводства.СкладОтправитель КАК СкладОтправитель,
	|	питПеремещениеНоменклатурыСкладаПроизводства.СкладПолучатель КАК СкладПолучатель,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Ответственный КАК Ответственный,
	|	питПеремещениеНоменклатурыСкладаПроизводства.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.питПеремещениеНоменклатурыСкладаПроизводства КАК питПеремещениеНоменклатурыСкладаПроизводства
	|ГДЕ
	|	питПеремещениеНоменклатурыСкладаПроизводства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Назначение КАК Назначение,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ТаблицаТоваров.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.питПеремещениеНоменклатурыСкладаПроизводства.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|	И ТаблицаТоваров.Номенклатура = ТаблицаТоваров.НоменклатураОприходование
	|	И ТаблицаТоваров.Характеристика = ТаблицаТоваров.ХарактеристикаОприходование
	|	И ТаблицаТоваров.Серия = ТаблицаТоваров.СерияОприходование";
	Запрос.УстановитьПараметр("Ссылка", ДокументОбщепит.Ссылка);
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	
	ШапкаДокументаОбщепит = РезультатЗапросаПакет[0].Выбрать();
	ШапкаДокументаОбщепит.Следующий();
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	//+25
	//ТекДокументОбъект.ДатаРаспоряжения				= КонецДня(ШапкаДокументаОбщепит.Дата);
	//-25
	// << MRS #ERP-5021 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 14.04.25, ()
	//ТекДокументОбъект.ВидЦены						= питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("НормативныйТипЦенОбщепит");	// исходная строка
	Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШапкаДокументаОбщепит.СкладПолучатель, "РозничныйВидЦены, РозничныйВидЦены.ЦенаВключаетНДС");
	Если ЗначениеЗаполнено(Стр.РозничныйВидЦены) Тогда
		ТекДокументОбъект.ВидЦены = Стр.РозничныйВидЦены;
	Иначе
		ТекДокументОбъект.ВидЦены = Константы.питНормативнаяЦена.Получить();
	КонецЕсли;
	// >> MRS #ERP-5021 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 14.04.25, ()
	ТекДокументОбъект.Дата							= ШапкаДокументаОбщепит.Дата 
		+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0);
	ТекДокументОбъект.Организация					= ШапкаДокументаОбщепит.Организация;
	//ТекДокументОбъект.ОрганизацияПолучатель			= ШапкаДокументаОбщепит.Организация;
	ТекДокументОбъект.Ответственный					= ШапкаДокументаОбщепит.Ответственный;
	ТекДокументОбъект.Подразделение					= ШапкаДокументаОбщепит.Подразделение;
	ТекДокументОбъект.СкладОтправитель				= ШапкаДокументаОбщепит.СкладОтправитель;
	ТекДокументОбъект.СкладПолучатель				= ШапкаДокументаОбщепит.СкладПолучатель;
	ТекДокументОбъект.Статус						= Перечисления.СтатусыПеремещенийТоваров.Принято;
	ТекДокументОбъект.ХозяйственнаяОперация			= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ТекДокументОбъект.Комментарий					= ШапкаДокументаОбщепит.Комментарий;
	ТекДокументОбъект.СпособДоставки				= Перечисления.СпособыДоставки.Самовывоз;

	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.Серии.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();
	
	Выборка = РезультатЗапросаПакет[1].Выбрать();
	ТекНомерГруппыЗатрат = 1;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 0 Тогда
			
			НовСтрока						= ТекДокументОбъект.Товары.Добавить();
			НовСтрока.Номенклатура			= Выборка.Номенклатура;
			НовСтрока.Характеристика		= Выборка.Характеристика;
			НовСтрока.Серия					= Выборка.Серия;
			НовСтрока.Назначение			= Выборка.Назначение;
			НовСтрока.НазначениеОтправителя	= Выборка.Назначение;
			НовСтрока.Упаковка				= Выборка.Упаковка;
			НовСтрока.КоличествоУпаковок	= Выборка.КоличествоУпаковок;
			НовСтрока.Количество			= Выборка.Количество;
			
		КонецЕсли;
	КонецЦикла;
	
	/////////////////////////////////////////////////////////
	// ЗАПИСЬ ДОКУМЕНТА
	
	//+Серии
	Если ТекРежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И НЕ СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
		ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ДокументОбщепит);
	КонецЕсли;
	//-Серии
	
	ОтменитьЗапись = ТекДокументОбъект.ЭтоНовый() И НЕ ТекДокументОбъект.Товары.Количество();
	Если НЕ ОтменитьЗапись Тогда
		
		// Если табличная часть пустая, то либо отмена проведения либо запись.
		Если НЕ ТекДокументОбъект.Товары.Количество() Тогда
			Если ТекДокументОбъект.Проведен Тогда
				ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			Иначе
				ТекРежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			Если ЗначениеЗаполнено(ДокументОбщепит.ДокументИсточник) Тогда
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питДокументОбщепитРаспределениеЗапасов", ДокументОбщепит);
			КонецЕсли;
			ТекДокументОбъект.Записать(ТекРежимЗаписи);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка записи документа """ + ТекДокументОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументОбщепит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	// Добавление записи в результирующую таблицу в случае успешной записи документов.
	ДобавитьНовуюЗапись(ДокументОбщепит, ТекДокументОбъект, тблСозданныеДокументы);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область УниверсальноеЗаполнениеДокументов

Процедура ЗаполнитьШапкуПеремещенияТоваровПоВыпускуБлюд(ДокументПеремещения, ДокументВыпускБлюд, СтруктураПараметров, БазовоеСмещение = 0, Организация = Неопределено)
	
	/////////////////////////////////
	// ЗАПОЛНЕНИЕ ШАПКИ.
	//+25
	//ДокументПеремещения.ДатаРаспоряжения				= КонецДня(ДокументВыпускБлюд.Дата);
	//-25
	ДокументПеремещения.ВидЦены						= ДокументВыпускБлюд.ТипЦен;
	ДокументПеремещения.Дата							= ДокументВыпускБлюд.Дата 
	+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0)
	- БазовоеСмещение;
	ДокументПеремещения.Организация					= ?(Организация = Неопределено, ДокументВыпускБлюд.Организация, Организация);
	//ТекДокументОбъект.ОрганизацияПолучатель			= ДокументВыпускБлюд.Организация;
	ДокументПеремещения.Ответственный					= ДокументВыпускБлюд.Ответственный;
	ДокументПеремещения.Подразделение					= ДокументВыпускБлюд.Подразделение;
	ДокументПеремещения.СкладОтправитель				= ДокументВыпускБлюд.Склад;
	ДокументПеремещения.СкладПолучатель				= ДокументВыпускБлюд.СкладПолучатель;
	ДокументПеремещения.Статус						= Перечисления.СтатусыПеремещенийТоваров.Принято;
	ДокументПеремещения.ХозяйственнаяОперация			= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокументПеремещения.Комментарий					= ДокументВыпускБлюд.Комментарий;
	ДокументПеремещения.СпособДоставки				= Перечисления.СпособыДоставки.Самовывоз;
	ДокументПеремещения.НаправлениеДеятельности		= ДокументВыпускБлюд.НаправлениеДеятельности;
	
	ДокументПеремещения.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуДвиженияПродукцииИМатериаловПоВыпускуБлюд(ТекДокументОбъект, ДокументВыпускБлюд, СтруктураПараметров, БазовоеСмещение, Организация = Неопределено, ХозяйственнаяОперация = Неопределено)
	
	// Заполнение шапки.
	ТекДокументОбъект.Дата					= ДокументВыпускБлюд.Дата 
		+ ?(СтруктураПараметров.Свойство("ДатаСмещение"),СтруктураПараметров.ДатаСмещение, 0)
		- БазовоеСмещение;
	ТекДокументОбъект.Организация			= ?(Организация = Неопределено, ДокументВыпускБлюд.Организация, Организация);
	ТекДокументОбъект.Отправитель			= ДокументВыпускБлюд.Склад;
	ТекДокументОбъект.Получатель			= ДокументВыпускБлюд.СкладПолучатель;
	ТекДокументОбъект.Ответственный			= ДокументВыпускБлюд.Ответственный;
	ТекДокументОбъект.Комментарий			= ДокументВыпускБлюд.Комментарий;
	ТекДокументОбъект.ХозяйственнаяОперация	= ?(ХозяйственнаяОперация = Неопределено, Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой, ХозяйственнаяОперация);
	ТекДокументОбъект.Статус				= Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	ТекДокументОбъект.НаправлениеДеятельности	= ДокументВыпускБлюд.НаправлениеДеятельности;
	ТекДокументОбъект.Валюта				= ?(ЗначениеЗаполнено(ДокументВыпускБлюд.Валюта), ДокументВыпускБлюд.Валюта, Константы.ВалютаРегламентированногоУчета.Получить());
	ТекДокументОбъект.ВариантПриемкиТоваров	= Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	// Автоопределение значения налогообложения НДС.
	ТекДокументОбъект.НалогообложениеНДС = ?(СтруктураПараметров.Свойство("НалогообложениеНДС"), СтруктураПараметров.НалогообложениеНДС, Неопределено);
	
КонецПроцедуры

Процедура ОчиститьТабличныеЧастиДвиженияПродукцииИМатериалов(ТекДокументДвижениеПродукции)
	
	// Очистка табличных частей для избежания дублирования информации.
	ТекДокументДвижениеПродукции.Товары.Очистить();
	ТекДокументДвижениеПродукции.Серии.Очистить();
	ТекДокументДвижениеПродукции.ВидыЗапасов.Очистить();
	ТекДокументДвижениеПродукции.ДополнительныеРеквизиты.Очистить();
	
КонецПроцедуры

Процедура ОчиститьТабличныеЧастиПеремещенияТоваров(ТекДокументОбъект)
	
	// Очистка табличных частей, т.к. будет их перезаполнение.
	ТекДокументОбъект.Товары.Очистить();
	ТекДокументОбъект.ВидыЗапасов.Очистить();
	ТекДокументОбъект.Серии.Очистить();
	ТекДокументОбъект.ДополнительныеРеквизиты.Очистить();

КонецПроцедуры

#КонецОбласти

// Функция ищет все связанные и проведенные с док. "Выпуск блюд" документы "Списание затрат на выпуск"
//  и перезаписывает их с отменой проведения.
//
// Параметры:
//  Документпит		 - ДокументСсылка	 - Ссылка на документ пита, по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция ОтменитьПроведениеТиповогоДокументаПоДокументупит(Документпит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "", ИмяОтменяемогоДокумента = "", Причина = Неопределено, Синхронизировать = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент
	|ПОМЕСТИТЬ втСписанияЗатрат
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|	%ТипДокумента%
	|	%Причина%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСписанияЗатрат.ТиповойДокумент
	|ИЗ
	|	втСписанияЗатрат КАК втСписанияЗатрат
	|ГДЕ
	|	втСписанияЗатрат.ТиповойДокумент.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	втСписанияЗатрат.ТиповойДокумент УБЫВ";
	Запрос.УстановитьПараметр("Документпит",Документпит);
	
	Если НЕ Причина = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Причина%", "И питТиповыеДокументы.ПричинаТиповогоДокумента = &Причина");
		Запрос.УстановитьПараметр("Причина", Причина);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Причина%", "");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ИмяОтменяемогоДокумента) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "И питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ."+ИмяОтменяемогоДокумента+"");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипДокумента%", "");
	КонецЕсли; 
	
	//<< Портал-Юг, Баринов, 2019.03.26 [5.3.6 Чтение и изменение данных инвентаризации товаров]
	// На чтение и изменение типовых документов прав может не быть
	УстановитьПривилегированныйРежим(Истина);
	//>> Портал-Юг, Баринов, 2019.03.26
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекДокОбъект = Выборка.ТиповойДокумент.ПолучитьОбъект();
		Попытка
			УстановитьПривилегированныйРежим(Истина);
			ТекДокОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ТекДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			УстановитьПривилегированныйРежим(Ложь);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка отмены проведения документа """ + ТекДокОбъект.Метаданные().Представление() + """
			| по документу Общепит """+Документпит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
		Если Синхронизировать Тогда
			// При отмене проведения сразу добавляем док в результирующую таблицу, что он синхронизирован.
			ДобавитьНовуюЗапись(Документпит, ТекДокОбъект, тблСозданныеДокументы, Причина, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	//<< Портал-Юг, Баринов, 2019.03.26 [5.3.6 Чтение и изменение данных инвентаризации товаров]
	УстановитьПривилегированныйРежим(Ложь);
	//>> Портал-Юг, Баринов, 2019.03.26
	
	Возврат Истина;
	
КонецФункции

// Функция ищет все связанные и проведенные с док. "Выпуск блюд" и отменяет их проведение в обратном порядке 
//  отосительно того, как документы были созданы.
//
// Параметры:
//  Документпит		 - ДокументСсылка	 - Ссылка на документ пита, по которому формируются
//  	типовые документы.
//  СтруктураПараметров		 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Результирующая таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция ОтменитьПроведениеТиповыхДокументовПоВыпускуБлюд(Документпит, СтруктураПараметров, тблСозданныеДокументы, ТекстОшибки = "")
	
	//<<===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021 [SD31412]   
	пл_БылиПривилегии = ПривилегированныйРежим();
	Если пл_БылиПривилегии = Ложь Тогда
	    УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 
	//>>===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021	
	
	//+ОтложенноеПроведение
	Если НЕ СтруктураПараметров.Свойство("питИспользоватьОтложенноеПроведениеВыпускаБлюд") Тогда
		СтруктураПараметров.Вставить("питИспользоватьОтложенноеПроведениеВыпускаБлюд", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питИспользоватьОтложенноеПроведениеВыпускаБлюд"));
	КонецЕсли;
	Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд
		И НЕ СтруктураПараметров.Свойство("питТекущийПриоритетДействияОтложенногоПроведения") Тогда
		СтруктураПараметров.Вставить("питТекущийПриоритетДействияОтложенногоПроведения", ПолучитьТекущийПриоритетДействияОтложенногоПроведения(Документпит));
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Если НЕ СтруктураПараметров.Свойство("ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд") Тогда
		СтруктураПараметров.Вставить("ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд", ПолучитьТаблицуПорядокПроведенияТиповыхДокументовВыпускаБлюд(СтруктураПараметров));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питТиповыеДокументы.ТиповойДокумент,
	|	питТиповыеДокументы.ПричинаТиповогоДокумента
	|ПОМЕСТИТЬ втВсеТиповые
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	питТиповыеДокументы.ДокументОбщепит = &Документпит
	|;";
	
	Сч = 0;
	Для каждого ТекСтрокаТаблица Из СтруктураПараметров.ТаблицаПорядокПроведенияТиповыхДокументовВыпускаБлюд Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|%ОбъединитьВсе%
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(питТиповыеДокументы.ТиповойДокумент КАК Документ.%ИмяТиповогоДокумента%) КАК ТиповойДокумент,
		|	питТиповыеДокументы.ПричинаТиповогоДокумента КАК ПричинаТиповогоДокумента,
		|	%Порядок% КАК Порядок,
		|	%ИмяТиповогоДокументаСтрока% КАК ИмяТиповогоДокумента
		|%ПОМЕСТИТЬ% 
		|ИЗ
		|	втВсеТиповые КАК питТиповыеДокументы
		|ГДЕ
		|	питТиповыеДокументы.ТиповойДокумент ССЫЛКА Документ.%ИмяТиповогоДокумента%
		|	%ПричинаТиповогоДокумента%
		|";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ОбъединитьВсе%", ?(Сч = 0, "", " ОБЪЕДИНИТЬ ВСЕ "));
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ПОМЕСТИТЬ%", ?(Сч = 0, " ПОМЕСТИТЬ втТиповыеДокументы ", ""));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяТиповогоДокумента%", ТекСтрокаТаблица.ИмяТиповогоДокумента);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ПричинаТиповогоДокумента%", "И питТиповыеДокументы.ПричинаТиповогоДокумента = &Причина"+ТекСтрокаТаблица.Порядок);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Порядок%", "&Порядок"+ТекСтрокаТаблица.Порядок);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяТиповогоДокументаСтрока%", "&ИмяТиповогоДокумента"+ТекСтрокаТаблица.Порядок);
		
		Запрос.УстановитьПараметр("Причина"+ТекСтрокаТаблица.Порядок, ТекСтрокаТаблица.ПричинаТиповогоДокумента);
		Запрос.УстановитьПараметр("Порядок"+ТекСтрокаТаблица.Порядок, ТекСтрокаТаблица.Порядок);
		Запрос.УстановитьПараметр("ИмяТиповогоДокумента"+ТекСтрокаТаблица.Порядок, ТекСтрокаТаблица.ИмяТиповогоДокумента);
		
		Сч = Сч + 1;
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТиповыеДокументы.ТиповойДокумент,
	|	втТиповыеДокументы.ПричинаТиповогоДокумента,
	|	втТиповыеДокументы.Порядок,
	|	втТиповыеДокументы.ИмяТиповогоДокумента
	|ИЗ
	|	втТиповыеДокументы КАК втТиповыеДокументы
	|ГДЕ
	|	втТиповыеДокументы.ТиповойДокумент.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	втТиповыеДокументы.Порядок УБЫВ,
	|	втТиповыеДокументы.ТиповойДокумент УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(ТиповойДокумент),
	|	МАКСИМУМ(ИмяТиповогоДокумента)
	|ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("Документпит",Документпит);
	
	СтароеЗначениеПараметраСеанса = ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций;
	ПорядокПроизводствБезЗаказа = -1;
	
	ВыборкаВерхняя = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВерхняя.Следующий() Цикл
		
		Если (ВыборкаВерхняя.ИмяТиповогоДокумента = "ДвижениеПродукцииИМатериалов"
			И ВыборкаВерхняя.ПричинаТиповогоДокумента = 0)
			ИЛИ ВыборкаВерхняя.ИмяТиповогоДокумента = "ПроизводствоБезЗаказа" Тогда
			ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = Истина;
		КонецЕсли;
		
		КоличествоДокументов = ВыборкаВерхняя.ТиповойДокумент;
		ТекКоличествоДокументов = 0;
		
		ВыборкаДетальная = ВыборкаВерхняя.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ТекКоличествоДокументов = ТекКоличествоДокументов + 1;
			
			Если КоличествоДокументов = ТекКоличествоДокументов Тогда
				ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = СтароеЗначениеПараметраСеанса;
			КонецЕсли;
			
			ТекДокОбъект = ВыборкаДетальная.ТиповойДокумент.ПолучитьОбъект();
			
			//+ОтложенноеПроведение
			Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
				ВсеОк = ДобавитьДействиеОтложенногоПроведения(Документпит, Перечисления.питДействияОтложенногоПроведения.ОтменитьПроведениеТиповогоДокумента	, ВыборкаДетальная.ТиповойДокумент, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
				СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
				Если НЕ ВсеОк Тогда 
					//<<===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021 [SD31412]   
					Если пл_БылиПривилегии = Ложь Тогда
					    УстановитьПривилегированныйРежим(Ложь);
					КонецЕсли; 
					//>>===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021
					Возврат ВсеОк;
				КонецЕсли;
			Иначе
			//-ОтложенноеПроведение
				
				Попытка
					ТекДокОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
					ТекДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Если СтруктураПараметров.Свойство("ПометкаУдаленияНовая")
						И СтруктураПараметров.ПометкаУдаленияНовая <> ТекДокОбъект.ПометкаУдаления Тогда
						ТекДокОбъект.УстановитьПометкуУдаления(СтруктураПараметров.ПометкаУдаленияНовая);
					КонецЕсли;
				Исключение
					ТекстОшибки = ТекстОшибки + "
					|Ошибка отмены проведения документа """ + ТекДокОбъект.Метаданные().Представление() + """
					| по документу Общепит """+Документпит+"""
					|по причине: <"+ОписаниеОшибки()+">";
					//<<===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021 [SD31412]   
					Если пл_БылиПривилегии = Ложь Тогда
					    УстановитьПривилегированныйРежим(Ложь);
					КонецЕсли; 
					//>>===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021					
					Возврат Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
			Если СтруктураПараметров.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				
				//+ОтложенноеПроведение
				Если СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд Тогда
					ВсеОк = ДобавитьДействиеОтложенногоПроведения(Документпит, Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента	, ВыборкаДетальная.ТиповойДокумент, СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения,ТекстОшибки);
					СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения = СтруктураПараметров.питТекущийПриоритетДействияОтложенногоПроведения + 1;
					Если НЕ ВсеОк Тогда 
						//<<===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021 [SD31412]   
						Если пл_БылиПривилегии = Ложь Тогда
						    УстановитьПривилегированныйРежим(Ложь);
						КонецЕсли; 
						//>>===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021
						Возврат ВсеОк;
					КонецЕсли;
				КонецЕсли;
				//-ОтложенноеПроведение
				
				//+ОтложенноеПроведение
				ТекСинхронизирован = ?(СтруктураПараметров.питИспользоватьОтложенноеПроведениеВыпускаБлюд, Ложь, Истина);
				//-ОтложенноеПроведение
				
				// При отмене проведения сразу добавляем док в результирующую таблицу, что он синхронизирован.
				ДобавитьНовуюЗапись(Документпит, ТекДокОбъект, тблСозданныеДокументы, ВыборкаДетальная.ПричинаТиповогоДокумента, ТекСинхронизирован);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = СтароеЗначениеПараметраСеанса;
	
	//<<===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021 [SD31412]   
	Если пл_БылиПривилегии = Ложь Тогда
	    УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	//>>===Портал-Юг Крым === Плотникова Н.Ю. 03.02.2021
	Возврат Истина;
	
КонецФункции

// Функция получает таблицу порядка проведения типовых документов выпуска блюд.
//
// Параметры:
//  СтруктураПараметров	 - Структура - Структура параметров.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица порядка проведения типовых документов выпуска блюд.
//
Функция ПолучитьТаблицуПорядокПроведенияТиповыхДокументовВыпускаБлюд(СтруктураПараметров, ОпорнаяДата = Неопределено)
	
	ИмяДокументаВнутреннееПотребление = питОбратнаяСовместимостьПовтИсп.ИмяДокументаВнутреннееПотребление();
	
	Если СтруктураПараметров.Свойство("ФормироватьДокументыПроизводства22") Тогда
		ФормироватьДокументыПроизводства22 = СтруктураПараметров.ФормироватьДокументыПроизводства22;
	Иначе
		ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
	КонецЕсли;
	
	// Задача заполнить базовое смещение по дате для каждого подкладного документа, причем сделать это так, чтобы не
	//  выйти за пределы дня опорной даты(даты выпуска блюд).
	Если НЕ ОпорнаяДата = Неопределено Тогда
		СекундСНачалаДня = ОпорнаяДата - НачалоДня(ОпорнаяДата);
	Иначе
		СекундСНачалаДня = 60*60*24; // Значение по умолчанию.
	КонецЕсли;
	МаксимальноеБазовоеСмещение = ?(ФормироватьДокументыПроизводства22, 4, 5);
	Дельта = МаксимальноеБазовоеСмещение - СекундСНачалаДня;
	СдвигБазового = ?(Дельта > 0, Дельта, 0);
	
	КвалификаторыЧисла	= Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Любой);
	ОписаниеЧисла30		= Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	ПорядокПроведенияТиповыхДокументов = Новый ТаблицаЗначений;
	ПорядокПроведенияТиповыхДокументов.Колонки.Добавить("ИмяТиповогоДокумента"		, Новый ОписаниеТипов("Строка"));
	ПорядокПроведенияТиповыхДокументов.Колонки.Добавить("ПричинаТиповогоДокумента"	, ОписаниеЧисла30);
	ПорядокПроведенияТиповыхДокументов.Колонки.Добавить("Порядок"					, ОписаниеЧисла30);
	ПорядокПроведенияТиповыхДокументов.Колонки.Добавить("БазовоеСмещение"			, ОписаниеЧисла30);
	Если ФормироватьДокументыПроизводства22 Тогда
		НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
		НовСтрокаПорядок.ИмяТиповогоДокумента		= "ДвижениеПродукцииИМатериалов";
		НовСтрокаПорядок.ПричинаТиповогоДокумента	= 2;
		НовСтрокаПорядок.Порядок					= 0;
		НовСтрокаПорядок.БазовоеСмещение			= 4 - СдвигБазового;
		НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
		НовСтрокаПорядок.ИмяТиповогоДокумента		= "ОприходованиеИзлишковТоваров";
		НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
		НовСтрокаПорядок.Порядок					= 1;
		НовСтрокаПорядок.БазовоеСмещение			= 3 - СдвигБазового;
		НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
		НовСтрокаПорядок.ИмяТиповогоДокумента		= "ПроизводствоБезЗаказа";
		НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
		НовСтрокаПорядок.Порядок					= 2;
		НовСтрокаПорядок.БазовоеСмещение			= 2 - СдвигБазового;
		НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
		НовСтрокаПорядок.ИмяТиповогоДокумента		= "ДвижениеПродукцииИМатериалов";
		НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
		НовСтрокаПорядок.Порядок					= 3;
		НовСтрокаПорядок.БазовоеСмещение			= 2 - СдвигБазового;
	Иначе
		НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
		НовСтрокаПорядок.ИмяТиповогоДокумента		= "ОприходованиеИзлишковТоваров";
		НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
		НовСтрокаПорядок.Порядок					= 0;
		НовСтрокаПорядок.БазовоеСмещение			= 5 - СдвигБазового;
		НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
		НовСтрокаПорядок.ИмяТиповогоДокумента		= "ПередачаМатериаловВПроизводство";
		НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
		НовСтрокаПорядок.Порядок					= 1;
		НовСтрокаПорядок.БазовоеСмещение			= 4 - СдвигБазового;
		НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
		НовСтрокаПорядок.ИмяТиповогоДокумента		= "ВыпускПродукции";
		НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
		НовСтрокаПорядок.Порядок					= 2;
		НовСтрокаПорядок.БазовоеСмещение			= 3 - СдвигБазового;
		НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
		НовСтрокаПорядок.ИмяТиповогоДокумента		= "СписаниеЗатратНаВыпуск";
		НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
		НовСтрокаПорядок.Порядок					= 3;
		НовСтрокаПорядок.БазовоеСмещение			= 2 - СдвигБазового;
	КонецЕсли;
	НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
	НовСтрокаПорядок.ИмяТиповогоДокумента		= "ДвижениеПродукцииИМатериалов";
	НовСтрокаПорядок.ПричинаТиповогоДокумента	= 1;
	НовСтрокаПорядок.Порядок					= 4;
	НовСтрокаПорядок.БазовоеСмещение			= 1 - СдвигБазового;
	НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
	НовСтрокаПорядок.ИмяТиповогоДокумента		= "ПеремещениеТоваров";
	НовСтрокаПорядок.ПричинаТиповогоДокумента	= 1;
	НовСтрокаПорядок.Порядок					= 5;
	НовСтрокаПорядок.БазовоеСмещение			= 1 - СдвигБазового;
	НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
	НовСтрокаПорядок.ИмяТиповогоДокумента		= "ОтчетОРозничныхПродажах";
	НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
	НовСтрокаПорядок.Порядок					= 6;
	НовСтрокаПорядок.БазовоеСмещение			= 0 - СдвигБазового;
	НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
	НовСтрокаПорядок.ИмяТиповогоДокумента		= "РеализацияТоваровУслуг";
	НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
	НовСтрокаПорядок.Порядок					= 7;
	НовСтрокаПорядок.БазовоеСмещение			= 0 - СдвигБазового;
	НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
	НовСтрокаПорядок.ИмяТиповогоДокумента		= "ДвижениеПродукцииИМатериалов";
	НовСтрокаПорядок.ПричинаТиповогоДокумента	= 3;
	НовСтрокаПорядок.Порядок					= 8;
	НовСтрокаПорядок.БазовоеСмещение			= 0 - СдвигБазового;
	НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
	НовСтрокаПорядок.ИмяТиповогоДокумента		= "ПеремещениеТоваров";
	НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
	НовСтрокаПорядок.Порядок					= 9;
	НовСтрокаПорядок.БазовоеСмещение			= 0 - СдвигБазового;
	НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
	НовСтрокаПорядок.ИмяТиповогоДокумента		= ИмяДокументаВнутреннееПотребление;
	НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
	НовСтрокаПорядок.Порядок					= 10;
	НовСтрокаПорядок.БазовоеСмещение			= 0 - СдвигБазового;
	НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
	НовСтрокаПорядок.ИмяТиповогоДокумента		= "питКорректировкаОстатковИС";
	НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
	НовСтрокаПорядок.Порядок					= 11;
	НовСтрокаПорядок.БазовоеСмещение			= 0 - СдвигБазового;
	//>>Швецов. 17.03.2025. Отмена проведения акта списания по выпуску блюд
	НовСтрокаПорядок = ПорядокПроведенияТиповыхДокументов.Добавить();
	НовСтрокаПорядок.ИмяТиповогоДокумента		= "АктСписанияЕГАИС";
	НовСтрокаПорядок.ПричинаТиповогоДокумента	= 0;
	НовСтрокаПорядок.Порядок					= 12;
	НовСтрокаПорядок.БазовоеСмещение			= 0 - СдвигБазового;
	//<<
	
	Возврат ПорядокПроведенияТиповыхДокументов;
	
КонецФункции

// Функция обновляет регистр сведений "Типовые документы" по переданной таблице значений.
//
// Параметры:
//  тблСозданныеДокументы	 - ТаблицаЗначений	 - Таблица созданных документов.
//  ТекстОшибки				 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно
//  Ложь         - при выполнении функции возникли ошибки
//
Функция ОбновитьРегистрТиповыеДокументы(тблСозданныеДокументы, ТекстОшибки = "")
	
	// Регистраторы регистра потребностей
	
	// Запись движений
	Для Каждого ТекСтрока Из тблСозданныеДокументы Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ТиповойДокумент) И ЗначениеЗаполнено(ТекСтрока.ДокументОбщепит) Тогда
			
			мМенеджерЗаписи = РегистрыСведений.питТиповыеДокументы.СоздатьМенеджерЗаписи();
			мМенеджерЗаписи.ТиповойДокумент				= ТекСтрока.ТиповойДокумент;
			мМенеджерЗаписи.ДокументОбщепит				= ТекСтрока.ДокументОбщепит;
			мМенеджерЗаписи.ПричинаТиповогоДокумента	= ТекСтрока.ПричинаТиповогоДокумента;
			мМенеджерЗаписи.Синхронизирован				= ТекСтрока.Синхронизирован;
			
			Попытка
				мМенеджерЗаписи.Записать();
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка обновления регистра сведений ""Типовые документы"":
				|" + ОписаниеОшибки();
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// (не используется) Процедура заполнения общих реквизитов типового документа по документу Общепит
//
// Параметры:
//  мДокументпит - ДокументСсылка - Ссылка на отраслевой документ.
//  мТиповойДокумент - ДокументОбъект - Документ-объект, который заполняем.
//
Процедура ЗаполнитьОбщиеРеквизиты(мДокументпит, мТиповойДокумент)
	
	мМетаданныеТиповогоДокумента	= мТиповойДокумент.Метаданные();
	мМетаданныеДокументапит		= мДокументпит.Метаданные();
	
	мТиповойДокумент.Дата = мДокументпит.Дата;
		
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.Организация		= мДокументпит.Организация;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", мМетаданныеТиповогоДокумента) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", мМетаданныеДокументапит) Тогда
			мТиповойДокумент.Подразделение 		= мДокументпит.Подразделение;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ПодразделениеОрганизации", мМетаданныеДокументапит) Тогда
			мТиповойДокумент.Подразделение 		= мДокументпит.ПодразделениеОрганизации;
		КонецЕсли;
	КонецЕсли;	
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПодразделениеОрганизации", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("ПодразделениеОрганизации", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.ПодразделениеОрганизации 	= мДокументпит.ПодразделениеОрганизации;
	КонецЕсли;	
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаВключаетНДС", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаВключаетНДС", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.СуммаВключаетНДС 	= мДокументпит.СуммаВключаетНДС;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ЦенаВключаетНДС", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаВключаетНДС", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.ЦенаВключаетНДС 	= мДокументпит.СуммаВключаетНДС;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", мМетаданныеТиповогоДокумента)
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.Контрагент = мДокументпит.Контрагент;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", мМетаданныеТиповогоДокумента) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента", мМетаданныеДокументапит) Тогда
			мТиповойДокумент.Договор = мДокументпит.ДоговорКонтрагента;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", мМетаданныеДокументапит) Тогда
			мТиповойДокумент.Договор = мДокументпит.Договор;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", мМетаданныеДокументапит) Тогда
		
		мТиповойДокумент.Валюта = мДокументпит.ВалютаДокумента;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", мМетаданныеДокументапит) Тогда
		
		мТиповойДокумент.Валюта = мДокументпит.Валюта;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НалогообложениеНДС", мМетаданныеТиповогоДокумента)
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("УчитыватьНДС", мМетаданныеДокументапит) Тогда
		
		Если мДокументпит.УчитыватьНДС Тогда
			мТиповойДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Иначе
			мТиповойДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ЗакупкаПодДеятельность", мМетаданныеТиповогоДокумента)
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("УчитыватьНДС", мМетаданныеДокументапит) Тогда
		
		Если мДокументпит.УчитыватьНДС Тогда
			мТиповойДокумент.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Иначе
			мТиповойДокумент.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.Склад 				= мДокументпит.Склад;
	КонецЕсли;
	
	//в некоторых документах УПП вместо реквизита "Склад" - реквизит "СкладОрдер" составного типа
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОрдер", мМетаданныеТиповогоДокумента)
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.ВидПоступления				= Перечисления.ВидыПоступленияТоваров.НаСклад;
		мТиповойДокумент.СкладОрдер 				= мДокументпит.Склад;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Комментарий", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Комментарий", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.Комментарий = мДокументпит.Комментарий;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.Ответственный = мДокументпит.Ответственный;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерВходящегоДокумента", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерВходящегоДокумента", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.НомерВходящегоДокумента = мДокументпит.НомерВходящегоДокумента;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаВходящегоДокумента", мМетаданныеТиповогоДокумента) 
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаВходящегоДокумента", мМетаданныеДокументапит) Тогда
		мТиповойДокумент.ДатаВходящегоДокумента = мДокументпит.ДатаВходящегоДокумента;
	КонецЕсли;
	
КонецПроцедуры

// Добавляет новую запись в таблицу со значениями измерений мТиповойДокумент и мДокументпит
//
// Параметры:
//  мДокументпит				 - ДокументСсылка	 - Ссылка на документ "пит".
//  мТиповойДокумент			 - ДокументОбъект	 - Ссылка на типовой документ.
//  тблСозданныеДокументы		 - ТаблицаЗначений	 - Таблица созданных документов.
//  ПричинаТиповогоДокумента	 - Число			 - Индекс, указывающий на назначение типового документа.
//   По умолчанию равен 0. Используется для:
//   - документа "ДвижениеПродукцииИМатериалов":
//    0 - При приготовлении полуфабрикатов на разных подразделениях(константа "питПодразделениеПроизводстваПолуфабрикатов");
//    1 - В выпуске с розничной реализацией для перемещения на склад реализации, если кладовая и склад реализации отличаются;
//    2 - При перемещений из кладовых производства;
//    3 - В выпуске с перемещением для перемещения на финальный склад в случае, если исходный является цеховой кладовой;
//
Процедура ДобавитьНовуюЗапись(мДокументпит, мТиповойДокумент, тблСозданныеДокументы, ПричинаТиповогоДокумента = 0, Синхронизирован = Истина)
	
	НоваяСтрока = тблСозданныеДокументы.Добавить();
	НоваяСтрока.ДокументОбщепит		= мДокументпит;
	НоваяСтрока.ТиповойДокумент		= мТиповойДокумент.Ссылка;
	НоваяСтрока.ПричинаТиповогоДокумента	= ПричинаТиповогоДокумента;
	НоваяСтрока.Синхронизирован				= Синхронизирован;
	
КонецПроцедуры

// Функция определяет параметры записи типового документа, такие как режим записи, пометка удаления.
//
// Параметры:
//  ДокпитПроведен	 - Булево	 - Признак проведения документа "пит".
//  ДокпитПомечен	 - Булево	 - Признак пометки на удаление документа "пит".
//  ТДПроведен			 - Булево	 - Признак проведения типового документа.
//  ТДПомечен			 - Булево	 - Признак пометки удаления типового документа.
//  ДопПараметры		 - Структура - Структура доп. параметров, которые используются при формировани типовых документов.
// 
// Возвращаемое значение:
//  Структура - Параметры записи типового документа.
//
Функция ОпределитьПараметрыЗаписиТиповогоДокумента(ДокпитПроведен, ДокпитПомечен, ТДПроведен = Неопределено, ТДПомечен, ДопПараметры)
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("НужнаУстановкаПометкиУдаления"	,Ложь);
	ПараметрыЗаписи.Вставить("ПометкаУдаления"					,Ложь);
	ПараметрыЗаписи.Вставить("РежимЗаписи"						,Неопределено);
	
	// Нужно ли помечать на удаление типовой документ?
	Если ДопПараметры.Свойство("НужнаУстановкаПометкиУдаления") И НЕ ДопПараметры.НужнаУстановкаПометкиУдаления = Неопределено 
		И ДопПараметры.Свойство("ПометкаУдаления") И НЕ ДопПараметры.ПометкаУдаления = Неопределено Тогда
		
		ПараметрыЗаписи.НужнаУстановкаПометкиУдаления			= ДопПараметры.НужнаУстановкаПометкиУдаления;
		ПараметрыЗаписи.ПометкаУдаления							= ДопПараметры.ПометкаУдаления;
	ИначеЕсли ДокпитПомечен И НЕ ТДПомечен Тогда
		ПараметрыЗаписи.НужнаУстановкаПометкиУдаления			= Истина;
		ПараметрыЗаписи.ПометкаУдаления							= Истина;
	ИначеЕсли НЕ ДокпитПомечен И ТДПомечен Тогда
		ПараметрыЗаписи.НужнаУстановкаПометкиУдаления			= Истина;
		ПараметрыЗаписи.ПометкаУдаления							= Ложь;
	Иначе // пометка удаления не отличается.
		ПараметрыЗаписи.НужнаУстановкаПометкиУдаления			= Ложь;
	КонецЕсли;
	
	////////////////////////////
	// Определение режима записи
	
	ОпределятьРежимЗаписи = Истина;
	Если ДопПараметры.Свойство("ОпределятьРежимЗаписи") Тогда
		ОпределятьРежимЗаписи = ДопПараметры.ОпределятьРежимЗаписи;
	КонецЕсли;
	
	Если ОпределятьРежимЗаписи Тогда
		
		Если ДопПараметры.Свойство("РежимЗаписи") И НЕ ДопПараметры.РежимЗаписи = Неопределено Тогда
			ТекРежимЗаписи = ДопПараметры.РежимЗаписи;
		ИначеЕсли ДокпитПроведен Тогда
			ТекРежимЗаписи = РежимЗаписиДокумента.Проведение;
		ИначеЕсли НЕ ДокпитПроведен И ТДПроведен Тогда
			ТекРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		ИначеЕсли НЕ ДокпитПроведен И НЕ ТДПроведен Тогда
			ТекРежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		ПараметрыЗаписи.РежимЗаписи = ТекРежимЗаписи;
		
	КонецЕсли;
	
	////////////////////////////
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

// Функция удаляет связь между типовым документом и документом общепита по регистру "питТиповыеДокументы"
//
// Параметры:
//  ТиповойДокумент	 - ДокументСсылка - Ссылка на типовой документ.
//  ДокументПит		 - ДокументСсылка - Ссылка на документ общепит.
//  ТекстОшибки		 - Строка - ТекстОшибки
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции
//
Функция УдалитьСвязьТиповогоДокументаСДокументомПит(ТиповойДокумент, ДокументПит, ТекстОшибки = "")
	
	МенеджерЗаписи = РегистрыСведений.питТиповыеДокументы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДокументОбщепит = ДокументПит;
	МенеджерЗаписи.ТиповойДокумент = ТиповойДокумент;
	
	Попытка
		МенеджерЗаписи.Удалить();
	Исключение
		ТекстОшибки = "Ошибка удаления связи типового документа с документом общепит по причине: 
		|< "+ ОписаниеОшибки() + " >";
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция помечает на удаление и удаляет связь переданного массива типовых типовых документов
//  с переданным документом пит. Пметка на удаление происходит в том порядке, в котором документы пришли в массиве.
//
// Параметры:
//  ДокументПит			 - ДокументСсылка	 - Ссылка на документ Общепита
//  ТиповыеДокументы	 - Массив			 - Массив ссылок на типовые документы.
//  СтруктураПараметров	 - Структура		 - Структура, содержащая некоторые дополнительные параметры формирования.
//  ТекстОшибки			 - Строка			 - В случае ошибочного выполнения в эту переменную будет
//  			дописан текст ошибки.
// 
// Возвращаемое значение:
//  Истина - Выполнение функции завершено успешно.
//  Ложь - При выполнении функции возникли ошибки.
//
Функция ПометитьНаУдалениеИОтвязатьТиповыеДокументы(ДокументПит, ТиповыеДокументы, СтруктураПараметров, ТекстОшибки)
	
	Для каждого ТиповойДокумент Из ТиповыеДокументы Цикл
		
		Попытка
			ДокОбъект = ТиповойДокумент.ПолучитьОбъект();
			ДокОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
			ДокОбъект.УстановитьПометкуУдаления(Истина);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка при установке пометки удаления """ + ДокОбъект.Метаданные().Представление() + """
			| по документу Общепит """+ДокументПит+"""
			|по причине: <"+ОписаниеОшибки()+">";
			Возврат Ложь;
		КонецПопытки;
		
		ВсеОк = УдалитьСвязьТиповогоДокументаСДокументомПит(ТиповойДокумент, ДокументПит, ТекстОшибки);
		Если НЕ ВсеОк Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//+Серии
// Процедура заполняет серии типового документа перед его записью/проведением.
//
// Параметры:
//  ТекДокументОбъект		 - ДокументОбъект - Обьъект документа, в котором происходит заполнение серий.
//  ПричинаТиповогоДокумента - Число - Причина типового документа
//   По умолчанию равен 0. Используется для:
//   - документа "ДвижениеПродукцииИМатериалов":
//    0 - При приготовлении полуфабрикатов на разных подразделениях(константа "питПодразделениеПроизводстваПолуфабрикатов");
//    1 - В выпуске с розничной реализацией для перемещения на склад реализации, если кладовая и склад реализации отличаются;
//    2 - При перемещений из кладовых производства;
//    3 - В выпуске с перемещением для перемещения на финальный склад в случае, если исходный является цеховой кладовой;
//
Процедура ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ТекДокументОбщепит, ПричинаТиповогоДокумента = 0, тблСозданныеДокументы = Неопределено)
	
	ИмяДокументаВнутреннееПотребление = питОбратнаяСовместимостьПовтИсп.ИмяДокументаВнутреннееПотребление();
	
	Если ТипЗнч(ТекДокументОбщепит) = Тип("ДокументОбъект.питВыпускБлюд")
		ИЛИ ТипЗнч(ТекДокументОбщепит) = Тип("ДокументСсылка.питВыпускБлюд") Тогда
		
		// В зависимости от типа документа и причины типового документа заполнение серий происходит по разному.
		Если ТипЗнч(ТекДокументОбъект) = Тип("ДокументОбъект.ПроизводствоБезЗаказа") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ПроизводствоБезЗаказа));
			
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий["ВыходныеИзделия"]);
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий["МатериалыИРаботы"]);
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий["ПобочныеИзделия"]);
			
			питПроизводство.ЗаполнитьСерииПоFEFO(ТекДокументОбъект,ПараметрыУказанияСерий["МатериалыИРаботы"], , тблСозданныеДокументы);
			
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий["ВыходныеИзделия"]);
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий["ПобочныеИзделия"]);
			
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий["ВыходныеИзделия"]);
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий["ПобочныеИзделия"]);
			
		ИначеЕсли ТипЗнч(ТекДокументОбъект) = Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов") Тогда
			
			Если ПричинаТиповогоДокумента = 0 Тогда
				
				// Движение продукции из подразделений производства полуфабрикатов.
				ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ДвижениеПродукцииИМатериалов));
				НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
				//Здесь не может быть случая, когда необходимо заполнять по FEFO, т.к. перемещаются только что приготовленные ПФ по служебной серии.
				ТекДокументОбъект.Серии.Очистить();
				питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
				
			ИначеЕсли ПричинаТиповогоДокумента = 1 Тогда
				
				// Движение продукции на склад реализации.
				ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ДвижениеПродукцииИМатериалов));
				НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
				питПроизводство.ЗаполнитьСерииПоFEFO(ТекДокументОбъект,ПараметрыУказанияСерий); 
				питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
				питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий);
				
			ИначеЕсли ПричинаТиповогоДокумента = 2 Тогда
				
				// Движение продукции из разрешенных кладовых.
				ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ДвижениеПродукцииИМатериалов));
				НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
				питПроизводство.ЗаполнитьСерииПоFEFO(ТекДокументОбъект,ПараметрыУказанияСерий); 
				питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
				питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий);
				
			ИначеЕсли ПричинаТиповогоДокумента = 3 Тогда
				
				// Перемещение из кладовой на склад получатель.
				ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ДвижениеПродукцииИМатериалов));
				НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
				питПроизводство.ЗаполнитьСерииПоFEFO(ТекДокументОбъект,ПараметрыУказанияСерий);
				питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
				питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий);
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ТекДокументОбъект) = Тип("ДокументОбъект.ОтчетОРозничныхПродажах") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ОтчетОРозничныхПродажах));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииПоFEFO(ТекДокументОбъект,ПараметрыУказанияСерий); 
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий, Ложь);
			
		ИначеЕсли ТипЗнч(ТекДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.РеализацияТоваровУслуг));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииПоFEFO(ТекДокументОбъект,ПараметрыУказанияСерий); 
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий, Ложь);
			
		ИначеЕсли ТипЗнч(ТекДокументОбъект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
			
			// ПричинаТиповогоДокумента = 0 - комплексный документ Перемещение товаров
			// ПричинаТиповогоДокумента = 1 - перемещение продукции на склад реализации.
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ПеремещениеТоваров));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииПоFEFO(ТекДокументОбъект,ПараметрыУказанияСерий); 
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий);
			
		ИначеЕсли ТипЗнч(ТекДокументОбъект) = Тип(СтрШаблон("ДокументОбъект.%1", ИмяДокументаВнутреннееПотребление)) Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы[ИмяДокументаВнутреннееПотребление]));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТекДокументОбщепит) = Тип("ДокументОбъект.питИнвентаризацияТоваров")
		ИЛИ ТипЗнч(ТекДокументОбщепит) = Тип("ДокументСсылка.питИнвентаризацияТоваров") Тогда
		
		Если ТипЗнч(ТекДокументОбъект) = Тип("ДокументОбъект.ПересчетТоваров") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ПересчетТоваров));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТекДокументОбщепит) = Тип("ДокументОбъект.питПеремещениеНоменклатурыСкладаПроизводства")
		ИЛИ ТипЗнч(ТекДокументОбщепит) = Тип("ДокументСсылка.питПеремещениеНоменклатурыСкладаПроизводства") Тогда
		
		// В зависимости от типа документа и причины типового документа заполнение серий происходит по разному.
		Если ТипЗнч(ТекДокументОбъект) = Тип("ДокументОбъект.ПроизводствоБезЗаказа") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ПроизводствоБезЗаказа));
			
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий["ВыходныеИзделия"]);
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий["МатериалыИРаботы"]);
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий["ПобочныеИзделия"]);
			
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий["ВыходныеИзделия"]);
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий["ПобочныеИзделия"]);
			
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий["ВыходныеИзделия"]);
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий["ПобочныеИзделия"]);
			
		ИначеЕсли ТипЗнч(ТекДокументОбъект) = Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ДвижениеПродукцииИМатериалов));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий);
			
		ИначеЕсли ТипЗнч(ТекДокументОбъект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ТекДокументОбъект, Документы.ПеремещениеТоваров));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииВТЧСерииПоТЧТовары(ТекДокументОбъект, ПараметрыУказанияСерий);
			питПроизводство.ЗаполнитьСерииВТЧТоварыПоТЧСерииПоСебестоимости(ТекДокументОбъект, ПараметрыУказанияСерий);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//-Серии

//+ОтложенноеПроведение
#Область ОтложенноеПроведение

// Функция получает текущий максимальный приоритет действия отложенного проведения +1 для переданного документа Общепита.
//
// Параметры:
//  ДокументОбщепит	 - ДокументСсылка.питВыпускБлюд - Документ общепита.
// 
// Возвращаемое значение:
//  Число - Приоритет.
//
Функция ПолучитьТекущийПриоритетДействияОтложенногоПроведения(ДокументОбщепит) Экспорт
	
	Результат = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	питОчередьОтложенногоПроведения.Приоритет + 1 КАК ТекущийПриоритет
		|ИЗ
		|	РегистрСведений.питОчередьОтложенногоПроведения КАК питОчередьОтложенногоПроведения
		|ГДЕ
		|	питОчередьОтложенногоПроведения.ДокументОбщепит = &ДокументОбщепит
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТекущийПриоритет УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументОбщепит", ДокументОбщепит);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.ТекущийПриоритет;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция добавляет действие отложенного проведения в регистр.
//
// Параметры:
//  ДокументОбщепит	 - ДокументСсылка.питВыпускБлюд - Документ общепита.
//  Действие		 - ПеречислениеСсылка.питДействияОтложенногоПроведения - Действие отложенного проведения.
//  ТиповойДокумент	 - ДокументСсылка - Типовой документ.
//  Приоритет		 - Число - Приоритет действия.
//  ТекстОшибки		 - Строка - Строка, в которую будет записан текст ошибки в случае ее возникновения.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
Функция ДобавитьДействиеОтложенногоПроведения(ДокументОбщепит, Действие, ТиповойДокумент, Приоритет, ТекстОшибки = "") Экспорт
	
	МенеджерЗаписи = РегистрыСведений.питОчередьОтложенногоПроведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДокументОбщепит			= ДокументОбщепит;
	МенеджерЗаписи.Действие					= Действие;
	МенеджерЗаписи.ТиповойДокумент			= ТиповойДокумент;
	МенеджерЗаписи.Приоритет				= Приоритет;
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		ТекстОшибки = "Ошибка добавления действия отложенного проведения по причине: 
		|< "+ ОписаниеОшибки() + " >";
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция удаляет действия отложенного проведения по документу общепит.
//
// Параметры:
//  ДокументОбщепит	 - ДокументСсылка.питВыпускБлюд - Документ общепита.
//  Действие		 - ПеречислениеСсылка.питДействияОтложенногоПроведения - Действие отложенного проведения.
//  ТиповойДокумент	 - ДокументСсылка - Типовой документ.
//  ТекстОшибки		 - Строка - Строка, в которую будет записан текст ошибки в случае ее возникновения.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
Функция УдалитьДействияОтложенногоПроведенияПоДокументуОбщепит(ДокументОбщепит, ТекстОшибки = "") Экспорт
	
	НаборЗаписей = РегистрыСведений.питОчередьОтложенногоПроведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОбщепит.Установить(ДокументОбщепит);
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ТекстОшибки = "Ошибка удаления действий отложенного проведения по причине: 
		|< "+ ОписаниеОшибки() + " >";
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция удаляет действие отложенного проведения в регистр.
//
// Параметры:
//  ДокументОбщепит	 - ДокументСсылка.питВыпускБлюд - Документ общепита.
//  Действие		 - ПеречислениеСсылка.питДействияОтложенногоПроведения - Действие отложенного проведения.
//  ТиповойДокумент	 - ДокументСсылка - Типовой документ.
//  ТекстОшибки		 - Строка - Строка, в которую будет записан текст ошибки в случае ее возникновения.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
Функция УдалитьДействиеОтложенногоПроведения(ДокументОбщепит, Действие, ТиповойДокумент, ТекстОшибки = "")
	
	МенеджерЗаписи = РегистрыСведений.питОчередьОтложенногоПроведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДокументОбщепит			= ДокументОбщепит;
	МенеджерЗаписи.Действие					= Действие;
	МенеджерЗаписи.ТиповойДокумент			= ТиповойДокумент;
	Попытка
		МенеджерЗаписи.Удалить();
	Исключение
		ТекстОшибки = "Ошибка удаления действия отложенного проведения по причине: 
		|< "+ ОписаниеОшибки() + " >";
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция получаает текущее действие отложенного проведения по режиму записи типового документа.
//
// Параметры:
//  ТекРежимЗаписиДокумента	 - РежимЗаписиДокумента - Режим записи документа.
// 
// Возвращаемое значение:
// ПеречислениеСсылка.питДействияОтложенногоПроведения - Действие отложенного проведения.
//
Функция ПолучитьТекущееДействиеПоРежимузаписиТиповогоДокумента(ТекРежимЗаписиДокумента)
	
	ТекДействие = Перечисления.питДействияОтложенногоПроведения.ЗаписатьТиповойДокумент;
	Если ТекРежимЗаписиДокумента = РежимЗаписиДокумента.Проведение Тогда
		ТекДействие = Перечисления.питДействияОтложенногоПроведения.ПровестиТиповойДокумент;
	ИначеЕсли ТекРежимЗаписиДокумента = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ТекДействие = Перечисления.питДействияОтложенногоПроведения.ОтменитьПроведениеТиповогоДокумента;
	КонецЕсли;
	
	Возврат ТекДействие;
	
КонецФункции

// Функция получаает текущее действие отложенного проведения по режиму записи документа общепита.
//
// Параметры:
//  ТекРежимЗаписиДокумента	 - РежимЗаписиДокумента - Режим записи документа.
// 
// Возвращаемое значение:
// ПеречислениеСсылка.питДействияОтложенногоПроведения - Действие отложенного проведения.
//
Функция ПолучитьТекущееДействиеПоРежимузаписиДокументаОбщепит(ТекРежимЗаписиДокумента) Экспорт
	
	ТекДействие = Перечисления.питДействияОтложенногоПроведения.ЗаписатьДокументОбщепит;
	Если ТекРежимЗаписиДокумента = РежимЗаписиДокумента.Проведение Тогда
		ТекДействие = Перечисления.питДействияОтложенногоПроведения.ПровестиДокументОбщепит;
	ИначеЕсли ТекРежимЗаписиДокумента = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ТекДействие = Перечисления.питДействияОтложенногоПроведения.ОтменитьПроведениеДокументаОбщепит;
	КонецЕсли;
	
	Возврат ТекДействие;
	
КонецФункции

// Функция получаает текущее действие отложенного проведения по пометке удаления, которую необходимо установить.
//
// Параметры:
//  ТекПометкаУдаления	 - Булево - Текущая пометка удаления.
// 
// Возвращаемое значение:
// ПеречислениеСсылка.питДействияОтложенногоПроведения - Действие отложенного проведения.
//
Функция ПолучитьТекущееДействиеПоПометкеУдаленияТиповогоДокумента(ТекПометкаУдаления)
	
	Если ТекПометкаУдаления Тогда
		ТекДействие = Перечисления.питДействияОтложенногоПроведения.ПометитьНаУдалениеТиповойДокумент;
	Иначе
		ТекДействие = Перечисления.питДействияОтложенногоПроведения.СнятьПометкуУдаленияТиповойДокумент;
	КонецЕсли;
	Возврат ТекДействие;
	
КонецФункции

// Функция получаает режим записи типового документа по действию отложенного проведения.
//
// Параметры:
//  ПеречислениеСсылка.питДействияОтложенногоПроведения - Действие отложенного проведения.
// 
// Возвращаемое значение:
// РежимЗаписиДокумента - Режим записи документа.
//
Функция ПолучитьРежимЗаписиТиповогоДокументаПоТекущемуДействию(ТекущееДействие)
	
	ТекРежимЗаписиДокумента = Неопределено;
	Если ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ЗаписатьТиповойДокумент Тогда
		ТекРежимЗаписиДокумента = РежимЗаписиДокумента.Запись;
	ИначеЕсли ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ПровестиТиповойДокумент Тогда
		ТекРежимЗаписиДокумента = РежимЗаписиДокумента.Проведение;
	ИначеЕсли ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ОтменитьПроведениеТиповогоДокумента Тогда
		ТекРежимЗаписиДокумента = РежимЗаписиДокумента.ОтменаПроведения;
	КонецЕсли;
	
	Возврат ТекРежимЗаписиДокумента;
	
КонецФункции

// Функция получаает режим записи документа общепита по действию отложенного проведения.
//
// Параметры:
//  ПеречислениеСсылка.питДействияОтложенногоПроведения - Действие отложенного проведения.
// 
// Возвращаемое значение:
// РежимЗаписиДокумента - Режим записи документа.
//
Функция ПолучитьРежимЗаписиДокументаОбщепитПоТекущемуДействию(ТекущееДействие)
	
	ТекРежимЗаписиДокумента = Неопределено;
	Если ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ЗаписатьДокументОбщепит Тогда
		ТекРежимЗаписиДокумента = РежимЗаписиДокумента.Запись;
	ИначеЕсли ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ПровестиДокументОбщепит Тогда
		ТекРежимЗаписиДокумента = РежимЗаписиДокумента.Проведение;
	ИначеЕсли ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ОтменитьПроведениеДокументаОбщепит Тогда
		ТекРежимЗаписиДокумента = РежимЗаписиДокумента.ОтменаПроведения;
	КонецЕсли;
	
	Возврат ТекРежимЗаписиДокумента;
	
КонецФункции

// Процедура-обработчик регламентного задания по обработке очереди отложенного проведения.
//
Процедура питОбработкаОчередиОтложенногоПроведения(ПараметрыЗадания = Неопределено) Экспорт
	
	// Обработка очереди происходит в привелегированном режиме.
	УстановитьПривилегированныйРежим(Истина);
	
	// Получение списка организаций из параметров регламентного задания.
	Организации = Неопределено;
	Если НЕ ПараметрыЗадания = Неопределено 
		И ПараметрыЗадания.Свойство("питОрганизации") 
		И ТипЗнч(ПараметрыЗадания.питОрганизации) = Тип("ТаблицаЗначений") Тогда
		Организации = ПараметрыЗадания.питОрганизации.ВыгрузитьКолонку("Организация");
		Если НЕ Организации.Количество() Тогда
			Организации = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	// Останавливать обработку очереди при возникновении ошибок.
	ОстанавливатьОбработкуОчередиПриВозникновенииОшибок = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питОстанавливатьОбработкуОчередиПриВозникновенииОшибок");
	
	// Текст ошибки.
	ТекстОшибки = "";
	
	// Получение текущего обрабатываемого документа из регистра обработки очереди.
	ТекСтруктураТекущийОбрабатываемыйДокумент = ПолучитьТекущийОбрабатываемыйДокумент(Неопределено, Организации);
	ТекДокумент			= ТекСтруктураТекущийОбрабатываемыйДокумент.ДокументОбщепит;
	ТекМоментВремени	= ТекСтруктураТекущийОбрабатываемыйДокумент.МоментВремени;
	Если ТекДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//+питОценкаПроизводительности
	//ДатаНачалаЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени();
	//-питОценкаПроизводительности
	
	// Получение текущих обрабатываемых действий по документу общепита.
	ТекДействия = ПолучитьТекущиеОбрабатываемыеДействия(ТекДокумент, Организации);
	Пока ТекДокумент <> Неопределено Цикл
		Если ТекДействия = Неопределено Тогда
			
			//+питОценкаПроизводительности
			//ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени("питОтложенноеПроведениеВыпускаБлюд", ДатаНачалаЗамера, "Общепит отложенное проведение выпуска блюд");
			//-питОценкаПроизводительност
			
			// Если обрабатываемые действия закончились, то переходим к следующему документу общепита и получаем его действия.
			ТекСтруктураТекущийОбрабатываемыйДокумент = ПолучитьТекущийОбрабатываемыйДокумент(ТекМоментВремени, Организации);
			ТекДокумент			= ТекСтруктураТекущийОбрабатываемыйДокумент.ДокументОбщепит;
			ТекМоментВремени	= ТекСтруктураТекущийОбрабатываемыйДокумент.МоментВремени;
			Если НЕ ТекДокумент = Неопределено Тогда
				ТекДействия = ПолучитьТекущиеОбрабатываемыеДействия(ТекДокумент, Организации);
				
				//+питОценкаПроизводительности
				//ДатаНачалаЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени();
				//-питОценкаПроизводительности
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ТекДействия = Неопределено Тогда
			// Обработка выбранных действий отложенного проведения.
			ВсеОк = ОбработатьДействияОтложенногоПроведения(ТекДействия, ТекстОшибки);
			Если НЕ ВсеОк Тогда
				
				// Ошибка, запишем это в журнал регистрации.
				ИмяСобытияЖурнала = НСтр("ru = 'Обработка очереди отложенного проведения документов общепита'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
				Если ОстанавливатьОбработкуОчередиПриВозникновенииОшибок Тогда
					ВызватьИсключение ТекстОшибки;
				Иначе
					// Завершаем обработку действий по текущему документу и переходим к следующему.
					ТекДействия = Неопределено;
					ТекстОшибки = "";
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТекДокумент = Неопределено Тогда
			// Получение следующей "порции" обрабатываемых действий по текущему документу.
			ТекДействия = ПолучитьТекущиеОбрабатываемыеДействия(ТекДокумент, Организации);
		КонецЕсли;
	КонецЦикла;
	
	// Снятие привелегированного режима.
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Функция получает текущие обрабатываемые действия по документу общепита.
//
// Параметры:
//  ДокументОбщепит	 - ДокументСсылка.питВыпускБлюд - Документ общепита.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица обрабатываемых действий из регистра.
//
Функция ПолучитьТекущиеОбрабатываемыеДействия(ДокументОбщепит, Организации = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питОчередьОтложенногоПроведения.ДокументОбщепит КАК ДокументОбщепит,
	|	питОчередьОтложенногоПроведения.Действие КАК Действие,
	|	питОчередьОтложенногоПроведения.ТиповойДокумент КАК ТиповойДокумент,
	|	питОчередьОтложенногоПроведения.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ втДействия
	|ИЗ
	|	РегистрСведений.питОчередьОтложенногоПроведения КАК питОчередьОтложенногоПроведения
	|ГДЕ
	|	питОчередьОтложенногоПроведения.ДокументОбщепит = &ДокументОбщепит
	|%ОтборОрганизации%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питТиповыеДокументы.ДокументОбщепит КАК ДокументОбщепит,
	|	питТиповыеДокументы.ТиповойДокумент КАК ТиповойДокумент,
	|	питТиповыеДокументы.ПричинаТиповогоДокумента КАК ПричинаТиповогоДокумента
	|ПОМЕСТИТЬ втТиповыеДокументы
	|ИЗ
	|	РегистрСведений.питТиповыеДокументы КАК питТиповыеДокументы
	|ГДЕ
	|	(питТиповыеДокументы.ДокументОбщепит, питТиповыеДокументы.ТиповойДокумент) В
	|			(ВЫБРАТЬ
	|				втДействия.ДокументОбщепит,
	|				втДействия.ТиповойДокумент
	|			ИЗ
	|				втДействия КАК втДействия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДействия.ДокументОбщепит КАК ДокументОбщепит,
	|	втДействия.Действие КАК Действие,
	|	втДействия.ТиповойДокумент КАК ТиповойДокумент,
	|	втДействия.Приоритет КАК Приоритет,
	|	втТиповыеДокументы.ПричинаТиповогоДокумента КАК ПричинаТиповогоДокумента,
	|	втДействия.ДокументОбщепит.Представление КАК ДокументОбщепитПредставление,
	|	втДействия.ТиповойДокумент.Представление КАК ТиповойДокументПредставление
	|ИЗ
	|	втДействия КАК втДействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТиповыеДокументы КАК втТиповыеДокументы
	|		ПО втДействия.ДокументОбщепит = втТиповыеДокументы.ДокументОбщепит
	|			И втДействия.ТиповойДокумент = втТиповыеДокументы.ТиповойДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	ОтборОрганизации = "";
	Если НЕ Организации = Неопределено Тогда
		ОтборОрганизации = " И питОчередьОтложенногоПроведения.ДокументОбщепит.Организация В (&Организации) ";
		Запрос.УстановитьПараметр("Организации", Организации);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборОрганизации%", ОтборОрганизации);
	
	Запрос.УстановитьПараметр("ДокументОбщепит", ДокументОбщепит);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
КонецФункции

// Функция получает текущий обрабатываемый документ общепита.
// 
// Возвращаемое значение:
//  ДокументСсылка.питВыпускБлюд - Документ общепита.
//
Функция ПолучитьТекущийОбрабатываемыйДокумент(ТекМоментВремени, Организации = Неопределено)
	
	Результат = Новый Структура("ДокументОбщепит,МоментВремени", Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	питОчередьОтложенногоПроведения.ДокументОбщепит КАК ДокументОбщепит,
	|	питОчередьОтложенногоПроведения.ДокументОбщепит.МоментВремени КАК МоментВремени
	|ИЗ
	|	РегистрСведений.питОчередьОтложенногоПроведения КАК питОчередьОтложенногоПроведения
	|%ОтборМоментВремениОрганизация%
	|
	|УПОРЯДОЧИТЬ ПО
	|	питОчередьОтложенногоПроведения.ДокументОбщепит.МоментВремени";
	
	ТекстОтбор = "";
	Если НЕ ТекМоментВремени = Неопределено Тогда
		ТекстОтбор = ТекстОтбор + ?(ПустаяСтрока(ТекстОтбор), " ГДЕ ", " И ") + " питОчередьОтложенногоПроведения.ДокументОбщепит.МоментВремени > &МоментВремени ";
	КонецЕсли;
	Если НЕ Организации = Неопределено Тогда
		ТекстОтбор = ТекстОтбор + ?(ПустаяСтрока(ТекстОтбор), " ГДЕ ", " И ") + " питОчередьОтложенногоПроведения.ДокументОбщепит.Организация В (&Организации) ";
		Запрос.УстановитьПараметр("Организации", Организации);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборМоментВремениОрганизация%", ТекстОтбор);
	
	Запрос.УстановитьПараметр("МоментВремени", ТекМоментВремени);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	Возврат Результат;
	
КонецФункции

// Функция обрабатывает переданные действия отложенного проведения.
//
// Параметры:
//  ОбрабатываемыеДействия	 - ТаблицаЗначений - Таблица дейтсвий, которые необходимо обработать.
//  ТекстОшибки				 - Строка - Текст ошибки, в случае если она произойдет.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
Функция ОбработатьДействияОтложенногоПроведения(ОбрабатываемыеДействия, ТекстОшибки = "")
	
	Для каждого ТекДействие Из ОбрабатываемыеДействия Цикл
		
		// Запись журнала регистрации о начале обработки дейтвия.
		ИмяСобытияЖурнала = НСтр("ru = 'Обработка очереди отложенного проведения документов общепита'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ТекстСообщения = "Документ <" + ТекДействие.ДокументОбщепитПредставление +">, обработка действия <"+ТекДействие.Действие+?(ЗначениеЗаполнено(ТекДействие.ТиповойДокументПредставление), ">, типовой документ <"+ТекДействие.ТиповойДокументПредставление+">", "");
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		
		// Каждое действие обрабатывается в отдельной транзакции.
		НачатьТранзакцию();
		
		// Блокировка записи регистра, которая соответствует обрабатываемому действию.
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.питОчередьОтложенногоПроведения");
		ЭлементБлокировки.УстановитьЗначение("ДокументОбщепит"	, ТекДействие.ДокументОбщепит);
		ЭлементБлокировки.УстановитьЗначение("Действие"			, ТекДействие.Действие);
		ЭлементБлокировки.УстановитьЗначение("ТиповойДокумент"	, ТекДействие.ТиповойДокумент);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Попытка
			Блокировка.Заблокировать();
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Ошибка блокировки записи регистра действий отложенного проведения
			| по документу Общепит """+ТекДействие.ДокументОбщепитПредставление+"""
			|по причине: <"+ОписаниеОшибки()+">";
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецПопытки;
		
		// Запись, проведение, отмена проведения.
		ЭтоДействиеЗаписиТиповогоДокумента	= ЭтоДействиеЗаписиТиповогоДокумента(ТекДействие.Действие);
		ЭтоДействиеЗаписиДокументаОбщепит	= ЭтоДействиеЗаписиДокументаОбщепит(ТекДействие.Действие);
		
		// Для каждого дейстивия выполняется свой алгоритм.
		Если ЭтоДействиеЗаписиДокументаОбщепит 
			ИЛИ ТекДействие.Действие = Перечисления.питДействияОтложенногоПроведения.ПометитьНаУдалениеДокументОбщепит 
			ИЛИ ТекДействие.Действие = Перечисления.питДействияОтложенногоПроведения.СнятьПометкуУдаленияДокументОбщепит Тогда
			
			// Запись документа общепита(производственные таблицы будут заполнены для режима "по норме").
			
			Попытка
				
				ТекДокументОбъект = ТекДействие.ДокументОбщепит.ПолучитьОбъект();
				
				Если НЕ ЭтоДействиеЗаписиДокументаОбщепит Тогда
					ТекРежимЗаписи = РежимЗаписиДокумента.Запись;
				Иначе
					ТекРежимЗаписи = ПолучитьРежимЗаписиДокументаОбщепитПоТекущемуДействию(ТекДействие.Действие);
				КонецЕсли;
				
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питВыполнениеДействияОтложенногоПроведения",Истина);
				ТекДокументОбъект.Записать(ТекРежимЗаписи);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка записи документа общепит """ +ТекДействие.ДокументОбщепитПредставление+"""
				|по причине: <"+ОписаниеОшибки()+">";
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецПопытки;
			
		ИначеЕсли ТекДействие.Действие = Перечисления.питДействияОтложенногоПроведения.СформироватьТиповыеДокументы Тогда
			
			// Формирование типовых документов.
			ТекстОшибки = "";
			СтруктураПараметров = Новый Структура;
			// Проверка режима производства.
			ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
			РежимПроизводстваРазрешен = питОбщегоНазначения.ПроверитьРежимПроизводстваERP(ФормироватьДокументыПроизводства22, ТекстОшибки);
			Если НЕ РежимПроизводстваРазрешен Тогда
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли;
			// Структура параметров.
			СтруктураПараметров.Вставить("ДатаСмещение", 0);
			СтруктураПараметров.Вставить("РежимПроизводстваРазрешен", РежимПроизводстваРазрешен);
			СтруктураПараметров.Вставить("ФормироватьДокументыПроизводства22", ФормироватьДокументыПроизводства22);
			
			ДокументОбщепитПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДействие.ДокументОбщепит, "Проведен");
			Если НЕ ДокументОбщепитПроведен Тогда
				// Получение типовых документов с фильтром по типу.
				ЕстьПроведенныеТиповыеДокументы = Ложь;
				ТекТиповыеДокументы = Неопределено;
				ПараметрыПолучения = Новый Структура("УпорядочитьПоДатеИНомеру, УпорядочитьПоМоментуВремени, ФильтрПоТипу", Ложь, Ложь, "Документ.ПроизводствоБезЗаказа");
				НайтиТиповойДокументДляДокументапит(ТекДействие.ДокументОбщепит, ТекТиповыеДокументы, ТекстСообщения, ПараметрыПолучения);
				Если НЕ ТекТиповыеДокументы = Неопределено Тогда
					Если НЕ ТипЗнч(ТекТиповыеДокументы) = Тип("Массив") Тогда
						МассивТиповых = Новый Массив(1);
						МассивТиповых[0] = ТекТиповыеДокументы;
					Иначе
						МассивТиповых = ТекТиповыеДокументы;
					КонецЕсли;
					СоответствиеТиповых = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивТиповых, "Проведен");
					Для каждого ТекСоответствиеТипового Из СоответствиеТиповых Цикл
						Если ТекСоответствиеТипового.Значение Тогда
							ЕстьПроведенныеТиповыеДокументы = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				ТекРежимЗаписи = ?(ЕстьПроведенныеТиповыеДокументы, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись);
			Иначе
				ТекРежимЗаписи = РежимЗаписиДокумента.Проведение;
			КонецЕсли;
			СтруктураПараметров.Вставить("РежимЗаписи", ТекРежимЗаписи);
			
			// Синхронизация рецептуры и спецификации.
			Отказ = НЕ питТиповыеДокументы.СформироватьТиповыеДокументы(ТекДействие.ДокументОбщепит,СтруктураПараметров,,ТекстОшибки);
			Если Отказ Тогда
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли;
			
		ИначеЕсли ЭтоДействиеЗаписиТиповогоДокумента Тогда
			
			// Запись типовых документов.
			
			Попытка
				
				ТекДокументОбъект = ТекДействие.ТиповойДокумент.ПолучитьОбъект();
				
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(Ложь);
				
				//+Серии
				Если НЕ ТекДействие = Перечисления.питДействияОтложенногоПроведения.ОтменитьПроведениеТиповогоДокумента Тогда
					ЗаполнитьСерииТиповогоДокумента(ТекДокументОбъект, ТекДействие.ДокументОбщепит, ТекДействие.ПричинаТиповогоДокумента);
				КонецЕсли;
				//-Серии
				
				ТекРежимЗаписи = ПолучитьРежимЗаписиТиповогоДокументаПоТекущемуДействию(ТекДействие.Действие);
				
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.Записать(ТекРежимЗаписи);
			Исключение
				ОтменитьТранзакцию();
				ТекстОшибки = ТекстОшибки + "
				|Ошибка записи документа """ + ТекДействие.ТиповойДокументПредставление + """
				| по документу Общепит """+ТекДействие.ДокументОбщепитПредставление+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			
			ВсеОк = УстановитьСинхронизациюТиповыхДокументов(ТекДействие.ДокументОбщепит, ТекДействие.ТиповойДокумент, Истина, ТекстОшибки);
			Если НЕ ВсеОк Тогда
				ОтменитьТранзакцию();
				Возврат ВсеОк;
			КонецЕсли;
			
		ИначеЕсли ТекДействие.Действие = Перечисления.питДействияОтложенногоПроведения.ПометитьНаУдалениеТиповойДокумент 
			ИЛИ ТекДействие.Действие = Перечисления.питДействияОтложенногоПроведения.СнятьПометкуУдаленияТиповойДокумент Тогда
			
			// Пометка удаления типовых документов.
			ТекПометкаУдаления = ТекДействие.Действие = Перечисления.питДействияОтложенногоПроведения.ПометитьНаУдалениеТиповойДокумент;
			
			ТекДокументОбъект = ТекДействие.ТиповойДокумент.ПолучитьОбъект();
			
			Попытка
				ТекДокументОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ТекДокументОбъект.УстановитьПометкуУдаления(ТекПометкаУдаления);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления типового документа""" + ТекДокументОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ТекДействие.ДокументОбщепитПредставление+"""
				|по причине: <"+ОписаниеОшибки()+">";
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецПопытки;
			
			ВсеОк = УстановитьСинхронизациюТиповыхДокументов(ТекДействие.ДокументОбщепит, ТекДействие.ТиповойДокумент, Истина, ТекстОшибки);
			Если НЕ ВсеОк Тогда
				ОтменитьТранзакцию();
				Возврат ВсеОк;
			КонецЕсли;
			
		ИначеЕсли ТекДействие.Действие = Перечисления.питДействияОтложенногоПроведения.ОтвязатьТиповойДокумент Тогда
			
			// Удаление связи типовых документов.
			
			ВсеОк = УдалитьСвязьТиповогоДокументаСДокументомПит(ТекДействие.ТиповойДокумент, ТекДействие.ДокументОбщепит, ТекстОшибки);
			Если НЕ ВсеОк Тогда
				ОтменитьТранзакцию();
				Возврат ВсеОк;
			КонецЕсли;
			
		ИначеЕсли ТекДействие.Действие = Перечисления.питДействияОтложенногоПроведения.УстановитьСинхронизациюТиповогоДокумента Тогда
			
			// Установка синхронизации типовых документов.
			
			ВсеОк = УстановитьСинхронизациюТиповыхДокументов(ТекДействие.ДокументОбщепит, ТекДействие.ТиповойДокумент, Истина, ТекстОшибки);
			Если НЕ ВсеОк Тогда
				ОтменитьТранзакцию();
				Возврат ВсеОк;
			КонецЕсли;
			
		КонецЕсли;
		
		// Дейтвие выполнено, происходит его удаление из регистра.
		ВсеОк = УдалитьДействиеОтложенногоПроведения(ТекДействие.ДокументОбщепит, ТекДействие.Действие, ТекДействие.ТиповойДокумент, ТекстОшибки);
		Если НЕ ВсеОк Тогда
			ОтменитьТранзакцию();
			Возврат ВсеОк;
		КонецЕсли;
		
		// Фиксация транзакции.
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Функция определяет дейтсвие записи, проведения или отмены проведения.
//
// Параметры:
//  ТекущееДействие	 - Перечисления.питДействияОтложенногоПроведения - Текущее действие.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
Функция ЭтоДействиеЗаписиТиповогоДокумента(ТекущееДействие)
	
	Если ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ЗаписатьТиповойДокумент
		ИЛИ ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ПровестиТиповойДокумент
		ИЛИ ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ОтменитьПроведениеТиповогоДокумента Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция определяет дейтсвие записи, проведения или отмены проведения.
//
// Параметры:
//  ТекущееДействие	 - Перечисления.питДействияОтложенногоПроведения - Текущее действие.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
Функция ЭтоДействиеЗаписиДокументаОбщепит(ТекущееДействие)
	
	Если ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ЗаписатьДокументОбщепит
		ИЛИ ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ПровестиДокументОбщепит
		ИЛИ ТекущееДействие = Перечисления.питДействияОтложенногоПроведения.ОтменитьПроведениеДокументаОбщепит Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
//-ОтложенноеПроведение

//<<Загребалов И., Апрель-Софт, 02.12.2021.SD64997, Удаление документа выпуск
Функция ПометитьНаУдалениеТиповыеДокументы(ДокументПит, ТиповыеДокументы, СтруктураПараметров, ТекстОшибки)
	
	Для каждого ТиповойДокумент Из ТиповыеДокументы Цикл
		
		// << MRS #HELP1C-11922 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 27.02.25, ()
		Если НЕ ТиповойДокумент = Неопределено Тогда
			// >> MRS #HELP1C-11922 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 27.02.25, ()
			Попытка
				ДокОбъект = ТиповойДокумент.ПолучитьОбъект();
				ДокОбъект.ДополнительныеСвойства.Вставить("питРазрешитьЗаписьТиповогоДокумента",Истина);
				ДокОбъект.УстановитьПометкуУдаления(Истина);
			Исключение
				ТекстОшибки = ТекстОшибки + "
				|Ошибка при установке пометки удаления """ + ДокОбъект.Метаданные().Представление() + """
				| по документу Общепит """+ДокументПит+"""
				|по причине: <"+ОписаниеОшибки()+">";
				Возврат Ложь;
			КонецПопытки;
			// << MRS #HELP1C-11922 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 27.02.25, ()
		КонецЕсли;
		// >> MRS #HELP1C-11922 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 27.02.25, ()
				
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
//-ОтложенноеПроведение

#КонецОбласти

