#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// --- 26.07.2024 Адель перенесено в начало модуля
//////////////////////////////////////////////////////////////////////////////////
//// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Перечень табличных частей, данные которых не используются 
// в контексте документа, скрыты от пользователя
Функция НеИспользуемыеТабличныеЧасти(ВидОперации) Экспорт
	
	ТабличныеЧасти = Новый Массив;
	
	ТабличныеЧасти.Добавить("Услуги");
	ТабличныеЧасти.Добавить("АгентскиеУслуги");
	ТабличныеЧасти.Добавить("ЗачетАвансов");
	ТабличныеЧасти.Добавить("ВозвратнаяТара");
	
	// Оплаты не доступны вне розничной реализаци
	Если НЕ ВидОперации = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРозничнойРеализацией Тогда
		ТабличныеЧасти.Добавить("Оплата");
	КонецЕсли;
	
	Возврат ТабличныеЧасти;
	
КонецФункции

Функция ПроверитьТоварыНаДубли(ДокументОбъект) Экспорт
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДанныеФормыСтруктура") Тогда
		Документ = ДанныеФормыВЗначение(ДокументОбъект, Тип("ДокументОбъект.питВыпускБлюд")); // Преобразования данных формы в объект
		УстановитьСоответствиеОбъектаИРеквизитаФормы(Документ, "Объект"); // Установка соответствия
	Иначе
		Документ = ДокументОбъект;
	КонецЕсли;
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюдТовары.НомерСтроки,
	|	питВыпускБлюдТовары.Номенклатура,
	|	питВыпускБлюдТовары.Характеристика,
	|	питВыпускБлюдТовары.Серия
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&втТовары КАК питВыпускБлюдТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питВыпускБлюдТовары.Номенклатура,
	|	питВыпускБлюдТовары.Характеристика,
	|	МИНИМУМ(питВыпускБлюдТовары.НомерСтроки) КАК НомерСтроки,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ втРезультат
	|ИЗ
	|	втТовары КАК питВыпускБлюдТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	питВыпускБлюдТовары.Номенклатура,
	|	питВыпускБлюдТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультат.Номенклатура,
	|	втРезультат.Характеристика,
	|	втРезультат.НомерСтроки,
	|	втРезультат.Количество
	|ИЗ
	|	втРезультат КАК втРезультат
	|ГДЕ
	|	втРезультат.Количество > 1";
	
	Запрос.УстановитьПараметр("втТовары", ДокументОбъект.Товары.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Результат = Ложь;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дубли в строке <"+ВыборкаДетальныеЗаписи.НомерСтроки+"> по реквизитам Номенклатура, Характеристика!";
			Сообщение.УстановитьДанные(Документ);
			Сообщение.Поле = "Товары[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Номенклатура";
			Сообщение.Сообщить();
			Возврат Результат;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция проверяет таблицу модификаторов объекта на предмет возможности добавления в производство.
//
// Параметры:
//  Модификаторы - ТабличнаяЧасть, ТаблицаЗначений - Таблица модификаторов.
//
Процедура ПроверитьМодификаторы(Модификаторы) Экспорт
	
	НеЗаполненоНоменклатурМодификаторов = 0;
	Для каждого ТекСрокаМодификатор Из Модификаторы Цикл
		Если НЕ ЗначениеЗаполнено(ТекСрокаМодификатор.Номенклатура) Тогда
			ЗаписьЖурналаРегистрации("питВыпускБлюд", УровеньЖурналаРегистрации.Предупреждение,,
				,"Не заполнена номенклатура модификатора <"+ТекСрокаМодификатор.Модификатор+"> ! Модификатор не будет добавлен в производство!");
			НеЗаполненоНоменклатурМодификаторов = НеЗаполненоНоменклатурМодификаторов + 1;
		КонецЕсли;
	КонецЦикла;
	Если НеЗаполненоНоменклатурМодификаторов Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена номенклатура у " + НеЗаполненоНоменклатурМодификаторов + " модификаторов. Такие модификаторы не будут добавлены в производство. Подробности в журнале регистрации.");
	КонецЕсли;
	
КонецПроцедуры

// Функция сворачивает таблицу модификаторов объекта так, чтобы одинаковые модификаторы сернулись в одну строку.
//
// Параметры:
//  Модификаторы - ТабличнаяЧасть, ТаблицаЗначений - Таблица модификаторов.
//
Процедура СвернутьМодификаторы(Модификаторы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Модфикаторы.Модификатор КАК Модификатор,
	|	Модфикаторы.Количество КАК Количество,
	|	Модфикаторы.Номенклатура КАК Номенклатура,
	|	Модфикаторы.Характеристика КАК Характеристика,
	|	Модфикаторы.Серия КАК Серия,
	|	Модфикаторы.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	Модфикаторы.Цена КАК Цена,
	|	Модфикаторы.Сумма КАК Сумма,
	|	Модфикаторы.СуммаСкидки КАК СуммаСкидки,
	|	Модфикаторы.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
	|	Модфикаторы.КоличествоНоменклатуры КАК КоличествоНоменклатуры,
	|	Модфикаторы.КоличествоУпаковокНоменклатуры КАК КоличествоУпаковокНоменклатуры,
	|	Модфикаторы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Модфикаторы.Рецептура КАК Рецептура
	|ПОМЕСТИТЬ втМодфикаторы
	|ИЗ
	|	&Модфикаторы КАК Модфикаторы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втМодфикаторы.Модификатор КАК Модификатор,
	|	СУММА(втМодфикаторы.Количество) КАК Количество,
	|	втМодфикаторы.Номенклатура КАК Номенклатура,
	|	втМодфикаторы.Характеристика КАК Характеристика,
	|	втМодфикаторы.Серия КАК Серия,
	|	втМодфикаторы.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	0 КАК Цена,
	|	СУММА(втМодфикаторы.Сумма) КАК Сумма,
	|	СУММА(втМодфикаторы.СуммаСкидки) КАК СуммаСкидки,
	|	втМодфикаторы.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
	|	СУММА(втМодфикаторы.КоличествоНоменклатуры) КАК КоличествоНоменклатуры,
	|	СУММА(втМодфикаторы.КоличествоУпаковокНоменклатуры) КАК КоличествоУпаковокНоменклатуры,
	|	втМодфикаторы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втМодфикаторы.Рецептура КАК Рецептура
	|ИЗ
	|	втМодфикаторы КАК втМодфикаторы
	|
	|СГРУППИРОВАТЬ ПО
	|	втМодфикаторы.Серия,
	|	втМодфикаторы.Характеристика,
	|	втМодфикаторы.ИдентификаторСтроки,
	|	втМодфикаторы.СтатусУказанияСерий,
	|	втМодфикаторы.Рецептура,
	|	втМодфикаторы.Номенклатура,
	|	втМодфикаторы.УпаковкаНоменклатуры,
	|	втМодфикаторы.Модификатор"; 
	Запрос.УстановитьПараметр("Модфикаторы", Модификаторы);
	Выборка = Запрос.Выполнить().Выбрать();
	Модификаторы.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Модификаторы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если НоваяСтрока.Количество <> 0 Тогда
			НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
		Иначе
			НоваяСтрока.Цена = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция проверяет, содержит ли документ серийную номенклатуру для списания.
//
// Параметры:
//  ДокументВыпуска	 - ДокументСсылка.питВыпускБлюд - Документ для проверки.
// 
// Возвращаемое значение:
//  Булево - Результат проверки.
//
Функция СодержитСерийнуюНоменклатуруДляСписания(ДокументВыпуска) Экспорт
	
	Если НЕ ТипЗнч(ДокументВыпуска) = Тип("ДокументСсылка.питВыпускБлюд") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюдИнгредиенты.СтатусУказанияСерий КАК СтатусУказанияСерий
	|ИЗ
	|	Документ.питВыпускБлюд.Ингредиенты КАК питВыпускБлюдИнгредиенты
	|ГДЕ
	|	питВыпускБлюдИнгредиенты.СтатусУказанияСерий <> 0
	|	И питВыпускБлюдИнгредиенты.Ссылка = &ДокументВыпуска";
	Запрос.УстановитьПараметр("ДокументВыпуска", ДокументВыпуска);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Возвращает параметры выбора статей и аналитик.
// 
// Возвращаемое значение:
//  см. ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики
//
Функция ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация) Экспорт
	
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект";
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	ПараметрыВыбора.ТипСтатьи = "ТипСтатьи";
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	
	ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивов";
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("питСтатьяРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("АналитикаАктивовПассивов");
	
	Возврат ПараметрыВыбора;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//// ПОДГОТОВКА ПАРАМЕТРОВ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует печатную форму "ОП-1"
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОП1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ПоГосту = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыПечати.Свойство("СтруктураПараметровОП1") Тогда
		СтруктураПараметров = ПараметрыПечати.СтруктураПараметровОП1;
	Иначе
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("РецептурнаяЕдиница", Истина);
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Рецептура_ОП1";
	
	ПервыйДокумент = Истина;
	
	МассивРецептуры = Новый Массив; // для исключения дублирования блюд
	
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		МассивРецептуры = Новый Массив; // для исключения дублирования блюд
		ТекущаяСтрокаДляПечати = Неопределено;
		
		Для Каждого СтрокаТовары Из ДокументСсылка.Товары Цикл
			
			ЭтоБизнесЛанч = СтрокаТовары.Номенклатура.питВидНоменклатуры=Перечисления.питВидыНоменклатуры.БизнесЛанч;
			
			Если СтрокаТовары.Рецептура.Пустая() 
				И НЕ ЭтоБизнесЛанч Тогда
				Продолжить;
			КонецЕсли;
			Если МассивРецептуры.Найти(СтрокаТовары.Рецептура)<>Неопределено Тогда
				// эту рецептуру уже распечатали
				Продолжить;
			Иначе
				МассивРецептуры.Добавить(СтрокаТовары.Рецептура);
			КонецЕсли;
			Если СтрокаТовары.Номенклатура.питВидНоменклатуры=Перечисления.питВидыНоменклатуры.Блюдо 
				ИЛИ ЭтоБизнесЛанч Тогда
				// Выведем калькуляцию
				питОтчеты.ВывестиКалькуляцию(ТабличныйДокумент,СтрокаТовары.Рецептура,ДокументСсылка,СтрокаТовары,СтруктураПараметров);
				Если СтрокаТовары.НомерСтроки < ДокументСсылка.Товары.Количество()-1 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьОП1()

// Формирует печатную форму "ОП-1" по переданной строке
//
// Параметры:
//  СтрокаДокумента - возможность формирования ОП1 для строки Выпуска продукции
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОП1_ТБ(МассивОбъектов, ОбъектыПечати, ПараметрыПечати=Неопределено, ВводПараметров=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВводПараметров=Истина И ПараметрыПечати.Свойство("СтруктураПараметровОП1") Тогда
		СтруктураПараметров = ПараметрыПечати.СтруктураПараметровОП1;
	Иначе
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("РецептурнаяЕдиница", Истина);
	КонецЕсли;
	
	СтрокаДокумента = ПараметрыПечати.ТекущаяСтрокаДляПечати;
	ЭтотОбъект = МассивОбъектов[0];
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Рецептура_ОП1";
	
	Если СтрокаДокумента.Номенклатура.питВидНоменклатуры=Перечисления.питВидыНоменклатуры.Блюдо 
		ИЛИ СтрокаДокумента.Номенклатура.питВидНоменклатуры=Перечисления.питВидыНоменклатуры.БизнесЛанч Тогда
		// Выведем калькуляцию
		питОтчеты.ВывестиКалькуляцию(ТабличныйДокумент,СтрокаДокумента.Рецептура,ЭтотОбъект,СтрокаДокумента,СтруктураПараметров);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьОП1_ТБ()

// Формирует табличный документ технико-технологическая карта по норме или по факту
// 
// Возвращаемое значение:
//  Табличный документ - Технико-технологическая карта
//
Функция ПечатьТехТехнолКарта(МассивОбъектов, ОбъектыПечати,ПараметрыПечати)
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыпускПродукции_ТехТехнолКарта";
	
	
	ПервыйДокумент = Истина;
	
	МассивРецептуры = Новый Массив; // для исключения дублирования блюд
	
	ПоГост = Ложь;
	ПараметрыПечати.Свойство("ПоГОСТ", ПоГост);
	
	ПоФакту = Ложь;
	ПараметрыПечати.Свойство("ПоФакту", ПоФакту);
	
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Для Каждого СтрокаТовары Из ДокументСсылка.Товары Цикл
			Если СтрокаТовары.Рецептура.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаТовары.Номенклатура.питВидНоменклатуры=Перечисления.питВидыНоменклатуры.Блюдо 
				ИЛИ СтрокаТовары.Номенклатура.питВидНоменклатуры=Перечисления.питВидыНоменклатуры.БизнесЛанч Тогда
				// Выведем технико-технологическую карту. 
				
				//+АвтовыборНоменклатуры
				УточненияАвтовыбора = Неопределено;
				Если ТипЗнч(ДокументСсылка)=Тип("ДокументОбъект.питВыпускБлюд") Тогда
					УточненияАвтовыбора = ДокументСсылка.УточненияАвтовыбора.Выгрузить();
				ИначеЕсли ТипЗнч(ДокументСсылка)=Тип("ДокументСсылка.питВыпускБлюд") Тогда
					УточненияАвтовыбора = питУправлениеДаннымиОбИзделиях.ПолучитьТаблицуУточненийАвтовыбораПоДокументу(ДокументСсылка);
				КонецЕсли;
				//-АвтовыборНоменклатуры
				
				питДиетпитание.ВывестиТехникоТехнологическуюКарту(ТабличныйДокумент,СтрокаТовары.Рецептура,ДокументСсылка,СтрокаТовары.Количество,ПоФакту,СтрокаТовары, ПоГост, ДокументСсылка.Подразделение, УточненияАвтовыбора);
				Если СтрокаТовары.НомерСтроки < ДокументСсылка.Товары.Количество()-1 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьТехТехнолКарта

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Если НЕ (питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "ERPWE" 
		ИЛИ питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "УправлениеПредприятиемДляБеларуси") Тогда
		Документы.питВыпускПродукцииЕГАИС.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
	питСозданиеНаОсновании.ДобавитьКомандуСоздатьНаОснованииПеремещенияДвиженияПродукции(КомандыСозданияНаОсновании);
	
	//+Хасп
	Документы.питБракеражПродукции.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	//-Хасп
	
КонецПроцедуры

// Добавляет команду создания документа "Пересчет товаров".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, РежимЗаписи = "Проводить") Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.питВыпускБлюд) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.питВыпускБлюд.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.питВыпускБлюд);
		КомандаСоздатьНаОсновании.РежимЗаписи = РежимЗаписи;
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Добавляет команду создания документа "Пересчет товаров".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииПланаСУчетомПроизведенных(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.питВыпускБлюд) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		//КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.питВыпускБлюд.ПолноеИмя();
		КомандаСоздатьНаОсновании.Обработчик = "питПерепланированиеКлиент.ВыпускБлюдСоздатьНаОснованииПланаСУчетомПроизведенных";
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.питВыпускБлюд) + " (с учетом произведенных)";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ДополнительныеПараметры = Новый Структура("СУчетомПроизведенных", Истина);
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область Печать

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.питВыпускБлюд);
	Если НЕ МожноРедактировать Тогда
		Возврат;
	КонецЕсли;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП1";
	КомандаПечати.Представление = НСтр("ru = 'ОП-1 (все позиции)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП1_ТБ";
	КомандаПечати.Представление = НСтр("ru = 'ОП-1 (Текущее блюдо)'");
	//КомандаПечати.Обработчик    = "";
	КомандаПечати.СписокФорм    = "ФормаДокумента";
	КомандаПечати.Порядок = 8;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП1_СПараметрами";
	КомандаПечати.Представление = НСтр("ru = 'ОП-1 (все позиции с параметрами)'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 12;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП1_ТБ_СПараметрами";
	КомандаПечати.Представление = НСтр("ru = 'ОП-1 (текущее блюдо с параметрами)'");
	КомандаПечати.СписокФорм    = "ФормаДокумента";
	КомандаПечати.Порядок = 13;
	
	Если НЕ питПроизводствоПовтИсп.ПолучитьИмяОсновнойКонфигурации() = "ERPWE" Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "ТОРГ13";
		КомандаПечати.Представление = НСтр("ru = 'Накладная на внутреннее перемещение (ТОРГ-13)'");
		//<<Портал-Юг, Баринов, 2019.08.22 [5.2.8 Возможность печати непроведенных документов]
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		//>> Портал-Юг, Баринов, 2019.08.22		
		КомандаПечати.Порядок = 14;
	КонецЕсли;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехТехнолКартаПоНорме";
	КомандаПечати.Представление = НСтр("ru = 'Технико-технологическая карта по норме'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
//	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоГОСТ", Ложь);
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоФакту", Ложь);
	КомандаПечати.Порядок = 18;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехТехнолКартаГОСТ";
	КомандаПечати.Представление = НСтр("ru = 'Технико-технологическая карта по норме ГОСТ'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоГОСТ", Истина);
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоФакту", Ложь);
	КомандаПечати.Порядок = 19;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехТехнолКартаПоФакту";
	КомандаПечати.Представление = НСтр("ru = 'Технико-технологическая карта по факту'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоГОСТ", Ложь);
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоФакту", Истина);
	КомандаПечати.Порядок = 20;

	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВедомостьНедовложений";
	КомандаПечати.Представление = НСтр("ru = 'Ведомость недовложений'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 30;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПотребностьВИнгредиентахПоБлюдам";
	КомандаПечати.Представление = НСтр("ru = 'Потребность в ингредиентах по блюдам'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 31;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПотребностьВИнгредиентахПоБлюдамСПолуфабрикатами";
	КомандаПечати.Представление = НСтр("ru = 'Потребность в ингредиентах по блюдам с полуфабрикатами'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 32;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП2";
	КомандаПечати.Представление = НСтр("ru = 'ОП-2 (План-меню)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 69;
	
	
	
		// Накладная на отпуск товара (ОП-4)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.питПечатьОтраслевыхФормПита";
	КомандаПечати.Идентификатор = "питПечатьОП3";
	КомандаПечати.Представление = НСтр("ru = 'Требование в кладовую (ОП-3)'");
	КомандаПечати.Порядок = 71;
	
		// Накладная на отпуск товара (ОП-4)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.питПечатьОтраслевыхФормПита";
	КомандаПечати.Идентификатор = "питПечатьОП4";
	КомандаПечати.Представление = НСтр("ru = 'Накладная на отпуск товара (ОП-4)'");
	КомандаПечати.Порядок = 72;
	
	////////////////////////////////////////////////////////////////////////////////////
	// Списание
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "питТОРГ16";
	//КомандаПечати.Представление = НСтр("ru = 'Акт о списании товаров (ТОРГ-16)'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.Порядок = 40;
	
	//**********************************************
	// Реализационные
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП10";
	КомандаПечати.Представление = НСтр("ru = 'ОП-10 (Акт о реализации)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 50;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП12";
	КомандаПечати.Представление = НСтр("ru = 'ОП-12 (Акт о реализации изделий кухни)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 51;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "питОП21";
	КомандаПечати.Представление = НСтр("ru = 'ОП-21 (Акт на отпуск питания сотрудникам организации)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 52;
	
КонецПроцедуры

// Функция формирует табличный документ с печатной формой ОП-2 "План-меню"
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьОП2(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	питВыпускБлюд.Ссылка,
	|	питВыпускБлюд.ХозяйственнаяОперация КАК ВидОперации,
	|	питВыпускБлюд.Номер КАК НомерДокумента,
	|	питВыпускБлюд.Дата КАК ДатаДокумента,
	|	питВыпускБлюд.Организация,
	|	питВыпускБлюд.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	питВыпускБлюд.Подразделение КАК ПодразделениеОрганизации,
	|	питВыпускБлюд.Подразделение.Наименование КАК ПодразделениеПредставление,
	|	питВыпускБлюд.Склад,
	|	питВыпускБлюд.Склад.Представление КАК ПредставлениеСклад,
	|	питВыпускБлюд.Склад.ТипСклада КАК ТипСклада,
	|	NULL КАК РозничныйВидЦены,
	|	питВыпускБлюд.ТипЦен КАК ТипЦен,
	|	Истина КАК ТипЦенЦенаВключаетНДС
	|ИЗ
	|	Документ.питВыпускБлюд КАК питВыпускБлюд
	|ГДЕ
	|	питВыпускБлюд.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	питВыпускБлюд.Дата,
	|	питВыпускБлюд.Ссылка";
	
	ЗапросПоТоварам = Новый Запрос;
	ЗапросПоТоварам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоТоварам.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	ЗапросПоТоварам.Текст =
	"ВЫБРАТЬ
	|	питВыпускБлюд.Номенклатура,
	|	питВыпускБлюд.Характеристика,
	|	питВыпускБлюд.Номенклатура.НаименованиеПолное + ВЫБОР КОГДА питВыпускБлюд.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) ТОГДА """" ИНАЧЕ "" / "" + питВыпускБлюд.Характеристика.НаименованиеПолное КОНЕЦ  КАК ТоварНаименование,
	|	питВыпускБлюд.Рецептура.НомерРецептуры КАК НомерРецептуры,
	|	питВыпускБлюд.Рецептура.Выход КАК ВыходПродукта,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА питВыпускБлюд.Номенклатура.Артикул
	|		ИНАЧЕ питВыпускБлюд.Номенклатура.Код
	|	КОНЕЦ КАК ТоварКод,
	|	питВыпускБлюд.Количество,
	|	ВЫБОР
	|		КОГДА питВыпускБлюд.Ссылка.СуммаВключаетНДС
	|			ТОГДА питВыпускБлюд.Цена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА питВыпускБлюд.Ссылка.СуммаВключаетНДС
	|			ТОГДА питВыпускБлюд.Сумма
	|		ИНАЧЕ питВыпускБлюд.Сумма + питВыпускБлюд.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	питВыпускБлюд.СтавкаНДС,
	|	питВыпускБлюд.НомерСтроки,
	|	питВыпускБлюд.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюд
	|ГДЕ
	|	питВыпускБлюд.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	питВыпускБлюд.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ВыборкаПоТоварам = ЗапросПоТоварам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_питОП2");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ПолеСверху			= 0;
	ТабличныйДокумент.ПолеСлева				= 0;
	ТабличныйДокумент.ПолеСнизу				= 0;
	ТабличныйДокумент.ПолеСправа			= 0;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыпускПродукции_ОП2";
	
	СисИнфо = Новый СистемнаяИнформация;
	Если ПустаяСтрока(СисИнфо.ИнформацияПрограммыПросмотра) Тогда 
		ТабличныйДокумент.ПолеСлева          = 0;
	Иначе
		ТабличныйДокумент.ПолеСлева          = 10;
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		ВыборкаПоТоварам.Сбросить();
		ВыборкаПоТоварам.НайтиСледующий(Шапка.Ссылка, "Ссылка");
		
		ВыборкаСтрокТовары = ВыборкаПоТоварам.Выбрать();
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		ОбластьМакета.Параметры.КодПоОКПО		= СведенияОбОрганизации.КодПоОКПО;
		ОбластьМакета.Параметры.ДатаПланМеню = "на " + Формат(Шапка.ДатаДокумента, "ДФ = ""дд ММММ гггг""");
		
		// Чтение значения для директора
		ПодразделениеОтветственныхЛиц = Шапка.ПодразделениеОрганизации;
		Руководители = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Шапка.Организация, Шапка.ДатаДокумента);
		ОбластьМакета.Параметры.Руководитель = Руководители.РуководительНаименование;
		ОбластьМакета.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
		
		Ном = 0;
		
		// Выводим многострочную часть документа
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ИтогоСумма = 0;
		
		РозничныйТипЦен = Неопределено;
		//РозничныйВидЦены
		//Если Шапка.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		//	мУчетВПродажныхЦенах = УчетнаяПолитика.СпособОценкиТоваровВРознице(Шапка.Организация, Шапка.ДатаДокумента) =
		//		Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости;
		//	Если мУчетВПродажныхЦенах Тогда
		//		РозничныйТипЦен = Шапка.РозничныйВидЦены;
		//	КонецЕсли;
		//КонецЕсли;
		Если НЕ ЗначениеЗаполнено(РозничныйТипЦен) Тогда
			РозничныйТипЦен = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойТипЦенПродажи");
		КонецЕсли;
		
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			Ном = Ном + 1;
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьМакета.Параметры.НомерСтроки = Ном;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		// Вывести подвал
		ОбластьМакетаПодвал.Параметры.Сумма = ИтогоСумма;
		Если Руководители.Свойство("питЗаведующийПроизводством") Тогда
			ОбластьМакетаПодвал.Параметры.ЗаведующийПроизводством = Руководители.питЗаведующийПроизводством;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьОП2()

// Функция формирует табличный документ с печатной формой "ВедомостьНедовложений"
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьВедомостьНедовложений(МассивОбъектов, ОбъектыПечати)
	
	////////////////////////////////////////////////////////////
	// 1. Печать формы в привелегированном режиме.
	УстановитьПривилегированныйРежим(Истина);
	
	////////////////////////////////////////////////////////////
	// 2. Инициализация табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыпускПродукции_ВедомостьНедовложений";
	
	// Макет печатной формы
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_питВедомостьНедовложений");
	
	// Признак того, что документ первый(для последующих документов
	// вставляем горизонтальный разделитель страниц.
	ПервыйДокумент = Истина;
	
	////////////////////////////////////////////////////////////
	// 3. Обход массива документов.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюд.Ссылка КАК Ссылка,
	|	питВыпускБлюд.Склад КАК Склад,
	|	питВыпускБлюд.Номер КАК Номер,
	|	питВыпускБлюд.Дата КАК Дата,
	|	питВыпускБлюд.Организация КАК Организация,
	|	питВыпускБлюд.Склад.Представление КАК СкладПредставление,
	|	питВыпускБлюд.Валюта КАК Валюта
	|ИЗ
	|	Документ.питВыпускБлюд КАК питВыпускБлюд
	|ГДЕ
	|	питВыпускБлюд.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСсылка = РезультатЗапроса.Выбрать();
	Пока ВыборкаСсылка.Следующий() Цикл
		
		////////////////////////////////////////////////////////////
		// Подготовка табличного документа и макета
		// Для не первого документа вставка разделителя страниц.
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Определение таблиц недовложений.
		СкладДляАнализа				= ВыборкаСсылка.Склад;
		СтруктураТаблицПроизводства = питПроизводство.АнализНедовложений(ВыборкаСсылка.Ссылка, СкладДляАнализа, , Истина);
		СтруктураТаблицНедовложений = питПроизводство.АнализТаблицПроизводстваНаНедовложения(ВыборкаСсылка.Ссылка, СтруктураТаблицПроизводства);
		ТаблицаНедовложений			= СтруктураТаблицНедовложений.ТаблицаНедовложений;
		ТаблицаЗаменНедовложений	= СтруктураТаблицНедовложений.ТаблицаЗаменНедовложений;
		СтруктураТаблицПроизводства = Неопределено;
		
		// Вывод шапки печатной формы
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заголовок		= "Ведомость недовложений ингредиентов по складу " + ВыборкаСсылка.СкладПредставление;
		ОбластьМакета.Параметры.НомерДок		= ВыборкаСсылка.Номер;
		ОбластьМакета.Параметры.ДатаДок			= Формат(ВыборкаСсылка.Дата,"ДФ = дд.ММ.гггг");
		ОбластьМакета.Параметры.МестоХранения	= СкладДляАнализа;
		СведенияОбОрганизации					= ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаСсылка.Организация, ВыборкаСсылка.Дата);
		СтрокаПредставления						= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		ОбластьМакета.Параметры.Организация		= СтрокаПредставления;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Область ингредиентов, по которым есть недовложения.
		ОбластьТовар = Макет.ПолучитьОбласть("Товар");
		
		// Печатать артикул или код.
		ПечататьАртикул = (Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить() = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул);
		
		// Получение цен ингредиентов для вывода в печатную форму.
		ОписаниеТиповЧисло		= Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));
		ОписаниеТиповЧисло100	= Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0));
		ТаблицаНедовложений.Колонки.Добавить("Цена", ОписаниеТиповЧисло);
		ТаблицаНедовложений.Колонки.Добавить("Сумма", ОписаниеТиповЧисло);
		ТаблицаНедовложений.Колонки.Добавить("НомерСтроки", ОписаниеТиповЧисло100);
		Для Сч = 0 По ТаблицаНедовложений.Количество() - 1 Цикл
			ТаблицаНедовложений[Сч].НомерСтроки = Сч + 1;
		КонецЦикла;
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковокНоменклатурыНедовложение");
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Дата", ВыборкаСсылка.Дата);
		ПараметрыЗаполнения.Вставить("Валюта", ВыборкаСсылка.Валюта);
		ПараметрыЗаполнения.Вставить("ВидЦены", питОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСсылка.Склад,"УчетныйВидЦены"));
		ПараметрыЗаполнения.Вставить("ИмяКолонкиУпаковка", "УпаковкаНоменклатуры");
		ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
			ТаблицаНедовложений,
			, // Выделенные строки (заполнять во всех строках)
			ПараметрыЗаполнения,
			СтруктураДействий);
		
		// Получение представлений данных для вывода в печатную форму.
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|	ВЫБРАТЬ * ПОМЕСТИТЬ втТаблицаНедовложений ИЗ &ТаблицаНедовложений КАК ТаблицаНедовложений;
		|	ВЫБРАТЬ * ПОМЕСТИТЬ втТаблицаЗаменНедовложений ИЗ &ТаблицаЗаменНедовложений КАК ТаблицаЗаменНедовложений;
		|ВЫБРАТЬ 
		|	*,
		|	ТаблицаНедовложений.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
		|	ТаблицаНедовложений.Номенклатура.Код КАК НоменклатураКод,
		|	ТаблицаНедовложений.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ТаблицаНедовложений.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
		|	ТаблицаНедовложений.Номенклатура.ЕдиницаИзмерения КАК БазоваяЕдиницаНоменклатура,
		|	ТаблицаНедовложений.Номенклатура.ЕдиницаИзмерения.Код КАК КодБазоваяЕдиницаНоменклатура,
		|	ТаблицаНедовложений.УпаковкаНоменклатуры.Код КАК КодУпаковкаНоменклатуры
		|ИЗ
		|	втТаблицаНедовложений КАК ТаблицаНедовложений
		|;
		|ВЫБРАТЬ
		|	*,
		|	ТаблицаЗаменНедовложений.ИнгредиентИсходный.ЕдиницаИзмерения КАК БазоваяЕдиницаИнгредиентИсходный,
		|	ТаблицаЗаменНедовложений.ИнгредиентИсходный.ЕдиницаИзмерения.Код КАК КодБазоваяЕдиницаИнгредиентИсходный,
		|	ТаблицаЗаменНедовложений.ИнгредиентИсходный.НаименованиеПолное КАК ИнгредиентИсходныйПредставление,
		|	ТаблицаЗаменНедовложений.ИнгредиентИсходный.Код КАК ИнгредиентИсходныйКод,
		|	ТаблицаЗаменНедовложений.ИнгредиентИсходный.Артикул КАК ИнгредиентИсходныйАртикул,
		|	ТаблицаЗаменНедовложений.ХарактеристикаИнгредиентаИсходного.НаименованиеПолное КАК ХарактеристикаИнгредиентаИсходногоПредставление,
		|	ТаблицаЗаменНедовложений.ИнгредиентЗамена.ЕдиницаИзмерения КАК БазоваяЕдиницаИнгредиентЗамена,
		|	ТаблицаЗаменНедовложений.ИнгредиентЗамена.ЕдиницаИзмерения.Код КАК КодБазоваяЕдиницаИнгредиентЗамена,
		|	ТаблицаЗаменНедовложений.ИнгредиентЗамена.НаименованиеПолное КАК ИнгредиентЗаменаПредставление,
		|	ТаблицаЗаменНедовложений.ИнгредиентЗамена.Код КАК ИнгредиентЗаменаКод,
		|	ТаблицаЗаменНедовложений.ИнгредиентЗамена.Артикул КАК ИнгредиентЗаменаАртикул,
		|	ТаблицаЗаменНедовложений.ХарактеристикаИнгредиентаЗамена.НаименованиеПолное КАК ХарактеристикаИнгредиентаЗаменаПредставление,
		|	ТаблицаЗаменНедовложений.УпаковкаИнгредиентаИсходный.Код КАК УпаковкаИнгредиентаИсходныйКод,
		|	ТаблицаЗаменНедовложений.УпаковкаИнгредиентаЗамена.Код КАК УпаковкаИнгредиентаЗаменаКод
		|ИЗ
		|	втТаблицаЗаменНедовложений КАК ТаблицаЗаменНедовложений
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаЗаменНедовложений.ИнгредиентИсходный.НаименованиеПолное
		|";
		Запрос.УстановитьПараметр("ТаблицаНедовложений", ТаблицаНедовложений);
		Запрос.УстановитьПараметр("ТаблицаЗаменНедовложений", ТаблицаЗаменНедовложений);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ВыборкаТаблицаНедовложений = РезультатЗапроса[2].Выбрать();
		
		// Обход таблицы недовложений.
		ТекущийНомерТовара = 1;
		Пока ВыборкаТаблицаНедовложений.Следующий() Цикл
			ОбластьТовар.Параметры.Заполнить(ВыборкаТаблицаНедовложений);
			ОбластьТовар.Параметры.Номенклатура = ВыборкаТаблицаНедовложений.НоменклатураПредставление 
				+ ?(ЗначениеЗаполнено(ВыборкаТаблицаНедовложений.Характеристика)
				," / " + СокрЛП(ВыборкаТаблицаНедовложений.ХарактеристикаПредставление),"");
			ОбластьТовар.Параметры.НоменклатураСсылка = ВыборкаТаблицаНедовложений.Номенклатура;
			Если НЕ ЗначениеЗаполнено(ВыборкаТаблицаНедовложений.УпаковкаНоменклатуры) Тогда
				ОбластьТовар.Параметры.УпаковкаНоменклатуры = ВыборкаТаблицаНедовложений.БазоваяЕдиницаНоменклатура;
				ОбластьТовар.Параметры.КодЕдиницыИзмерения = ВыборкаТаблицаНедовложений.КодБазоваяЕдиницаНоменклатура;
			Иначе
				ОбластьТовар.Параметры.КодЕдиницыИзмерения = ВыборкаТаблицаНедовложений.КодУпаковкаНоменклатуры;
			КонецЕсли;
			ОбластьТовар.Параметры.Номер = ТекущийНомерТовара;
			ОбластьТовар.Параметры.КодНоменклатуры = ?(ПечататьАртикул, ВыборкаТаблицаНедовложений.НоменклатураАртикул, ВыборкаТаблицаНедовложений.НоменклатураКод);
			ОбластьТовар.Параметры.ЦенаНоменклатурыНормативная = ВыборкаТаблицаНедовложений.Цена;
			ОбластьТовар.Параметры.СуммаНоменклатуры = ВыборкаТаблицаНедовложений.Сумма;
			ТабличныйДокумент.Вывести(ОбластьТовар);
			ТекущийНомерТовара = ТекущийНомерТовара + 1;
		КонецЦикла;	
		Если ТаблицаНедовложений.Количество()=0 Тогда
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПродуктовХватает"));
		КонецЕсли;
		
		// Блок замен недовложений
		Если ТаблицаЗаменНедовложений.Количество() Тогда
			
			ОбластьИнгредиентИсходный = Макет.ПолучитьОбласть("ИнгредиентИсходный");
			ОбластьЗамены = Макет.ПолучитьОбласть("Замены");
			ОбластьИнгредиентЗамена = Макет.ПолучитьОбласть("ИнгредиентЗамена");
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаЗамен"));
			
			// Запоминаем предыдущие элементы для того, чтобы перейти от одного заменяемого элемента к другому
			// (таблица отсортирована).
			ИнгредиентИсходныйПред = Справочники.Номенклатура.ПустаяСсылка();
			ХарактеристикаИнгредиентаИсходногоПред = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			
			// Обходим таблицу Замен и выводим ее на просмотр
			ВыборкаТаблицаЗаменНедовложений = РезультатЗапроса[3].Выбрать();
			Пока ВыборкаТаблицаЗаменНедовложений.Следующий() Цикл
				
				ИнгредиентИсходный					= ВыборкаТаблицаЗаменНедовложений.ИнгредиентИсходный;
				ХарактеристикаИнгредиентаИсходного	= ВыборкаТаблицаЗаменНедовложений.ХарактеристикаИнгредиентаИсходного;
				ИнгредиентЗамена					= ВыборкаТаблицаЗаменНедовложений.ИнгредиентЗамена;
				ХарактеристикаИнгредиентаЗамена		= ВыборкаТаблицаЗаменНедовложений.ХарактеристикаИнгредиентаЗамена;
				Если НЕ (ИнгредиентИсходныйПред = ИнгредиентИсходный 
					И ХарактеристикаИнгредиентаИсходногоПред = ХарактеристикаИнгредиентаИсходного) Тогда
					
					ОбластьИнгредиентИсходный.Параметры.Заполнить(ВыборкаТаблицаЗаменНедовложений);
					Если НЕ ЗначениеЗаполнено(ВыборкаТаблицаЗаменНедовложений.УпаковкаИнгредиентаИсходный) Тогда
						ОбластьИнгредиентИсходный.Параметры.УпаковкаИнгредиентаИсходный = ВыборкаТаблицаЗаменНедовложений.БазоваяЕдиницаИнгредиентИсходный;
						ОбластьИнгредиентИсходный.Параметры.УпаковкаИнгредиентаИсходныйКод = ВыборкаТаблицаЗаменНедовложений.КодБазоваяЕдиницаИнгредиентИсходный;
					Иначе
						ОбластьИнгредиентИсходный.Параметры.УпаковкаИнгредиентаИсходныйКод = ВыборкаТаблицаЗаменНедовложений.УпаковкаИнгредиентаИсходныйКод;
					КонецЕсли;
					ОбластьИнгредиентИсходный.Параметры.ИнгредиентИсходный = ВыборкаТаблицаЗаменНедовложений.ИнгредиентИсходныйПредставление 
					+ ?(ЗначениеЗаполнено(ВыборкаТаблицаЗаменНедовложений.ХарактеристикаИнгредиентаИсходного)
					," / " + СокрЛП(ВыборкаТаблицаЗаменНедовложений.ХарактеристикаИнгредиентаИсходногоПредставление),"");
					ОбластьИнгредиентИсходный.Параметры.ИнгредиентИсходныйСсылка = ВыборкаТаблицаЗаменНедовложений.ИнгредиентИсходный;
					ОбластьИнгредиентИсходный.Параметры.ИнгредиентИсходныйКод = ?(ПечататьАртикул, ИнгредиентИсходный.Артикул, ИнгредиентИсходный.Код);
					ТабличныйДокумент.Вывести(ОбластьИнгредиентИсходный);
					ТабличныйДокумент.Вывести(ОбластьЗамены);
					
				КонецЕсли;
				
				ОбластьИнгредиентЗамена.Параметры.Заполнить(ВыборкаТаблицаЗаменНедовложений);
				Если НЕ ЗначениеЗаполнено(ВыборкаТаблицаЗаменНедовложений.УпаковкаИнгредиентаЗамена) Тогда
					ОбластьИнгредиентЗамена.Параметры.УпаковкаИнгредиентаЗамена = ВыборкаТаблицаЗаменНедовложений.БазоваяЕдиницаИнгредиентЗамена;
					ОбластьИнгредиентЗамена.Параметры.УпаковкаИнгредиентаЗаменаКод = ВыборкаТаблицаЗаменНедовложений.КодБазоваяЕдиницаИнгредиентЗамена;
				Иначе
					ОбластьИнгредиентЗамена.Параметры.УпаковкаИнгредиентаЗаменаКод = ВыборкаТаблицаЗаменНедовложений.УпаковкаИнгредиентаЗаменаКод;
				КонецЕсли;
				ОбластьИнгредиентЗамена.Параметры.ИнгредиентЗамена = ВыборкаТаблицаЗаменНедовложений.ИнгредиентЗаменаПредставление
				+ ?(ЗначениеЗаполнено(ВыборкаТаблицаЗаменНедовложений.ХарактеристикаИнгредиентаЗамена)
				," / " + СокрЛП(ВыборкаТаблицаЗаменНедовложений.ХарактеристикаИнгредиентаЗаменаПредставление),"");
				ОбластьИнгредиентЗамена.Параметры.ИнгредиентЗаменаСсылка = ВыборкаТаблицаЗаменНедовложений.ИнгредиентЗамена;
				ОбластьИнгредиентЗамена.Параметры.ИнгредиентЗаменаКод = ?(ПечататьАртикул, ИнгредиентЗамена.Артикул, ИнгредиентЗамена.Код);
				
				ТабличныйДокумент.Вывести(ОбластьИнгредиентЗамена);
				
				ИнгредиентИсходныйПред=ИнгредиентИсходный;
			КонецЦикла;
			
		КонецЕсли;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаСсылка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

// Функция формирует табличный документ с печатной формой ОП-10 "Акт о реализации"
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьОП10(МассивОбъектов, ОбъектыПечати,ПараметрыПечати) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	Если МассивОбъектов.Количество() = 0 Тогда
		Возврат ТабДокумент;
	иначе
		// Выпуски печатают все по оодному даже из формы списка.
		ЭтотОбъект = МассивОбъектов[0];
	КонецЕсли;
	
	ИмяРеквизитаКода = "Артикул";
	ФорматВыводаСуммы		= "ЧДЦ=2; ЧН=0,00";
	ФорматВыводаКоличества	= "ЧДЦ=3; ЧН=0,000";
	
	СтруктураПредставления = Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
		
	// Зададим параметры макета
	ТабДокумент.ПолеСверху 				= 0;
	ТабДокумент.ПолеСлева  				= 0;
	ТабДокумент.ПолеСнизу  				= 0;
	ТабДокумент.ПолеСправа 				= 0;
	ТабДокумент.Автомасштаб				= Истина;
	ТабДокумент.ЭкземпляровНаСтранице	= 1;
	ТабДокумент.ОриентацияСтраницы		= ОриентацияСтраницы.Ландшафт;	
	
	Макет							= ПолучитьОбщийМакет("ПФ_MXL_питОП10");
	ОбластьМакета					= Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.Номер	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ЭтотОбъект.Номер);
	
	ОбластьМакета.Параметры.ПредставлениеСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Склад, "Наименование");
	
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	СтрокаПредставления = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	ОбластьМакета.Параметры.ОрганизацияПредставление = СтрокаПредставления;
	
	ОбластьМакета.Параметры.КодПоОКПО = ЭтотОбъект.Организация.КодПоОКПО;
	
	//Чтение значения для директора
	Руководитель = ОтветственныеЛицаСервер.ПолучитьДанныеОтветственногоЛица(ЭтотОбъект.Организация,ЭтотОбъект.Дата,Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	ОбластьМакета.Параметры.Заполнить(Руководитель);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	НомерСтраницы					= 2;
	НомерСтраницыПред				= НомерСтраницы;
	КоличествоСтрокНаТекущейСтранице= 0;	
	
	ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
	ОбластьИтогоПодвал		= Макет.ПолучитьОбласть("ИтогоПодвал");
	
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы	= "Страница: 1";
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	
	СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммаУчетПоСтранице,ИтогСуммаВсегоПоСтранице",0,0,0,0);
		
	ВыборкаСтрок = ПолучитьТаблицуТоваровДляПечатиОП(ЭтотОбъект);
	ПриписатьЕдИзм = ВыводитьЕденицыИзмерения(ЭтотОбъект);
	
	ИтогСуммаУчет	= 0; ИтогСуммаВсего	= 0;
	ИтогКоличество	= 0;
	ВыборкаСтрокКоличество	= ВыборкаСтрок.Количество();
	НомерСтроки				= 1;
	
	Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
		ОбластьСтрока.Параметры.Ном				= НомерСтроки;	
		ОбластьСтрока.Параметры.Номенклатура	= Строка(СтрокаТоваров.Номенклатура.НаименованиеПолное) + ?(ЗначениеЗаполнено(СтрокаТоваров.Характеристика)," / " + СокрЛП(СтрокаТоваров.Характеристика.НаименованиеПолное),"") + ?(ПриписатьЕдИзм , ", "+ Строка(СтрокаТоваров.ЕдиницаИзмерения) ,"" );
		ОбластьСтрока.Параметры.Код				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура, ИмяРеквизитаКода);
		ОбластьСтрока.Параметры.Цена			= Формат(СтрокаТоваров.ЦенаФакт,ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.Количество		= Формат(СтрокаТоваров.Колво,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.СуммаВсего		= Формат(СтрокаТоваров.СуммаФакт,ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.ЦенаУчет		= Формат(?(СтрокаТоваров.Колво=0,0,СтрокаТоваров.СуммаУч/СтрокаТоваров.Колво),ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.СуммаУчет		= Формат(СтрокаТоваров.СуммаУч,ФорматВыводаСуммы);
		
		//доп. области
		мсвДопОбластиПодвала	= Неопределено;
		Если НомерСтроки = ВыборкаСтрокКоличество Тогда
			мсвДопОбластиПодвала	= Новый Массив();
			мсвДопОбластиПодвала.Добавить(ОбластьИтогоПодвал);
		КонецЕсли;		
		
		//выводим строку, делая проверку попадания на лист		
		НомерСтраницы = питДокументы.ВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги, НомерСтраницы, СтруктураИтоговПоСтранице, мсвДопОбластиПодвала);
		
		// увеличим итоги по странице
		СтруктураСтрокиИтогов = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммаУчетПоСтранице,ИтогСуммаВсегоПоСтранице");
		СтруктураСтрокиИтогов.ИтогКоличествоПоСтранице		= СтрокаТоваров.КолВо;
		СтруктураСтрокиИтогов.ИтогСуммаУчетПоСтранице		= СтрокаТоваров.СуммаУч;
		СтруктураСтрокиИтогов.ИтогСуммаВсегоПоСтранице      = СтрокаТоваров.СуммаФакт;
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице		= Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммаУчетПоСтранице,ИтогСуммаВсегоПоСтранице",0,0,0,0);
			НомерСтраницыПред				= НомерСтраницы;
			КоличествоСтрокНаТекущейСтранице= 0; 
		Иначе
			КоличествоСтрокНаТекущейСтранице= КоличествоСтрокНаТекущейСтранице+1;
		КонецЕсли;
		//добавляем итоги
		питДокументы.ДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
		
		ИтогСуммаУчет	= ИтогСуммаУчет  + СтрокаТоваров.СуммаУч;
		ИтогСуммаВсего	= ИтогСуммаВсего + СтрокаТоваров.СуммаФакт;
		ИтогКоличество	= ИтогКоличество + СтрокаТоваров.Колво;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	//довыводим последний подвал, если страниц больше единицы
	Если (НомерСтраницы > 2) Тогда
		питДокументы.ВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;	
	
	ОбластьИтогоПодвал.Параметры.ИтогСуммаВсего	= ИтогСуммаВсего;
	ОбластьИтогоПодвал.Параметры.ИтогКоличество	= ИтогКоличество;
	ОбластьИтогоПодвал.Параметры.ИтогСуммаУчет	= ИтогСуммаУчет;
	
	НомерСтраницы = питДокументы.ВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьИтогоПодвал, , , НомерСтраницы,,);
	
	Руководители = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	Если Руководители.Свойство("питЗаведующийПроизводством") Тогда
		ОбластьПодвал.Параметры.ЗаведующийПроизводствомПредставление = Руководители.питЗаведующийПроизводствомНаименование;
		ОбластьПодвал.Параметры.ЗаведующийПроизводством = Руководители.питЗаведующийПроизводством;
	КонецЕсли;
	Если Руководители.Свойство("Кассир") Тогда
		ОбластьПодвал.Параметры.КассирПредставление = Руководители.КассирНаименование;
	КонецЕсли;
	Если Руководители.Свойство("ГлавныйБухгалтер") Тогда
		ОбластьПодвал.Параметры.ГлавныйБухгалтерПредставление = Руководители.ГлавныйБухгалтерНаименование;
		ОбластьПодвал.Параметры.ГлавныйБухгалтер = Руководители.ГлавныйБухгалтер;
	КонецЕсли;
		
	ФорматСтрока  = "Л=ru_RU; ДП=Ложь";
	ПарамПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж";
	ОбластьПодвал.Параметры.ИтогВсегоПропись	= ЧислоПрописью(ИтогСуммаВсего,ФорматСтрока,ПарамПредмета);
	ОбластьПодвал.Параметры.ИтогВыручкаПропись	= ЧислоПрописью(ИтогСуммаВсего,ФорматСтрока,ПарамПредмета);
	
	НомерСтраницы = питДокументы.ВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , ,НомерСтраницы);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьОП12(МассивОбъектов, ОбъектыПечати,ПараметрыПечати) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	Если МассивОбъектов.Количество() = 0 Тогда
		Возврат ТабДокумент;
	иначе
		// Выпуски печатают все по оодному даже из формы списка.
		ЭтотОбъект = МассивОбъектов[0];
	КонецЕсли;
	
	ИмяРеквизитаКода = "Артикул";
	
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.Автомасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьОбщийМакет("ПФ_MXL_питОП12");
	СтруктураПредставления = Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект.Организация);
	ОбластьМакета.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ЭтотОбъект.Номер);
	
	//СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ЭтотОбъект.Организация,СтруктураПредставления);
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	СтрокаПредставления = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	ОбластьМакета.Параметры.ОрганизацияПредставление = СтрокаПредставления;
	
	ОбластьМакета.Параметры.ПодразделениеКомпанииПредставление	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Подразделение, "Наименование");
	
	//Чтение значения для директора
	//Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель,,УправленческийУчет);
	Руководитель = ОтветственныеЛицаСервер.ПолучитьДанныеОтветственногоЛица(ЭтотОбъект.Организация,ЭтотОбъект.Дата,Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	ОбластьМакета.Параметры.Заполнить(Руководитель);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	НомерСтраницы = 2;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	НомерСтраницыПред = НомерСтраницы;
	
	// Получим область итогов по странице
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице	= Новый Структура("Колво,СуммаФакт,СуммаУч",0,0,0);
	ФорматВыводаСуммы		= "ЧДЦ=2; ЧН=0,00";
	ФорматВыводаКоличества	= "ЧДЦ=3; ЧН=0,000";
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаСтрок = ПолучитьТаблицуТоваровДляПечатиОП(ЭтотОбъект);
	ПриписатьЕдИзм = ВыводитьЕденицыИзмерения(ЭтотОбъект);
	
	
	ИтогСуммаУчет	= 0;
	ИтогКоличество	= 0;
	НомерСтроки		= 1;
	Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
		ОбластьМакета.Параметры.Ном				= НомерСтроки;
		НомерСтроки								= НомерСтроки + 1;
		ОбластьМакета.Параметры.НомКК			= СтрокаТоваров.НомКК;
		ОбластьМакета.Параметры.Наименование	= Строка(СтрокаТоваров.Номенклатура.НаименованиеПолное) + ?(ЗначениеЗаполнено(СтрокаТоваров.Характеристика)," / " + СокрЛП(СтрокаТоваров.Характеристика.НаименованиеПолное),"") + ?(ПриписатьЕдИзм , ", "+ Строка(СтрокаТоваров.ЕдиницаИзмерения) ,"" );
		ОбластьМакета.Параметры.Код				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура, ИмяРеквизитаКода);
		ОбластьМакета.Параметры.Колво			= Формат(СтрокаТоваров.Колво,ФорматВыводаКоличества);
		ОбластьМакета.Параметры.ЦенаФакт		= Формат(СтрокаТоваров.ЦенаФакт,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СуммаФакт		= Формат(СтрокаТоваров.СуммаФакт,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.ЦенаУч			= Формат(?(СтрокаТоваров.Колво=0,0,СтрокаТоваров.СуммаУч/СтрокаТоваров.Колво),ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СуммаУч			= Формат(СтрокаТоваров.СуммаУч,ФорматВыводаСуммы);
		
		ИтогСуммаУчет	= ИтогСуммаУчет + СтрокаТоваров.СуммаУч;
		ИтогКоличество	= ИтогКоличество + СтрокаТоваров.Колво;
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаСтрок.Индекс(СтрокаТоваров) = ВыборкаСтрок.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
				
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = питДокументы.ВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице	= Новый Структура("Колво,СуммаФакт,СуммаУч",0,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		СтруктураИтоговПоСтранице.Колво = СтруктураИтоговПоСтранице.Колво + СтрокаТоваров.Колво;
		СтруктураИтоговПоСтранице.СуммаФакт = СтруктураИтоговПоСтранице.СуммаФакт + СтрокаТоваров.СуммаФакт;
		СтруктураИтоговПоСтранице.СуммаУч = СтруктураИтоговПоСтранице.СуммаУч + СтрокаТоваров.СуммаУч;
	КонецЦикла;
	
	//довыводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		Для Каждого ЭлементИтога Из СтруктураИтоговПоСтранице Цикл
			ОбластьМакетаИтогоПоСтранице.Параметры[ЭлементИтога.Ключ] = Формат(ЭлементИтога.Значение,ФорматВыводаСуммы);
		КонецЦикла;
		НомерСтраницы = питДокументы.ВывестиГоризонтальнуюОбласть(ТабДокумент,ОбластьМакетаИтогоПоСтранице, , ,НомерСтраницы,,);
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ИтогКолво=Формат(ИтогКоличество,ФорматВыводаКоличества);
	ОбластьПодвал.Параметры.ИтогСуммаФакт=Формат(ЭтотОбъект.Товары.Итог("Сумма"),ФорматВыводаСуммы);
	ОбластьПодвал.Параметры.ИтогСуммаУч=Формат(ИтогСуммаУчет,ФорматВыводаСуммы);
	ТабДокумент.Вывести(ОбластьПодвал);
	
	НомерСтраницыПред = НомерСтраницыПред + 1;
	НомерСтраницы = НомерСтраницы + 1;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = ""; 		
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотНаимен");
	ТабДокумент.Вывести(ОбластьМакета);
	
	// выводим оборотную часть
	ОбластьМакета = Макет.ПолучитьОбласть("Оборот");
	ФорматСтрока  = "Л=ru_RU; ДП=Ложь";
	ПарамПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж";
	ОбластьМакета.Параметры.ВыручкаКассы	= ЧислоПрописью(ЭтотОбъект.Товары.Итог("Сумма"),ФорматСтрока,ПарамПредмета);
	
	Руководители = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	Если Руководители.Свойство("питЗаведующийПроизводством") Тогда
		ОбластьМакета.Параметры.ЗаведующийПроизводствомПредставление = Руководители.питЗаведующийПроизводствомНаименование;
		ОбластьМакета.Параметры.ЗаведующийПроизводством = Руководители.питЗаведующийПроизводством;
	КонецЕсли;
	Если Руководители.Свойство("Кассир") Тогда
		ОбластьМакета.Параметры.КассирПредставление = Руководители.КассирНаименование;
	КонецЕсли;
	Если Руководители.Свойство("ГлавныйБухгалтер") Тогда
		ОбластьМакета.Параметры.ГлавныйБухгалтерПредставление = Руководители.ГлавныйБухгалтерНаименование;
		ОбластьМакета.Параметры.ГлавныйБухгалтер = Руководители.ГлавныйБухгалтер;
	КонецЕсли;
	
	//??
	////ЧленКомиссии1 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии1");
	//ЧленКомиссии1 = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(ЭтотОбъект,"ЧленКомиссии1");
	//ОбластьМакета.Параметры.Заполнить(ЧленКомиссии1);
	////ЧленКомиссии2 = дкОтветственноеЛицо(ЭтотОбъект,"ЧленКомиссии2");
	//ЧленКомиссии2 = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(ЭтотОбъект,"ЧленКомиссии2");
	//ОбластьМакета.Параметры.Заполнить(ЧленКомиссии2);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьОП21(МассивОбъектов, ОбъектыПечати,ПараметрыПечати) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	Если МассивОбъектов.Количество() = 0 Тогда
		Возврат ТабДокумент;
	иначе
		// Выпуски печатают все по оодному даже из формы списка.
		ЭтотОбъект = МассивОбъектов[0];
	КонецЕсли;
	
	ИмяРеквизитаКода = "Артикул";
	
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.Автомасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьОбщийМакет("ПФ_MXL_питОП21");
	СтруктураПредставления = Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект.Организация);
	ОбластьМакета.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ЭтотОбъект.Номер);
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	СтрокаПредставления = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	ОбластьМакета.Параметры.ОрганизацияПредставление = СтрокаПредставления;
	
	ОбластьМакета.Параметры.ПодразделениеКомпанииПредставление	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Подразделение, "Наименование");
	
	//Чтение значения для директора
	//Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель,,УправленческийУчет);
	Руководитель = ОтветственныеЛицаСервер.ПолучитьДанныеОтветственногоЛица(ЭтотОбъект.Организация,ЭтотОбъект.Дата,Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	ОбластьМакета.Параметры.Заполнить(Руководитель);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	НомерСтраницы = 2;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	НомерСтраницыПред = НомерСтраницы;
	
	// Получим область итогов по странице
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице	= Новый Структура("Колво,СуммаФакт,СуммаУч",0,0,0);
	ФорматВыводаСуммы		= "ЧДЦ=2; ЧН=0,00";
	ФорматВыводаКоличества	= "ЧДЦ=3; ЧН=0,000";
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	//получим кэш остатков
	СписокНеПриходуемыхБлюд = Новый ТаблицаЗначений;
	СписокНеПриходуемыхБлюд.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СписокНеПриходуемыхБлюд.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СписокНеПриходуемыхБлюд.Колонки.Добавить("Рецептура", Новый ОписаниеТипов("ДокументСсылка.питРецептура"));
	ШапкаДокумента=ПолучитьШапкуДокумента(ЭтотОбъект.Ссылка);
	
	ВыборкаСтрок = ПолучитьТаблицуТоваровДляПечатиОП(ЭтотОбъект);
	ПриписатьЕдИзм = ВыводитьЕденицыИзмерения(ЭтотОбъект);
	
	ИтогСуммаУчет	= 0;
	ИтогКоличество	= 0;
	НомерСтроки		= 1;
	Для Каждого СтрокаТоваров Из ВыборкаСтрок Цикл
		ОбластьМакета.Параметры.Ном				= НомерСтроки;
		НомерСтроки								= НомерСтроки + 1;
		//ОбластьМакета.Параметры.НомКК			= СтрокаТоваров.Рецептура.НомерРецептуры;
		ОбластьМакета.Параметры.Наименование	= Строка(СтрокаТоваров.Номенклатура.НаименованиеПолное) + ?(ЗначениеЗаполнено(СтрокаТоваров.Характеристика)," / " + СокрЛП(СтрокаТоваров.Характеристика.НаименованиеПолное),"") + ?(ПриписатьЕдИзм , ", "+ Строка(СтрокаТоваров.ЕдиницаИзмерения) ,"" );
		ОбластьМакета.Параметры.Код				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура, ИмяРеквизитаКода);
		ОбластьМакета.Параметры.Колво			= Формат(СтрокаТоваров.КолВо,ФорматВыводаКоличества);
		ОбластьМакета.Параметры.ЦенаФакт		= Формат(СтрокаТоваров.ЦенаФакт,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СуммаФакт		= Формат(СтрокаТоваров.СуммаФакт,ФорматВыводаСуммы);
		
		ОбластьМакета.Параметры.ЦенаУч			= Формат(?(СтрокаТоваров.Колво=0,0,СтрокаТоваров.СуммаУч/СтрокаТоваров.Колво),ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СуммаУч			= Формат(СтрокаТоваров.СуммаУч,ФорматВыводаСуммы);;
		СуммаУч = СтрокаТоваров.СуммаУч;
		ИтогСуммаУчет	= ИтогСуммаУчет + СуммаУч;
		ИтогКоличество	= ИтогКоличество + СтрокаТоваров.Колво;
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаСтрок.Индекс(СтрокаТоваров) = ВыборкаСтрок.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
				
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = питДокументы.ВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,НомерСтраницы, СтруктураИтоговПоСтранице, мсвДопОбластиПодвала);
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице	= Новый Структура("Колво,СуммаФакт,СуммаУч",0,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		СтруктураИтоговПоСтранице.Колво = СтруктураИтоговПоСтранице.Колво + СтрокаТоваров.Колво;
		СтруктураИтоговПоСтранице.СуммаФакт = СтруктураИтоговПоСтранице.СуммаФакт + СтрокаТоваров.СуммаФакт;
		СтруктураИтоговПоСтранице.СуммаУч = СтруктураИтоговПоСтранице.СуммаУч + СуммаУч;
	КонецЦикла;
	
	//довыводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		Для Каждого ЭлементИтога Из СтруктураИтоговПоСтранице Цикл
			ОбластьМакетаИтогоПоСтранице.Параметры[ЭлементИтога.Ключ] = Формат(ЭлементИтога.Значение,ФорматВыводаСуммы);
		КонецЦикла;
		НомерСтраницы = питДокументы.ВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакетаИтогоПоСтранице, , , НомерСтраницы,,);
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ИтогКолво=Формат(ИтогКоличество,ФорматВыводаКоличества);
	
	Если ЭтотОбъект.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСоСписанием Тогда
		ОбластьПодвал.Параметры.ИтогСуммаФакт = 0;
	Иначе
		ОбластьПодвал.Параметры.ИтогСуммаФакт = Формат(ЭтотОбъект.Товары.Итог("Сумма"),ФорматВыводаСуммы);
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ИтогСуммаУч=Формат(ИтогСуммаУчет,ФорматВыводаСуммы);
	ТабДокумент.Вывести(ОбластьПодвал);
	
	НомерСтраницыПред = НомерСтраницыПред + 1;
	НомерСтраницы = НомерСтраницы + 1;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = ""; 		
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотНаимен");
	ТабДокумент.Вывести(ОбластьМакета);
	
	// выводим оборотную часть
	ОбластьМакета = Макет.ПолучитьОбласть("Оборот");
	ФорматСтрока  = "Л=ru_RU; ДП=Ложь";
	ПарамПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж";
	
	Руководители = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	Если Руководители.Свойство("питЗаведующийПроизводством") Тогда
		ОбластьМакета.Параметры.ЗаведующийПроизводствомПредставление = Руководители.питЗаведующийПроизводствомНаименование;
		ОбластьМакета.Параметры.ЗаведующийПроизводством = Руководители.питЗаведующийПроизводством;
	КонецЕсли;
	Если Руководители.Свойство("Кассир") Тогда
		ОбластьМакета.Параметры.КассирПредставление = Руководители.КассирНаименование;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;

	
КонецФункции

Функция ПолучитьТаблицуТоваровДляПечатиОП(ЭтотОбъект)
	
	// Получим значение права ОтображатьСебестоимостьСНДС
	//ОтображатьСебестоимостьСНДС = ПравоПользователя("ОтображатьСебестоимостьСНДС",ЭтотОбъект);
	//ОтображатьСебестоимостьСНДС = ЭтотОбъект.СуммаВключаетНДС;
	
	// Проверяем, была ли расчитана себестоимость продукции.
	ПроизведенРасчетСебестоимости = питОтчеты.ПроизведенРасчетСебестоимости(ЭтотОбъект.Ссылка);
	
	ТекстЗапроса = "";
	
	Если ПроизведенРасчетСебестоимости Тогда
		ТекстЗапроса = ТекстЗапроса + питОтчеты.ПолучитьТекстЗапросаСебестоиомстиБлюдИИнгредиентов();
	Иначе
		// Берем по нормативке, которая сейчас пишется в рн "типПроизводство".
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	питПроизводство.Блюдо КАК Номенклатура,
		|	питПроизводство.Характеристика КАК Характеристика,
		|	МАКСИМУМ(питПроизводство.КоличествоБлюда) КАК Количество,
		|	СУММА(питПроизводство.Сумма) КАК Сумма,
		|	СУММА(питПроизводство.Сумма) КАК СуммаБезНДС
		|ПОМЕСТИТЬ резТаблицаСебестоимости
		|ИЗ
		|	РегистрНакопления.питПроизводство КАК питПроизводство
		|ГДЕ
		|	питПроизводство.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	питПроизводство.Блюдо,
		|	питПроизводство.Характеристика
		|;";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	//<< Портал-Юг, Баринов, 2019.08.31 [б/н Исправление]
	"ВЫБРАТЬ
	|	ДокументТовары.Ссылка КАК Ссылка,
	|	ДокументТовары.Рецептура КАК Рецептура,
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.Характеристика КАК Характеристика,
	|	ДокументТовары.Упаковка КАК Упаковка,
	|	СУММА(ДокументТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ДокументТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ДокументТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ПЛ_тчТовары
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.Рецептура,
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.Характеристика,
	|	ДокументТовары.Упаковка" 
	+ ОбщегоНазначения.РазделительПакетаЗапросов() +
	//>> Портал-Юг, Баринов, 2019.08.31
	"ВЫБРАТЬ
	|	ДокументТовары.Рецептура.НомерРецептуры КАК НомКК,
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.Характеристика КАК Характеристика,
	|	ДокументТовары.Упаковка,
	|	ВЫБОР
	|		КОГДА ДокументТовары.КоличествоУпаковок = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ДокументТовары.Сумма + ВЫБОР
	|				КОГДА &ОтображатьСебестоимостьСНДС
	|					ТОГДА ДокументТовары.СуммаНДС
	|				ИНАЧЕ 0
	|			КОНЕЦ) / ДокументТовары.КоличествоУпаковок
	|	КОНЕЦ КАК ЦенаФакт,
	|	ДокументТовары.КоличествоУпаковок КАК Колво,
	|	ДокументТовары.Сумма КАК СуммаФакт,
	|	ВЫБОР
	|		КОГДА ДокументТовары.КоличествоУпаковок = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ОтображатьСебестоимостьСНДС
	|					ТОГДА isnull(резТаблицаСебестоимости.Сумма,0)
	|				ИНАЧЕ isnull(резТаблицаСебестоимости.СуммаБезНДС,0)
	|			КОНЕЦ / ДокументТовары.КоличествоУпаковок
	|	КОНЕЦ КАК ЦенаУч,
	|	ВЫБОР
	|		КОГДА &ОтображатьСебестоимостьСНДС
	|			ТОГДА isnull(резТаблицаСебестоимости.Сумма,0)
	|		ИНАЧЕ isnull(резТаблицаСебестоимости.СуммаБезНДС,0)
	|	КОНЕЦ КАК СуммаУч
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	//<< Портал-Юг, Баринов, 2019.08.31 [б/н Исправление]
	//|	Документ.питВыпускБлюд.Товары КАК ДокументТовары
	|	ПЛ_тчТовары КАК ДокументТовары
	//>> Портал-Юг, Баринов, 2019.08.31
	|		ЛЕВОЕ СОЕДИНЕНИЕ резТаблицаСебестоимости КАК резТаблицаСебестоимости
	|		ПО ДокументТовары.Номенклатура = резТаблицаСебестоимости.Номенклатура
	|		И ДокументТовары.Характеристика = резТаблицаСебестоимости.Характеристика
	|ГДЕ
	|	ДокументТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Упаковка,
	|	втТовары.ЦенаФакт,
	|	втТовары.Колво,
	|	втТовары.СуммаФакт,
	|	втТовары.СуммаУч КАК СуммаУч,
	|	втТовары.ЦенаУч,
	|	втТовары.НомКК
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Упаковка,
	|	втТовары.ЦенаФакт,
	|	втТовары.Колво,
	|	втТовары.СуммаФакт,
	|	втТовары.СуммаУч,
	|	втТовары.ЦенаУч,
	|	втТовары.НомКК
	|ИТОГИ
	|	МИНИМУМ(СуммаУч)
	|ПО
	|	Номенклатура, Характеристика";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ОтображатьСебестоимостьСНДС",Ложь);
	
	ТабРезультат = Новый ТаблицаЗначений;
	ТабРезультат.Колонки.Добавить("НомКК");				// Номер рецептуры
	ТабРезультат.Колонки.Добавить("Номенклатура");
	ТабРезультат.Колонки.Добавить("Характеристика");
	ТабРезультат.Колонки.Добавить("ЕдиницаИзмерения");
	ТабРезультат.Колонки.Добавить("ЦенаФакт");
	ТабРезультат.Колонки.Добавить("Колво");
	ТабРезультат.Колонки.Добавить("СуммаФакт");
	ТабРезультат.Колонки.Добавить("ЦенаУч");			
	ТабРезультат.Колонки.Добавить("СуммаУч");			
	
	ВыборкаНоменклатураСХарактеристиками = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатураСХарактеристиками.Следующий() Цикл
		ВыборкаНоменклатура = ВыборкаНоменклатураСХарактеристиками.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		НоваяСтрока = Неопределено;
		//Эти две суммы могут не совпадать из за округлений. Надо подогнать под НоменклатураСуммаУчИзРегистра
		СуммаУчетная = 0; //Сумма по всей номенклатуре (накапливается в цикле) при расчете Цена*Количество
		НоменклатураСуммаУчИзРегистра = 0; // Сумма по всей номенклатуре из регистров
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			Если НоваяСтрока <> Неопределено И (НоваяСтрока.Номенклатура.ВидНоменклатуры <> Перечисления.питВидыНоменклатуры.БизнесЛанч И НоваяСтрока.Номенклатура.ВидНоменклатуры <> Перечисления.питВидыНоменклатуры.Услуга) Тогда
				Если НоменклатураСуммаУчИзРегистра <> 0 Тогда
					//Корректируем ошибки округления в последней строке
					Отклонение = НоменклатураСуммаУчИзРегистра - СуммаУчетная;
					НоваяСтрока.СуммаУч = НоваяСтрока.СуммаУч + Отклонение;
					СуммаУчетная = 0;
				КонецЕсли;
				
			КонецЕсли;
			СуммаУчетная = 0; 
			ВыборкаСтрока = ВыборкаНоменклатура.Выбрать();
			Пока ВыборкаСтрока.Следующий() Цикл
				НоваяСтрока = ТабРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
				
				Если ЭтотОбъект.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСоСписанием Тогда
					НоваяСтрока.СуммаФакт = 0;
					НоваяСтрока.ЦенаФакт = 0;
				КонецЕсли;
				
				НоваяСтрока.СуммаУч = Окр(НоваяСтрока.ЦенаУч * НоваяСтрока.КолВо, 2);
				СуммаУчетная = СуммаУчетная + НоваяСтрока.СуммаУч;
			КонецЦикла;
			НоменклатураСуммаУчИзРегистра = ВыборкаНоменклатура.СуммаУч;
			
		КонецЦикла;
	КонецЦикла;
	Если НоменклатураСуммаУчИзРегистра <> 0 И (НоваяСтрока.Номенклатура.питВидНоменклатуры <> Перечисления.питВидыНоменклатуры.БизнесЛанч И НоваяСтрока.Номенклатура.питВидНоменклатуры <> Перечисления.питВидыНоменклатуры.Услуга) Тогда
		//Корректируем ошибки округления в последней строке
		Отклонение = НоменклатураСуммаУчИзРегистра - СуммаУчетная;
		НоваяСтрока.СуммаУч = НоваяСтрока.СуммаУч + Отклонение;
		СуммаУчетная = 0;
	КонецЕсли;
	
	Возврат ТабРезультат;
	
КонецФункции

// Проверяет надо ли выводить ед изм в формах оп10 12 21
//выводим только если есть одинаковые товары с разными еденицами. 
//Иначе не выводим. Так же как раньше. Не стоит сильно менять форму. Всетаки регламентированная.
Функция ВыводитьЕденицыИзмерения(ЭтотОбъект)
	
	ТабДляЕдиниц = ЭтотОбъект.Товары.Выгрузить();
	ТабДляЕдиниц.Свернуть("Номенклатура,Упаковка");
	ТабДляЕдиниц.Колонки.Добавить("Сч");
	ТабДляЕдиниц.ЗаполнитьЗначения(1,"Сч");
	ТабДляЕдиниц.Свернуть("Номенклатура", "Сч");
	СтрКУдалению = ТабДляЕдиниц.НайтиСтроки(Новый Структура("Сч",1));
	Для Каждого Стр из СтрКУдалению Цикл
		ТабДляЕдиниц.Удалить(Стр);
	КонецЦикла;
	Возврат (ТабДляЕдиниц.Количество() > 0);
	
КонецФункции

// возвращает выборку по шапке
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.Валюта КАК ВалютаДокумента,
	|	Док.КурсКонвертации КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозяйственнаяОперация КАК ХозОперация,
	//|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.Подразделение КАК ПодразделениеКомпании,
	//|	Док.Проект КАК Проект,
	//|	Док.УправленческийУчет КАК УправленческийУчет,
	/////////// ПРИВАТ ////////////
	|	Док.Склад КАК СкладКомпании,
	|	Док.СкладПолучатель КАК СкладПолучатель,
	|	Док.Контрагент КАК Контрагент,
	//|	Док.СтатьяСписанияТМЦ КАК СтатьяСписанияТМЦ,
	|	Док.ДоговорКонтрагента КАК ДоговорВзаиморасчетов,
	|	Док.ДокументОснование КАК ДокументОснование,
	|	Док.УчитыватьОстаткиБлюдНаСкладе КАК УчитыватьОстаткиБлюдНаСкладе
	|
	|ИЗ
	|	Документ."+ДокументСсылка.Метаданные().Имя+" КАК Док
	|
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции

// Формирует табличный документ по унифицированной форме ТОРГ-13
// 
// Возвращаемое значение
//  Табличный документ - унифицированная форма ТОРГ-13
//
Функция СформироватьПечатнуюФормуТОРГ13(МассивОбъектов, ОбъектыПечати, КомплектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//+25
	//ТоварКод = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ТоварКод = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	//-25
	Если Не ЗначениеЗаполнено(ТоварКод) Тогда
		ТоварКод = "Код";
	КонецЕсли;

	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеТоваров.ПФ_MXL_ТОРГ13_ru");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Зададим параметры макета по-умолчанию
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_ТОРГ13_";

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Перемещение.Ссылка                                          КАК Ссылка,
	|	Перемещение.Номер                                           КАК Номер,
	|	Перемещение.Дата                                            КАК ДатаДокумента,
	|	Перемещение.Организация                                     КАК Организация,
	|	Перемещение.Организация.Префикс                             КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Перемещение.Склад)           КАК ОтправительПодразделение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Перемещение.СкладПолучатель)            КАК ПолучательПодразделение,
	|	Перемещение.Склад.ТекущийОтветственный           КАК КладовщикОтправитель,
	|	Перемещение.Склад.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщикаОтправителя,
	|	Перемещение.СкладПолучатель.ТекущийОтветственный            КАК КладовщикПолучатель,
	|	Перемещение.СкладПолучатель.ТекущаяДолжностьОтветственного  КАК ДолжностьКладовщикаПолучателя,
	|	Неопределено                                        КАК УчетныйВидЦены, ///***---Перемещение.ВидЦены
	|	Неопределено                              КАК УчетныйВидЦеныВалютаЦены   ///***---Перемещение.ВидЦены.ВалютаЦены
	|ИЗ
	|	Документ.питВыпускБлюд КАК Перемещение
	|ГДЕ
	|	Перемещение.Ссылка В(&МассивПеремещений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента, Ссылка
	|");
	Запрос.УстановитьПараметр("МассивПеремещений", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТекстЗапроса1 = "ВЫБРАТЬ
	|	ПеремещениеТоваров.Номенклатура                    КАК Товар,
	|	ПеремещениеТоваров.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ВЫБОР КОГДА &ТоварКод = ""Код"" ТОГДА
	|		ПеремещениеТоваров.Номенклатура.Код
	|	ИНАЧЕ
	|		ПеремещениеТоваров.Номенклатура.Артикул
	|	КОНЕЦ                                                  КАК ТоварКод,
	|
	|	ПеремещениеТоваров.Характеристика КАК Характеристика, ///***---ПеремещениеТоваров.Характеристика.НаименованиеПолное
	|	ВЫБОР КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|		ТОГДА НЕОПРЕДЕЛЕНО 
	|		ИНАЧЕ ПеремещениеТоваров.Упаковка.Наименование
	|	КОНЕЦ                                                  КАК Упаковка,
	|
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения КАК ЕдиницаИзмеренияНаименование,
	|
	|	&ТекстЗапросаКодЕдиницыИзмерения КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|
	|	ПеремещениеТоваров.КоличествоУпаковок КАК Количество,
	|
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|					КОГДА КоэффициентыУпаковок.Количество < КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|						ТОГДА КоэффициентыУпаковок.Количество
	|					ИНАЧЕ КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА 1
	|				ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки1
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоВОдномМесте,
	|
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|			/ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1)
	|			* ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1)
	|		КАК ЧИСЛО(15,2)) * ПеремещениеТоваров.КоличествоУпаковок КАК Сумма,
	|
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|			/ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1)
	|			* ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1)
	|		КАК ЧИСЛО(15,2)) КАК Цена,
	|
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	|			ПеремещениеТоваров.Количество
	|		ИНАЧЕ
	|			ПеремещениеТоваров.КоличествоУпаковок
	|	КОНЕЦ * &ТекстЗапросаВесУпаковки КАК МассаБрутто,
	|
	|	&ТекстЗапросаВесНоменклатуры * ПеремещениеТоваров.Количество КАК МассаНетто
	|
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныНоменклатуры КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПеремещениеТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ПеремещениеТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ПеремещениеТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И ПеремещениеТоваров.КоличествоУпаковок = КоэффициентыУпаковок.КоличествоУпаковок 
	|			И НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ПеремещениеТоваров
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещениеТоваров.НомерСтроки
	|";
	Запрос = Новый Запрос;
	
	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ПеремещениеТоваров.Упаковка",
			"ПеремещениеТоваров.Номенклатура"));
			
	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
				
	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "&ТекстЗапросаВесУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
			"ПеремещениеТоваров.Упаковка",
			"ПеремещениеТоваров.Номенклатура"));
		
	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "&ТекстЗапросаВесНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
			"ПеремещениеТоваров.Номенклатура.ЕдиницаИзмерения",
			"ПеремещениеТоваров.Номенклатура"));
		
	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "&ТекстЗапросаНаименованиеЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Наименование",
			"ПеремещениеТоваров.Упаковка",
			"ПеремещениеТоваров.Номенклатура"));
	
	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "&ТекстЗапросаКодЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Код",
			"ПеремещениеТоваров.Упаковка",
			"ПеремещениеТоваров.Номенклатура"));
	
	Запрос.УстановитьПараметр("ТоварКод", ТоварКод);
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	
	ЗапросТоваров = Новый Запрос();
	ЗапросТоваров.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.НомерСтроки,
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Упаковка,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок,
	|	ПеремещениеТоваровТовары.Количество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &ПеремещениеТоваров";
	
	МассивВыводимыхОбластей = Новый Массив;
	
	ДопПараметрыПредставлениеНоменклатуры = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
	ДопПараметрыПредставлениеНоменклатуры.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	Пока Шапка.Следующий() Цикл
		
		// Для печати комплектов
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
			КомплектПечатиПоСсылке = КомплектыПечати.Найти(Шапка.Ссылка,"Ссылка");
			Если КомплектПечатиПоСсылке = Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати[0];
			КонецЕсли;
			Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
				Продолжить
			КонецЕсли;
		КонецЕсли;

		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросТоваров.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросТоваров.УстановитьПараметр("ПеремещениеТоваров", Шапка.Ссылка);
		ЗапросТоваров.Выполнить();
		
		ПродажиСервер.ПоместитьВременнуюТаблицуКоэффициентыУпаковок(МенеджерВременныхТаблиц);
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ПеремещениеТоваров", Шапка.Ссылка);
		Запрос.УстановитьПараметр("ДатаДокумента", Шапка.ДатаДокумента);
		Запрос.УстановитьПараметр("УчетныйВидЦены", Константы.питНормативнаяЦена.Получить());
		
		// +пит
		ТекстЗапросаШаблон = 
			"%1
			|;
			|%2
			|";
		ТекстЦеныОтборНоменклатура = "ВЫБРАТЬ
			|					Т.Номенклатура
			|				ИЗ
			|					Документ.питВыпускБлюд.Товары КАК Т
			|				ГДЕ
			|					Т.Ссылка = &ПеремещениеТоваров";
		ТекстЗапросаЦены = питЦеныНоменклатуры.ТекстЗапросаЦеныНоменклатуры(Шапка.ДатаДокумента, 
			"втЦеныНоменклатуры", "ДатаЦен", ТекстЦеныОтборНоменклатура, "ХарактеристикаЦен", "УчетныйВидЦены");
		Запрос.УстановитьПараметр("ХарактеристикаЦен", 
			питЦеныНоменклатуры.ПреобразоватьОтборПоХарактеристикеЦен(Шапка.ДатаДокумента, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
		Запрос.УстановитьПараметр("ДатаЦен", КонецДня(Шапка.ДатаДокумента));
		Запрос.Текст = СтрШаблон(ТекстЗапросаШаблон, ТекстЗапросаЦены, ТекстЗапроса1);
		// -пит
		
		
		ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

		// Выводим общие реквизиты шапки.
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);

		// Вывод шапки таблицы.
		ОбластьМакетаШапка    = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
		ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
		ОбластьМакетаШапка.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
		ОбластьМакетаШапка.Параметры.НомерДокумента           = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Ложь, Истина);
		ОбластьМакетаШапка.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакетаШапка, Шапка.Ссылка);
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);

		НомерСтраницы = 1;

		// Вывод заголовка таблицы.
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);

		// Инициализация итогов по странице
		ИтогКоличествоМестПоСтранице = 0;
		ИтогМассаБруттоПоСтранице    = 0;
		ИтогМассыНеттоПоСтранице     = 0;
		ИтогСуммыПоСтранице          = 0;

		// Инициализация итогов по документу
		ИтогоКоличество  = 0;
		ИтогоМассаБрутто = 0;
		ИтогоМассаНетто  = 0;
		ИтогоСумма       = 0;

		// Области макета.
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		ОбластьМакетаСтрока     = Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаВсего      = Макет.ПолучитьОбласть("Всего");
		ОбластьМакетаПодвал     = Макет.ПолучитьОбласть("Подвал");

		Ном = 0;
		КоличествоСтрок = ВыборкаСтрокТовары.Количество();
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			Ном = Ном + 1;
			
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьМакетаСтрока.Параметры.КоличествоМест    = Формат(ВыборкаСтрокТовары.Количество, "ЧЦ=15; ЧДЦ=3");
			ОбластьМакетаСтрока.Параметры.ТоварНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				СокрЛП(ВыборкаСтрокТовары.ТоварНаименование),
				СокрЛП(ВыборкаСтрокТовары.Характеристика),
				СокрЛП(ВыборкаСтрокТовары.Упаковка),
				,
				ДопПараметрыПредставлениеНоменклатуры);
			
			СуммаСтроки = ВыборкаСтрокТовары.Количество * ВыборкаСтрокТовары.Цена;
			ОбластьМакетаСтрока.Параметры.Сумма = СуммаСтроки;
			
			Если Ном > 1 Тогда
			
				// Умещаются ли области на страницу при печати.
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьМакетаСтрока);
				МассивВыводимыхОбластей.Добавить(ОбластьИтоговПоСтранице);
				Если Ном = КоличествоСтрок Тогда
					МассивВыводимыхОбластей.Добавить(ОбластьМакетаВсего);
					МассивВыводимыхОбластей.Добавить(ОбластьМакетаПодвал);
				КонецЕсли;
				
				Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					
					// Вывод итогов по странице.
					ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
					ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
					
					// Инициализация итогов по странице.
					ИтогКоличествоМестПоСтранице = 0;
					ИтогМассаБруттоПоСтранице    = 0;
					ИтогМассаНеттоПоСтранице     = 0;
					ИтогСуммыПоСтранице          = 0;

					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

					// Вывод заголовка таблицы.
					ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);

				КонецЕсли;

			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);

			// Обновление итоги по странице
			ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ВыборкаСтрокТовары.Количество;
			ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + ВыборкаСтрокТовары.МассаБрутто;
			ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице     + ВыборкаСтрокТовары.МассаНетто;
			ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + СуммаСтроки;

			// Обновление итогов по документу
			ИтогоКоличество  = ИтогоКоличество  + ВыборкаСтрокТовары.Количество;
			ИтогоМассаБрутто = ИтогоМассаБрутто + ВыборкаСтрокТовары.МассаБрутто;
			ИтогоМассаНетто  = ИтогоМассаНетто  + ВыборкаСтрокТовары.МассаНетто;
			ИтогоСумма       = ИтогоСумма       + СуммаСтроки;

		КонецЦикла;

		// Вывод итогов по странице.
		ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
		ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);

		// Вывод итогов по документу в целом.
		ОбластьМакетаВсего.Параметры.ИтогоКоличествоМест = ИтогоКоличество;
		ОбластьМакетаВсего.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
		ОбластьМакетаВсего.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
		ОбластьМакетаВсего.Параметры.ИтогоСумма          = ИтогоСумма;
		ТабличныйДокумент.Вывести(ОбластьМакетаВсего);

		// Вывод подвала документа.
		ОбластьМакетаПодвал.Параметры.Заполнить(Шапка);
		ОбластьМакетаПодвал.Параметры.ДолжностьОтправителя = Шапка.ДолжностьКладовщикаОтправителя;
		ОбластьМакетаПодвал.Параметры.ФИООтправителя       = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Шапка.КладовщикОтправитель, Шапка.ДатаДокумента);
		ОбластьМакетаПодвал.Параметры.ДолжностьПолучателя  = Шапка.ДолжностьКладовщикаПолучателя;
		ОбластьМакетаПодвал.Параметры.ФИОПолучателя        = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Шапка.КладовщикПолучатель, Шапка.ДатаДокумента);
		ОбластьМакетаПодвал.Параметры.ИтогоСуммаПрописью   = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Цел(ИтогоСумма), ВалютаРеглУчета, Истина);
		ОбластьМакетаПодвал.Параметры.ИтогоСуммаКоп        = Формат(Цел((ИтогоСумма-Цел(ИтогоСумма))*100), "ЧЦ=2; ЧН=00");
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);

		// Выведем нужное количество экземпляров (при печати комплектов)
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
			ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
			Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьКопирования);
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

#Область ТОРГ16

//%ИзЕРП%
// Обработки.ПечатьТОРГ16.СформироватьПечатнуюФормуТОРГ16
//
// Функция формирует табличный документ печатной формы ТОРГ-16.
//
// Параметры:
//	МассивОбъектов  - Массив         - массив ссылок на объекты которые нужно распечатать,
//	ОбъектыПечати   - СписокЗначений - список объектов печати,
//	ПараметрыПечати - Структура      - структура дополнительных параметров печати.
//
// Возвращаемое значение:
//	ТабличныйДокумент - печатная форма ТОРГ-16 документов, которые нужно распечатать.
//
Функция СформироватьПечатнуюФормуТОРГ16(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	НомерДокумента = 0;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТОРГ16";
	
	Если ТипЗнч(МассивОбъектов) = Тип("Соответствие") Тогда
		СтруктураТипов = МассивОбъектов;
	Иначе
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	КонецЕсли;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		//+пит
		//Если СтруктураОбъектов.Ключ <> "Документ.СписаниеНедостачТоваров"
		//	//++ НЕ УТ
		//	И СтруктураОбъектов.Ключ <> "Документ.ОтчетОСписанииТоваровСХранения"
		//	И СтруктураОбъектов.Ключ <> "Документ.ОтчетОСписанииТоваровУХранителя" Тогда
		//	//-- НЕ УТ
		//	Тогда
		//	
		//	
		//	ТекстСообщения = НСтр("ru = 'Формирование печатной формы ""ТОРГ-16"" доступно только для документа ""%СписаниеНедостач%"".'");
		//	//++ НЕ УТ
		//	ТекстСообщения = НСтр("ru = 'Формирование печатной формы ""ТОРГ-16"" доступно только для документов ""%СписаниеНедостач%"" и ""%СписаниеСХранения%"".'");
		//	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СписаниеСХранения%",
		//		Метаданные.Документы.ОтчетОСписанииТоваровСХранения.Синоним);
		//	//-- НЕ УТ
		//	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СписаниеНедостач%",
		//		Метаданные.Документы.СписаниеНедостачТоваров.Синоним);
		//	
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		//	
		//	Продолжить;
		//	
		//КонецЕсли;
		//-пит
		
		МенеджерОбъекта = ОбщегоНазначенияУТ.ПолучитьМодульЛокализации(СтруктураОбъектов.Ключ);
		Если МенеджерОбъекта = Неопределено Тогда
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		КонецЕсли;
		
		Для Каждого ДокументОснование Из СтруктураОбъектов.Значение Цикл
			
			//+пит
			Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ХозяйственнаяОперация") = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСоСписанием Тогда
				Продолжить;
			КонецЕсли;
			//-пит
			
			НомерДокумента = НомерДокумента + 1;
			
			Если НомерДокумента > 1 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			//+пит
			//ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыТОРГ16(ПараметрыПечати, ДокументОснование);
			ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТОРГ16(ПараметрыПечати, ДокументОснование);
			//-пит
			
			Если Не ДанныеДляПечати = Неопределено Тогда
				ЗаполнитьТабличныйДокументТОРГ16(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ДокументОснование);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//%ИзЕРП%
// Обработки.ПечатьТОРГ16.ЗаполнитьТабличныйДокументТОРГ16
//
// Заполняет табличный документ печатной формы ТОРГ-16 данными документа, которого нужно распечатать.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент - табличный документ печатной формы ТОРГ-16,
//	ДанныеДляПечати   - Структура         - структура данных объекта печати.
//	ОбъектыПечати     - СписокЗначений    - список объектов печати,
//	ДокументОснование - ДокументСсылка    - ссылка на документ, который нужно распечатать.
//
Процедура ЗаполнитьТабличныйДокументТОРГ16(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ДокументОснование)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ16.ПФ_MXL_ТОРГ16");
	
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	Шапка                      = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ТабличнаяЧастьПервогоЛиста = ДанныеДляПечати.РезультатПоДатам.Выбрать();
	ТабличнаяЧастьВторогоЛиста = ДанныеДляПечати.РезультатПоТоварам.Выбрать();
	ТаблицаКурсовВалют         = ДанныеДляПечати.РезультатКурсыВалют;
	
	ВалютаРеглУчета      = Константы.ВалютаРегламентированногоУчета.Получить();
	КоэффициентПересчета = ТаблицаКурсовВалют.Найти(ДокументОснование, "Ссылка");
	КурсВалюты           = ?(ЗначениеЗаполнено(КоэффициентПересчета), КоэффициентПересчета.Курс, 1);
	
	ОбластьШапкаШтрихкод                = Макет.ПолучитьОбласть("ШапкаШтрихкод");
	ОбластьШапкаОснование               = Макет.ПолучитьОбласть("ШапкаОснование");
	ОбластьЗаголовокТаблицыПервогоЛиста = Макет.ПолучитьОбласть("ЗаголовокТаблицыПервогоЛиста");
	ОбластьСтрокаПервогоЛиста           = Макет.ПолучитьОбласть("СтрокаПервогоЛиста");
	ОбластьЗаголовокТаблицыВторогоЛиста = Макет.ПолучитьОбласть("ЗаголовокТаблицыВторогоЛиста");
	ОбластьСтрокаВторогоЛиста           = Макет.ПолучитьОбласть("СтрокаВторогоЛиста");
	ОбластьИтого                        = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал                       = Макет.ПолучитьОбласть("Подвал");
	
	Шапка.Следующий();
	
	ОбластьШапкаШтрихкод.Параметры.Заполнить(Шапка);
	
	ПодразделениеПредставление = СкладыСервер.ПолучитьПредставлениеСклада(Шапка.ПодразделениеПредставление);
	
	СтруктураДанныхШапкиШтрихкод = Новый Структура("ПодразделениеПредставление", ПодразделениеПредставление);
	ОбластьШапкаШтрихкод.Параметры.Заполнить(СтруктураДанныхШапкиШтрихкод);
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШапкаШтрихкод,
		Шапка.Ссылка);
	ТабличныйДокумент.Вывести(ОбластьШапкаШтрихкод);
	
	//++ НЕ УТ
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СписаниеПринятыхНаХранениеТоваров") Тогда
		ОбластьШапкаПоклажедатель = Макет.ПолучитьОбласть("ШапкаПоклажедатель");
		
		ПоставщикПредставление = ФормированиеПечатныхФорм.ОписаниеОрганизации(
									ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.ДатаДокумента),
									"ПолноеНаименование");
		
		СтруктураДанныхШапкиПоклажедатель = Новый Структура;
		СтруктураДанныхШапкиПоклажедатель.Вставить("Поставщик",              Шапка.Поставщик);
		СтруктураДанныхШапкиПоклажедатель.Вставить("ПоставщикПредставление", ПоставщикПредставление);
		
		ОбластьШапкаПоклажедатель.Параметры.Заполнить(СтруктураДанныхШапкиПоклажедатель);
		ТабличныйДокумент.Вывести(ОбластьШапкаПоклажедатель);
	КонецЕсли;
	//-- НЕ УТ
	
	НомерДокументаПечати       = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер);
	ОснованиеНомер             = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.НомерОснования);
	ФИОРуководителя            = Шапка.Руководитель;
	
	СтруктураДанныхШапкиОснование = Новый Структура;
	СтруктураДанныхШапкиОснование.Вставить("ФИОРуководителя", ФИОРуководителя);
	СтруктураДанныхШапкиОснование.Вставить("НомерДокумента",  НомерДокументаПечати);
	СтруктураДанныхШапкиОснование.Вставить("ОснованиеНомер",  ОснованиеНомер);
	
	ОбластьШапкаОснование.Параметры.Заполнить(Шапка);
	
	Если ЗначениеЗаполнено(Шапка.ДокументОснование) Тогда
		ПредставлениеОснования = Шапка.ДокументОснование.ПолучитьОбъект().Метаданные().Синоним;
		
		СтруктураДанныхШапкиОснование.Вставить("ОснованиеПредставление", ПредставлениеОснования);
	КонецЕсли;
	
	ОбластьШапкаОснование.Параметры.Заполнить(СтруктураДанныхШапкиОснование);
	ТабличныйДокумент.Вывести(ОбластьШапкаОснование);
	
	НомерСтраницы = 0;
	НомерСтроки   = 0;
	
	МассивВыводимыхОбластей = Новый Массив;
	МассивВыводимыхОбластей.Добавить(ОбластьСтрокаПервогоЛиста);
	
	Пока ТабличнаяЧастьПервогоЛиста.Следующий() Цикл
		
		НомерСтроки                = НомерСтроки + 1;
		СтруктураСтрокПервогоЛиста = Новый Структура("ДатаСписанияТовара", Шапка.ДатаДокумента);
		
		ОбластьСтрокаПервогоЛиста.Параметры.Заполнить(СтруктураСтрокПервогоЛиста);
		
		Если НомерСтроки = 1 Тогда // первая строка
			
			НомерСтраницы             = НомерСтраницы + 1;
			СтруктураЗаголовкаТаблицы = Новый Структура("НомерСтраницы", "Страница " + НомерСтраницы);
			
			ОбластьЗаголовокТаблицыПервогоЛиста.Параметры.Заполнить(СтруктураЗаголовкаТаблицы);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицыПервогоЛиста);
			
		ИначеЕсли НомерСтроки <> 1 И Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
			
			НомерСтраницы = НомерСтраницы + 1;
			СтруктураЗаголовкаТаблицы = Новый Структура("НомерСтраницы", "Страница " + НомерСтраницы);
			
			ОбластьЗаголовокТаблицыПервогоЛиста.Параметры.Заполнить(СтруктураЗаголовкаТаблицы);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицыПервогоЛиста);
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаПервогоЛиста);
		
	КонецЦикла;
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ИтогоСтоимость = 0;
	
	// Выводим многострочную часть документа
	НомерСтроки     = 0;
	КоличествоСтрок = ТабличнаяЧастьВторогоЛиста.Количество();
	
	Пока ТабличнаяЧастьВторогоЛиста.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтрокаВторогоЛиста.Параметры.Заполнить(ТабличнаяЧастьВторогоЛиста);
		
		ТоварНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ТабличнаяЧастьВторогоЛиста.НоменклатураПредставление, ТабличнаяЧастьВторогоЛиста.ХарактеристикаПредставление);
		
		ЦенаНеЗадана = НЕ ЗначениеЗаполнено(ТабличнаяЧастьВторогоЛиста.Цена);
		Цена         = ?(ЦенаНеЗадана, 0, ТабличнаяЧастьВторогоЛиста.Цена * КурсВалюты);
		Стоимость    = ?(ЦенаНеЗадана, 0, ТабличнаяЧастьВторогоЛиста.Цена
			* ТабличнаяЧастьВторогоЛиста.КоличествоМест * КурсВалюты);
		
		СтруктураДанныхТовара = Новый Структура;
		СтруктураДанныхТовара.Вставить("ТоварНаименование", ТоварНаименование);
		СтруктураДанныхТовара.Вставить("Цена",              Цена);
		СтруктураДанныхТовара.Вставить("Стоимость",         Стоимость);
		
		ОбластьСтрокаВторогоЛиста.Параметры.Заполнить(СтруктураДанныхТовара);
		
		Если НомерСтроки = 1 Тогда // первая строка
			
			НомерСтраницы             = НомерСтраницы + 1;
			СтруктураЗаголовкаТаблицы = Новый Структура("НомерСтраницы", "Страница " + НомерСтраницы);
			
			ОбластьЗаголовокТаблицыВторогоЛиста.Параметры.Заполнить(СтруктураЗаголовкаТаблицы);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицыВторогоЛиста);
			
		Иначе
			
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьСтрокаВторогоЛиста);
			
			Если НомерСтроки = КоличествоСтрок Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьИтого);
			КонецЕсли;
			
			Если НомерСтроки <> 1 И Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				
				НомерСтраницы             = НомерСтраницы + 1;
				СтруктураЗаголовкаТаблицы = Новый Структура("НомерСтраницы", "Страница " + НомерСтраницы);
				
				ОбластьЗаголовокТаблицыВторогоЛиста.Параметры.Заполнить(СтруктураЗаголовкаТаблицы);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицыВторогоЛиста);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаВторогоЛиста);
		
		// Обновим итоги по документу
		ИтогоСтоимость = ИтогоСтоимость + ОбластьСтрокаВторогоЛиста.Параметры.Стоимость;
		
	КонецЦикла;
	
	// Выводим итоги по документу в общем
	СтруктураДанныхИтогов = Новый Структура("Итого", ИтогоСтоимость);
	
	ОбластьИтого.Параметры.Заполнить(СтруктураДанныхИтогов);
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	// Выводим подвал документа
	МассивВыводимыхОбластей.Очистить();
	МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
	
	Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
		НомерСтраницы = НомерСтраницы + 1;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	КопеекЦифрами           = (ИтогоСтоимость - Цел(ИтогоСтоимость)) * 100;
	КопеекЦифрами           = Формат(КопеекЦифрами, "ЧЦ=2; ЧДЦ=0; ЧН='00'");
	СуммаСписанияПрописью   = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Цел(ИтогоСтоимость),
		Справочники.Валюты.ПустаяСсылка(), Истина);
	ДолжностьПредседателя   = Шапка.ДолжностьРуководителя;
	ФИОпредседателя         = Шапка.Руководитель;
	ДолжностьЧленаКомиссии2 = НСтр("ru='Главный бухгалтер'");
	ФИОЧленаКомиссии2       = Шапка.ГлавныйБухгалтер;
	ДолжностьМОЛ            = Шапка.ДолжностьКладовщика;
	ФИОМОЛ                  = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Шапка.Кладовщик, Шапка.ДатаДокумента);
	
	СтруктураДанныхПодвала = Новый Структура;
	СтруктураДанныхПодвала.Вставить("КопеекЦифрами",           КопеекЦифрами);
	СтруктураДанныхПодвала.Вставить("СуммаСписанияПрописью",   СуммаСписанияПрописью);
	СтруктураДанныхПодвала.Вставить("ДолжностьПредседателя",   ДолжностьПредседателя);
	СтруктураДанныхПодвала.Вставить("ФИОпредседателя",         ФИОпредседателя);
	СтруктураДанныхПодвала.Вставить("ДолжностьЧленаКомиссии2", ДолжностьЧленаКомиссии2);
	СтруктураДанныхПодвала.Вставить("ФИОЧленаКомиссии2",       ФИОЧленаКомиссии2);
	СтруктураДанныхПодвала.Вставить("ДолжностьМОЛ",            ДолжностьМОЛ);
	СтруктураДанныхПодвала.Вставить("ФИОМОЛ",                  ФИОМОЛ);
	
	ОбластьПодвал.Параметры.Заполнить(Шапка);
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанныхПодвала);
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	
КонецПроцедуры

//%ИзЕРП%
// Функция получает данные для формирования печатной формы ТОРГ-16.
//
// Параметры:
//	ПараметрыПечати   - Структура                                        - структура дополнительных параметров печати,
//	ДокументОснование - ДокументСсылка.СписаниеНедостачТоваров - ссылка на документ, который нужно распечатать.
//
// Возвращаемое значение:
//	Структура - структура с данными для печати формы ТОРГ-16.
//
Функция ПолучитьДанныеДляПечатнойФормыТОРГ16(ПараметрыПечати, ДокументОснование) Экспорт
	
	СписаниеНедостачТоваровЛокализация.ПолучитьДанныеДляПечатнойФормыТОРГ16(ПараметрыПечати, ДокументОснование);
	
КонецФункции

//%ИзЕРП%
// СписаниеНедостачТоваровЛокализация.ТаблицаКурсовВалют
//
Функция ТаблицаКурсовВалют(МассивДокументов)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	СписаниеНедостачТоваров.Ссылка КАК Ссылка,
	                      |	НАЧАЛОПЕРИОДА(СписаниеНедостачТоваров.Дата, ДЕНЬ) КАК Дата,
	                      |	СписаниеНедостачТоваров.ВидЦены.ВалютаЦены КАК Валюта,
	                      |	СписаниеНедостачТоваров.Организация.ВалютаРегламентированногоУчета КАК БазоваяВалюта
	                      |ИЗ
	                      |	Документ.СписаниеНедостачТоваров КАК СписаниеНедостачТоваров
	                      |ГДЕ
	                      |	СписаниеНедостачТоваров.Ссылка В(&МассивДокументов)
	                      |	И СписаниеНедостачТоваров.ВидЦены.ВалютаЦены <> СписаниеНедостачТоваров.Организация.ВалютаРегламентированногоУчета
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Валюта,
	                      |	Дата");
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	ТаблицаКурсовВалют = Новый ТаблицаЗначений;
	ТаблицаКурсовВалют.Колонки.Добавить("Ссылка",    Новый ОписаниеТипов("ДокументСсылка.СписаниеНедостачТоваров"));
	ТаблицаКурсовВалют.Колонки.Добавить("Валюта",    Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаКурсовВалют.Колонки.Добавить("Дата",      Новый ОписаниеТипов("Дата"));
	ТаблицаКурсовВалют.Колонки.Добавить("КурсЧислитель", Новый ОписаниеТипов("Число"));
	ТаблицаКурсовВалют.Колонки.Добавить("КурсЗнаменатель", Новый ОписаниеТипов("Число"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаКурсовВалют.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		КурсыВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(Выборка.Валюта, Выборка.Дата, Выборка.БазоваяВалюта);
		НоваяСтрока.КурсЧислитель = КурсыВалюты.КурсЧислитель;
		НоваяСтрока.КурсЗнаменатель = КурсыВалюты.КурсЗнаменатель;
		
	КонецЦикла;
	
	Возврат ТаблицаКурсовВалют;
	
КонецФункции // ТаблицаКурсовВалют()

#КонецОбласти

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//////питОП1
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"питОП1",
		НСтр("ru = 'ОП-1 (все позиции)'"),
		ПечатьОП1(МассивОбъектов, ОбъектыПечати,ПараметрыПечати),
		,
		"ОбщийМакет.ПФ_MXL_питОП1");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП1_ТБ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"питОП1_ТБ",
		НСтр("ru = 'ОП-1 (Текущее блюдо)'"),
		ПечатьОП1_ТБ(МассивОбъектов, ОбъектыПечати,ПараметрыПечати),
		,
		"ОбщийМакет.ПФ_MXL_питОП1");
	КонецЕсли;
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП1_СПараметрами") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "питОП1_СПараметрами", "ОП-1",
			ПечатьОП1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питОП1");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП1_ТБ_СПараметрами") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "питОП1_ТБ_СПараметрами", "ОП-1 (Текущее блюдо с параметрами)",
			ПечатьОП1_ТБ(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, Истина),,"ОбщийМакет.ПФ_MXL_питОП1");
	КонецЕсли;

	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехТехнолКартаПоНорме") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТехТехнолКартаПоНорме", "Технико-технологическая карта по норма",
			ПечатьТехТехнолКарта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питТехникоТехнологическаяКарта");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехТехнолКартаГОСТ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТехТехнолКартаГОСТ", "Технико-технологическая карта ГОСТ",
			ПечатьТехТехнолКарта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питТехникоТехнологическаяКартаГОСТ");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехТехнолКартаПоФакту") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТехТехнолКартаПоФакту", "Технико-технологическая карта по факту",
			ПечатьТехТехнолКарта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питТехникоТехнологическаяКарта");
	КонецЕсли;
	
	//////питОП1 - План меню
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "питОП2", "ОП-2 (План-меню)",
			ПечатьОП2(МассивОбъектов, ОбъектыПечати),,"ОбщийМакет.ПФ_MXL_питОП2");
	КонецЕсли;
	
	//////питОП10 - Акт о реализации
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП10") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "питОП10", "ОП-10 (Акт о реализации)",
		ПечатьОП10(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питОП10");
	КонецЕсли;//////питОП10 - Акт о реализации
	
	//////питОП12 - (Акт о реализации изделий кухни)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП12") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "питОП12", "ОП-12 (Акт о реализации изделий кухни)",
			ПечатьОП12(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питОП12");
	КонецЕсли;//////питОП12 - (Акт о реализации изделий кухни)
		
	//////питОП21 - (Акт на отпуск питания сотрудникам организации)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питОП21") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "питОП21", "ОП-21 (Акт на отпуск питания сотрудникам организации)",
			ПечатьОП21(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_питОП21");
	КонецЕсли;//////питОП21 - (Акт на отпуск питания сотрудникам организации)
	
	//////Ведомость недовложений
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВедомостьНедовложений") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВедомостьНедовложений", "Ведомость недовложений",
			ПечатьВедомостьНедовложений(МассивОбъектов, ОбъектыПечати),,"ОбщийМакет.ПФ_MXL_питВедомостьНедовложений");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПотребностьВИнгредиентахПоБлюдам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПотребностьВИнгредиентахПоБлюдам", "Потребность в ингредиентах по блюдам",
		питДиетпитание.ПечатьПотребностьВИнгредиентах(МассивОбъектов, ОбъектыПечати, "ПоБлюдам"),,"ОбщийМакет.ПФ_MXL_питПотребностьВИнгредиентах");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПотребностьВИнгредиентахПоБлюдамСПолуфабрикатами") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПотребностьВИнгредиентахПоБлюдамСПолуфабрикатами", 
		"Потребность в ингредиентах по блюдам с полуфабрикатами",
		питДиетпитание.ПечатьПотребностьВИнгредиентах(МассивОбъектов, ОбъектыПечати, "ПоБлюдамСПолуфабрикатами"),,"ОбщийМакет.ПФ_MXL_питПотребностьВИнгредиентах");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ13") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ТОРГ13",
			НСтр("ru = 'Накладная на внутреннее перемещение (ТОРГ-13)'"),
			СформироватьПечатнуюФормуТОРГ13(МассивОбъектов, ОбъектыПечати, Неопределено));
		
	КонецЕсли;
	
	// Подкладной документ теперь не списание товаров а внутреннее потребление, для него ТОРГ-16 не формируется.
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "питТОРГ16") Тогда
	//	
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
	//	"питТОРГ16",
	//	НСтр("ru = 'Акт о списании товаров (ТОРГ-16)'"),
	//	СформироватьПечатнуюФормуТОРГ16(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	//	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Отчеты

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, НастройкиФормы) Экспорт
	
	питОтчеты.ДобавитьКомандуПоказатьУчетныеДокументы(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти 


#Область Серии

// Имена реквизитов, от значений которых зависят параметры указания серий.
//
//	Возвращаемое значение:
//		Строка - имена реквизитов, перечисленные через запятую.
//
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	
	Возврат "Подразделение, Дата";
	
КонецФункции

// Возвращает параметры указания серий для товаров, указанных в документе.
//
//	Параметры:
//			Объект - Структура - структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
//	Возвращаемое значение:
//			Структура - Структура параметров указания серий для объекта.
//
Функция ПараметрыУказанияСерий(Объект) Экспорт
	
	ПараметрыУказанияСерий = Новый Структура;
	
	#Область Товары
	
	ПараметрыУказанияСерийТЧ = НоменклатураКлиентСервер.ПараметрыУказанияСерий();	
	ПараметрыУказанияСерийТЧ.ПолноеИмяОбъекта	= "Документ.питВыпускБлюд";
	ПараметрыУказанияСерийТЧ.ИмяПоляСклад		= "Склад";
	ПараметрыУказанияСерийТЧ.ИмяТЧТовары		= "Товары";
	ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "ТоварыСерии";
	//ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "Товары";
	
	ПараметрыУказанияСерийТЧ.УчитыватьСебестоимостьПоСериям	= ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьПоСериямСклад", Новый Структура());
	ПараметрыУказанияСерийТЧ.ИспользоватьСерииНоменклатуры	= ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад", Новый Структура());
	
	ПараметрыУказанияСерийТЧ.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерий");
	
	//>>Швецов. 18.12.2024. Розничные продажи алкоголя. Вызов события сканирования штрихкода
	//ПараметрыУказанияСерийТЧ.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПриемкаПродукцииИзПроизводства);
	ПараметрыУказанияСерийТЧ.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаВРозницу);
	//<<Швецов. 18.12.2024. Розничные продажи алкоголя. Вызов события сканирования штрихкода
	
	ПараметрыУказанияСерийТЧ.ЭтоНакладная = Истина;
	
	ПараметрыУказанияСерийТЧ.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии = Истина;
	//ПараметрыУказанияСерийТЧ.ПланированиеОтгрузки = Ложь;
	ПараметрыУказанияСерийТЧ.ПланированиеОтгрузки = Истина;
	
	//>>Швецов. 18.12.2024. Розничные продажи алкоголя. Вызов события сканирования штрихкода
	ПараметрыУказанияСерийТЧ.ПланированиеОтбора   = Ложь;
	//ПараметрыУказанияСерийТЧ.ПланированиеОтбора   = Истина;
	
	ПараметрыУказанияСерийТЧ.ФактОтбора           = Истина;
	
	ПараметрыУказанияСерийТЧ.РегистрироватьСерии = Истина;
	//ПараметрыУказанияСерийТЧ.РегистрироватьСерии = Ложь;
	//<<Швецов. 18.12.2024. Розничные продажи алкоголя. Вызов события сканирования штрихкода
	
	ПараметрыУказанияСерийТЧ.Дата = Объект.Дата;
		
	ПараметрыУказанияСерий.Вставить("Товары", ПараметрыУказанияСерийТЧ);
	
	//>>Швецов. 18.12.2024. Розничные продажи алкоголя. Вызов события сканирования штрихкода
	
	Для Каждого Элемент из ПараметрыУказанияСерийТЧ Цикл
		
		ПараметрыУказанияСерий.Вставить(Элемент.Ключ, Элемент.Значение);			
		
	КонецЦикла;
	//<<Швецов. 18.12.2024. Розничные продажи алкоголя. Вызов события сканирования штрихкода
	
	#КонецОбласти
	
	#Область Модификаторы
	
	ПараметрыУказанияСерийТЧ = НоменклатураКлиентСервер.ПараметрыУказанияСерий();     
	ПараметрыУказанияСерийТЧ.ПолноеИмяОбъекта	= "Документ.питВыпускБлюд";
	ПараметрыУказанияСерийТЧ.ИмяПоляСклад		= "Склад";
	ПараметрыУказанияСерийТЧ.ИмяТЧТовары		= "Модификаторы";
	//ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "ТоварыСерии";
	ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "Модификаторы";
	
	ПараметрыУказанияСерийТЧ.УчитыватьСебестоимостьПоСериям	= ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьПоСериямСклад", Новый Структура());
	ПараметрыУказанияСерийТЧ.ИспользоватьСерииНоменклатуры	= ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад", Новый Структура());
	
	ПараметрыУказанияСерийТЧ.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерий");
	
	ПараметрыУказанияСерийТЧ.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПриемкаПродукцииИзПроизводства);
	
	ПараметрыУказанияСерийТЧ.ЭтоНакладная = Истина;
	
	ПараметрыУказанияСерийТЧ.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии = Истина;
	ПараметрыУказанияСерийТЧ.ПланированиеОтгрузки = Ложь;
	ПараметрыУказанияСерийТЧ.ПланированиеОтбора   = Ложь;
	ПараметрыУказанияСерийТЧ.ФактОтбора           = Истина;
	
	ПараметрыУказанияСерийТЧ.РегистрироватьСерии = Истина;
	
	ПараметрыУказанияСерийТЧ.Дата = Объект.Дата;
	
	ПараметрыУказанияСерий.Вставить("Модификаторы", ПараметрыУказанияСерийТЧ);
	
	#КонецОбласти
	
	#Область ПобочныеИзделия
	
	ПараметрыУказанияСерийТЧ = НоменклатураКлиентСервер.ПараметрыУказанияСерий();    	
	ПараметрыУказанияСерийТЧ.ПолноеИмяОбъекта	= "Документ.питВыпускБлюд";
	ПараметрыУказанияСерийТЧ.ИмяПоляСклад		= "Получатель";
	ПараметрыУказанияСерийТЧ.ИмяТЧТовары		= "ПобочныеИзделия";
	//ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "ПобочныеИзделияСерии";
	ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "ПобочныеИзделия";
	
	ПараметрыУказанияСерийТЧ.УчитыватьСебестоимостьПоСериям	= ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьПоСериямСклад", Новый Структура());
	ПараметрыУказанияСерийТЧ.ИспользоватьСерииНоменклатуры	= ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад", Новый Структура());
	
	ПараметрыУказанияСерийТЧ.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерий");
	
	ПараметрыУказанияСерийТЧ.ПоляСвязи.Добавить("Назначение");
	ПараметрыУказанияСерийТЧ.ПоляСвязи.Добавить("Получатель");
	
	ПараметрыУказанияСерийТЧ.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПриемкаПродукцииИзПроизводства);
	
	ПараметрыУказанияСерийТЧ.ЭтоНакладная = Истина;
	
	ПараметрыУказанияСерийТЧ.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии = Истина;
	ПараметрыУказанияСерийТЧ.ПланированиеОтгрузки = Ложь;
	ПараметрыУказанияСерийТЧ.ПланированиеОтбора   = Ложь;
	ПараметрыУказанияСерийТЧ.ФактОтбора           = Истина;
	
	ПараметрыУказанияСерийТЧ.РегистрироватьСерии = Истина;
	
	ПараметрыУказанияСерийТЧ.Дата = Объект.Дата;
	
	ПараметрыУказанияСерий.Вставить("ПобочныеИзделия", ПараметрыУказанияСерийТЧ);
	
	#КонецОбласти
	
	#Область Блюда
	
	ПараметрыУказанияСерийТЧ = НоменклатураКлиентСервер.ПараметрыУказанияСерий();	
	ПараметрыУказанияСерийТЧ.ПолноеИмяОбъекта	= "Документ.питВыпускБлюд";
	ПараметрыУказанияСерийТЧ.ИмяПоляСклад		= "Склад";
	ПараметрыУказанияСерийТЧ.ИмяТЧТовары		= "Блюда";
	//ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "БлюдаСерии";
	ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "Блюда";
	
	ПараметрыУказанияСерийТЧ.УчитыватьСебестоимостьПоСериям	= ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьПоСериямСклад", Новый Структура());
	ПараметрыУказанияСерийТЧ.ИспользоватьСерииНоменклатуры	= ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад", Новый Структура());
	
	ПараметрыУказанияСерийТЧ.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерий");
	
	ПараметрыУказанияСерийТЧ.ИмяПоляКоличество = "КоличествоУпаковокНоменклатуры";
	
	ПараметрыУказанияСерийТЧ.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПриемкаПродукцииИзПроизводства);
	
	ПараметрыУказанияСерийТЧ.ЭтоНакладная = Истина;
	
	ПараметрыУказанияСерийТЧ.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии = Истина;
	ПараметрыУказанияСерийТЧ.ПланированиеОтгрузки = Ложь;
	ПараметрыУказанияСерийТЧ.ПланированиеОтбора   = Ложь;
	ПараметрыУказанияСерийТЧ.ФактОтбора           = Истина;
	
	ПараметрыУказанияСерийТЧ.РегистрироватьСерии = Истина;
	
	ПараметрыУказанияСерийТЧ.Дата = Объект.Дата;
	
	ПараметрыУказанияСерий.Вставить("Блюда", ПараметрыУказанияСерийТЧ);
	
	#КонецОбласти
	
	#Область Ингредиенты
	
	ПараметрыУказанияСерийТЧ = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	ПараметрыУказанияСерийТЧ.ПолноеИмяОбъекта	= "Документ.питВыпускБлюд";
	ПараметрыУказанияСерийТЧ.ИмяПоляСклад		= "Склад";
	ПараметрыУказанияСерийТЧ.ИмяТЧТовары		= "Ингредиенты";
	ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "Ингредиенты";
	
	ПараметрыУказанияСерийТЧ.УчитыватьСебестоимостьПоСериям	= ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьПоСериямСклад", Новый Структура());
	ПараметрыУказанияСерийТЧ.ИспользоватьСерииНоменклатуры	= ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад", Новый Структура());
	
	ПараметрыУказанияСерийТЧ.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерий");
	
	ПараметрыУказанияСерийТЧ.ИмяПоляКоличество = "КоличествоУпаковокНоменклатуры";
	
	ПараметрыУказанияСерийТЧ.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПередачаВПроизводствоОтгрузка);
	ПараметрыУказанияСерийТЧ.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПередачаВПроизводствоПриемка);
	
	ПараметрыУказанияСерийТЧ.ЭтоНакладная = Истина;
	
	ПараметрыУказанияСерийТЧ.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии = Истина;
	ПараметрыУказанияСерийТЧ.ПланированиеОтгрузки = Ложь;
	ПараметрыУказанияСерийТЧ.ПланированиеОтбора   = Ложь;
	ПараметрыУказанияСерийТЧ.ФактОтбора           = Истина;
	
	ПараметрыУказанияСерийТЧ.РегистрироватьСерии = Истина;
	
	ПараметрыУказанияСерийТЧ.Дата = Объект.Дата;
	
	ПараметрыУказанияСерий.Вставить("Ингредиенты", ПараметрыУказанияСерийТЧ);
	
	#КонецОбласти
	
	#Область Замены
	
	ПараметрыУказанияСерийТЧ = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	ПараметрыУказанияСерийТЧ.ПолноеИмяОбъекта	= "Документ.питВыпускБлюд";
	ПараметрыУказанияСерийТЧ.ИмяПоляСклад		= "Склад";
	ПараметрыУказанияСерийТЧ.ИмяТЧТовары		= "Замены";
	ПараметрыУказанияСерийТЧ.ИмяТЧСерии			= "Замены";
	
	ПараметрыУказанияСерийТЧ.УчитыватьСебестоимостьПоСериям	= ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьПоСериямСклад", Новый Структура());
	ПараметрыУказанияСерийТЧ.ИспользоватьСерииНоменклатуры	= ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад", Новый Структура());
	
	//ПараметрыУказанияСерийТЧ.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерий");
	
	ПараметрыУказанияСерийТЧ.ИмяПоляКоличество = "КоличествоУпаковокНоменклатуры";
	
	ПараметрыУказанияСерийТЧ.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПередачаВПроизводствоОтгрузка);
	ПараметрыУказанияСерийТЧ.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПередачаВПроизводствоПриемка);
	
	ПараметрыУказанияСерийТЧ.ЭтоНакладная = Истина;
	
	ПараметрыУказанияСерийТЧ.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии = Истина;
	ПараметрыУказанияСерийТЧ.ПланированиеОтгрузки = Ложь;
	ПараметрыУказанияСерийТЧ.ПланированиеОтбора   = Ложь;
	ПараметрыУказанияСерийТЧ.ФактОтбора           = Истина;
	
	ПараметрыУказанияСерийТЧ.РегистрироватьСерии = Истина;
	
	ПараметрыУказанияСерийТЧ.Дата = Объект.Дата;
	
	ПараметрыУказанияСерийТЧ.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерийИнгредиентаИсходный");
	ПараметрыУказанияСерийТЧ.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерийИнгредиентаЗамена");
	
	ПараметрыУказанияСерий.Вставить("Замены", ПараметрыУказанияСерийТЧ);
	
	#КонецОбласти
	
	Возврат ПараметрыУказанияСерий;
	
КонецФункции

// Возвращает текст запроса для расчета статусов указания серий.
//	Параметры:
//		ПараметрыУказанияСерий - Структура - состав полей задается в функции НоменклатураКлиентСервер.ПараметрыУказанияСерий.
//	Возвращаемое значение:
//		Строка - текст запроса.
//
Функция ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПараметрыУказанияСерий) Экспорт
	
	ТекстЗапроса = "";
	
	Если ПараметрыУказанияСерий.ИмяТЧТовары = "Товары" 
		ИЛИ ПараметрыУказанияСерий.ИмяТЧТовары = "Блюда"
		ИЛИ ПараметрыУказанияСерий.ИмяТЧТовары = "Модификаторы" Тогда
		ТекстЗапроса = ТекстЗапросаЗаполненияСтатусовУказанияСерийТоварыБлюда();
	ИначеЕсли ПараметрыУказанияСерий.ИмяТЧТовары = "ПобочныеИзделия" Тогда
		ТекстЗапроса = ТекстЗапросаЗаполненияСтатусовУказанияСерийВыходныеИзделия();
	ИначеЕсли ПараметрыУказанияСерий.ИмяТЧТовары = "Ингредиенты" Тогда
		ТекстЗапроса = ТекстЗапросаЗаполненияСтатусовУказанияСерийИнгредиенты();
	ИначеЕсли ПараметрыУказанияСерий.ИмяТЧТовары = "Замены" Тогда
		ТекстЗапроса = ТекстЗапросаЗаполненияСтатусовУказанияСерийЗамены();
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаполненияСтатусовУказанияСерийТоварыБлюда()
	
	//>>Швецов. 26.12.2025. Розничные продажи алкоголя  
	////Запрос на проверку указаны ли серии в ТЧ ТоварыСерии   
	//
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	Товары.Номенклатура,
	//|	Товары.Серия,
	//|	Товары.СтатусУказанияСерий,
	//|	Товары.НомерСтроки
	//|ПОМЕСТИТЬ Товары
	//|ИЗ
	//|	&Товары КАК Товары
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Товары.НомерСтроки КАК НомерСтроки,
	//|	Товары.СтатусУказанияСерий КАК СтарыйСтатусУказанияСерий,
	//|	ВЫБОР
	//|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL 
	//|			ТОГДА 0
	//|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	//|			ТОГДА ВЫБОР
	//|					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	//|						ТОГДА 14
	//|					ИНАЧЕ 13
	//|				КОНЕЦ
	//|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
	//|			ТОГДА ВЫБОР
	//|					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	//|						ТОГДА 10
	//|					ИНАЧЕ 9
	//|				КОНЕЦ
	//|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора
	//|			ТОГДА ВЫБОР
	//|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчетСерийПоFEFO
	//|						ТОГДА ВЫБОР
	//|								КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	//|									ТОГДА 6
	//|								ИНАЧЕ 5
	//|							КОНЕЦ
	//|					ИНАЧЕ ВЫБОР
	//|							КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	//|								ТОГДА 8
	//|							ИНАЧЕ 7
	//|						КОНЕЦ
	//|				КОНЕЦ
	//|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПоФактуОтбора
	//|				И ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриОтгрузкеНаВнутренниеНужды
	//|			ТОГДА ВЫБОР
	//|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	//|						ТОГДА ВЫБОР
	//|								КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	//|									ТОГДА 4
	//|								ИНАЧЕ 3
	//|							КОНЕЦ
	//|					ИНАЧЕ ВЫБОР
	//|							КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	//|								ТОГДА 2
	//|							ИНАЧЕ 1
	//|						КОНЕЦ
	//|				КОНЕЦ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СтатусУказанияСерий
	//|ПОМЕСТИТЬ Статусы
	//|ИЗ
	//|	Товары КАК Товары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	//|		ПО (ПолитикиУчетаСерий.Склад = &Склад)
	//|			И (ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Статусы.НомерСтроки,
	//|	Статусы.СтатусУказанияСерий
	//|ИЗ
	//|	Статусы КАК Статусы
	//|ГДЕ
	//|	Статусы.СтатусУказанияСерий <> Статусы.СтарыйСтатусУказанияСерий
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Статусы.НомерСтроки";

	
	
	ТекстЗапроса = 
	   "ВЫБРАТЬ
	   |	Товары.Номенклатура КАК Номенклатура,
	   |	Товары.Характеристика КАК Характеристика,
	   |	Товары.Серия КАК Серия,
	   |	Товары.Количество КАК Количество,
	   |	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	   |	Товары.НомерСтроки КАК НомерСтроки
	   |ПОМЕСТИТЬ Товары
	   |ИЗ
	   |	&Товары КАК Товары
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	Товары.Номенклатура КАК Номенклатура,
	   |	Товары.Характеристика КАК Характеристика,
	   |	СУММА(Товары.Количество) КАК Количество,
	   |	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры КАК ВидНоменклатуры
	   |ПОМЕСТИТЬ ТоварыДляЗапроса
	   |ИЗ
	   |	Товары КАК Товары
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	Товары.Номенклатура,
	   |	Товары.Характеристика,
	   |	Товары.Серия,
	   |	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	Серии.Номенклатура КАК Номенклатура,
	   |	Серии.Характеристика КАК Характеристика,
	   |	ВЫБОР
	   |		КОГДА Серии.Количество ЕСТЬ NULL
	   |			ТОГДА Серии.КоличествоНоменклатуры
	   |		ИНАЧЕ Серии.Количество
	   |	КОНЕЦ КАК Количество
	   |ПОМЕСТИТЬ Серии
	   |ИЗ
	   |	&Серии КАК Серии
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	Серии.Номенклатура КАК Номенклатура,
	   |	Серии.Характеристика КАК Характеристика,     
	   |	СУММА(Серии.Количество) КАК Количество
	   |ПОМЕСТИТЬ СерииДляЗапроса
	   |ИЗ
	   |	Серии КАК Серии
	   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	   |		ПО Серии.Номенклатура = УпаковкиЕдиницыИзмерения.Владелец
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	Серии.Номенклатура,
	   |	Серии.Характеристика
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ПолитикиУчетаСерий.Ссылка КАК Ссылка,
	   |	ПолитикиУчетаСерий.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	   |	ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям КАК УчитыватьСебестоимостьПоСериям,
	   |	ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки КАК УказыватьПриПланированииОтгрузки,
	   |	ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора КАК УказыватьПриПланированииОтбора,
	   |	ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчетСерийПоFEFO КАК УчетСерийПоFEFO,
	   |	ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПоФактуОтбора КАК УказыватьПоФактуОтбора,
	   |	ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриОтгрузкеВРозницу КАК УказыватьПриОтгрузкеВРозницу,
	   |	ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий КАК УчитыватьОстаткиСерий
	   |ПОМЕСТИТЬ ПолитикиУчетаСерийДляЗапроса
	   |ИЗ
	   |	Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыДляЗапроса КАК ТоварыДляЗапроса
	   |		ПО (ТоварыДляЗапроса.ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка)
	   |ГДЕ
	   |	ПолитикиУчетаСерий.Склад = &Склад
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	Товары.НомерСтроки КАК НомерСтроки,
	   |	Товары.СтатусУказанияСерий КАК СтарыйСтатусУказанияСерий,
	   |	ВЫБОР
	   |		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL
	   |			ТОГДА 0
	   |		КОГДА ПолитикиУчетаСерий.УчитыватьСебестоимостьПоСериям
	   |			ТОГДА ВЫБОР
	   |					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	   |						ТОГДА 14
	   |					ИНАЧЕ 13
	   |				КОНЕЦ
	   |		КОГДА ПолитикиУчетаСерий.УказыватьПриПланированииОтгрузки
	   |			ТОГДА ВЫБОР
	   |					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	   |						ТОГДА 10
	   |					ИНАЧЕ 9
	   |				КОНЕЦ
	   |		КОГДА ПолитикиУчетаСерий.УказыватьПриПланированииОтбора
	   |			ТОГДА ВЫБОР
	   |					КОГДА ПолитикиУчетаСерий.УчетСерийПоFEFO
	   |						ТОГДА ВЫБОР
	   |								КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	   |										И ТоварыДляЗапроса.Количество > 0
	   |									ТОГДА 6
	   |								ИНАЧЕ 5
	   |							КОНЕЦ
	   |					ИНАЧЕ ВЫБОР
	   |							КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	   |									И ТоварыДляЗапроса.Количество > 0
	   |								ТОГДА 8
	   |							ИНАЧЕ 7
	   |						КОНЕЦ
	   |				КОНЕЦ
	   |		КОГДА ПолитикиУчетаСерий.УказыватьПоФактуОтбора
	   |				И ПолитикиУчетаСерий.УказыватьПриОтгрузкеВРозницу
	   |			ТОГДА ВЫБОР
	   |					КОГДА ПолитикиУчетаСерий.УчитыватьОстаткиСерий
	   |						ТОГДА ВЫБОР
	   |								КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	   |										И ТоварыДляЗапроса.Количество > 0
	   |									ТОГДА 4
	   |								ИНАЧЕ 3
	   |							КОНЕЦ
	   |					ИНАЧЕ ВЫБОР
	   |							КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	   |									И ТоварыДляЗапроса.Количество > 0
	   |								ТОГДА 2
	   |							ИНАЧЕ 1
	   |						КОНЕЦ
	   |				КОНЕЦ
	   |		ИНАЧЕ 0
	   |	КОНЕЦ КАК СтатусУказанияСерий
	   |ПОМЕСТИТЬ Статусы
	   |ИЗ
	   |	Товары КАК Товары
	   |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыДляЗапроса КАК ТоварыДляЗапроса
	   |		ПО Товары.Номенклатура = ТоварыДляЗапроса.Номенклатура
	   |			И Товары.Характеристика = ТоварыДляЗапроса.Характеристика
	   |		ЛЕВОЕ СОЕДИНЕНИЕ СерииДляЗапроса КАК СерииДляЗапроса
	   |		ПО Товары.Номенклатура = СерииДляЗапроса.Номенклатура
	   |			И Товары.Характеристика = СерииДляЗапроса.Характеристика
	   |		ЛЕВОЕ СОЕДИНЕНИЕ ПолитикиУчетаСерийДляЗапроса КАК ПолитикиУчетаСерий
	   |		ПО (ТоварыДляЗапроса.ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка)
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	Статусы.НомерСтроки КАК НомерСтроки,
	   |	Статусы.СтатусУказанияСерий КАК СтатусУказанияСерий
	   |ИЗ
	   |	Статусы КАК Статусы
	   |ГДЕ
	   |	Статусы.СтатусУказанияСерий <> Статусы.СтарыйСтатусУказанияСерий
	   |
	   |УПОРЯДОЧИТЬ ПО
	   |	НомерСтроки";
	//<<Швецов. 26.12.2025. Розничные продажи алкоголя    	
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаполненияСтатусовУказанияСерийВыходныеИзделия()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Серия КАК Серия,
	|	Товары.Получатель КАК Получатель,
	|	Товары.Количество КАК Количество,
	|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	Товары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Назначение,
	|	Товары.Серия,
	|	Товары.Получатель,
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(Товары.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыДляЗапроса
	|ИЗ
	|	Товары КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Назначение,
	|	Товары.Серия,
	|	Товары.Получатель,
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Серии.Номенклатура,
	|	Серии.Характеристика,
	|	Серии.Назначение,
	|	Серии.Получатель,
	|	Серии.Количество КАК Количество
	|ПОМЕСТИТЬ Серии
	|ИЗ
	|	&Серии КАК Серии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Серии.Номенклатура,
	|	Серии.Характеристика,
	|	Серии.Назначение,
	|	Серии.Получатель,
	|	СУММА(Серии.Количество) КАК Количество
	|ПОМЕСТИТЬ СерииДляЗапроса
	|ИЗ
	|	Серии КАК Серии
	|
	|СГРУППИРОВАТЬ ПО
	|	Серии.Номенклатура,
	|	Серии.Характеристика,
	|	Серии.Назначение,
	|	Серии.Получатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.СтатусУказанияСерий КАК СтарыйСтатусУказанияСерий,
	|	ВЫБОР
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|			ТОГДА ВЫБОР
	|					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|						ТОГДА 14
	|					ИНАЧЕ 13
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	|							И ТоварыДляЗапроса.Количество > 0
	|						ТОГДА 10
	|					ИНАЧЕ 9
	|				КОНЕЦ
	|		КОГДА Склады.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И &Дата >= Склады.ДатаНачалаОрдернойСхемыПриОтгрузке
	|			ТОГДА 0
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчетСерийПоFEFO
	|						ТОГДА ВЫБОР
	|								КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	|										И ТоварыДляЗапроса.Количество > 0
	|									ТОГДА 6
	|								ИНАЧЕ 5
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	|									И ТоварыДляЗапроса.Количество > 0
	|								ТОГДА 8
	|							ИНАЧЕ 7
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПоФактуОтбора
	|				И &ФактОтбора
	|				И ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриОтгрузкеКомплектовДляРазборки
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|						ТОГДА ВЫБОР
	|								КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	|										И ТоварыДляЗапроса.Количество > 0
	|									ТОГДА 4
	|								ИНАЧЕ 3
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	|									И ТоварыДляЗапроса.Количество > 0
	|								ТОГДА 2
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ Статусы
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыДляЗапроса КАК ТоварыДляЗапроса
	|			ЛЕВОЕ СОЕДИНЕНИЕ СерииДляЗапроса КАК СерииДляЗапроса
	|			ПО ТоварыДляЗапроса.Номенклатура = СерииДляЗапроса.Номенклатура
	|				И ТоварыДляЗапроса.Характеристика = СерииДляЗапроса.Характеристика
	|				И ТоварыДляЗапроса.Назначение = СерииДляЗапроса.Назначение
	|				И ТоварыДляЗапроса.Получатель = СерииДляЗапроса.Получатель
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|				ПО ПолитикиУчетаСерий.Склад = Склады.Ссылка
	|			ПО (ПолитикиУчетаСерий.Склад = ТоварыДляЗапроса.Получатель)
	|				И ТоварыДляЗапроса.ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка
	|		ПО Товары.Номенклатура = ТоварыДляЗапроса.Номенклатура
	|			И Товары.Характеристика = ТоварыДляЗапроса.Характеристика
	|			И Товары.Назначение = ТоварыДляЗапроса.Назначение
	|			И Товары.Получатель = ТоварыДляЗапроса.Получатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Статусы.НомерСтроки КАК НомерСтроки,
	|	Статусы.СтатусУказанияСерий КАК СтатусУказанияСерий
	|ИЗ
	|	Статусы КАК Статусы
	|ГДЕ
	|	Статусы.СтатусУказанияСерий <> Статусы.СтарыйСтатусУказанияСерий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаполненияСтатусовУказанияСерийИнгредиенты()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Товары.Ингредиент,
	|	Товары.Серия,
	|	Товары.СтатусУказанияСерий,
	|	Товары.НомерСтроки
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.СтатусУказанияСерий КАК СтарыйСтатусУказанияСерий,
	|	ВЫБОР
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|			ТОГДА 14
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
	|			ТОГДА 10
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчетСерийПоFEFO
	|						ТОГДА 6
	|					ИНАЧЕ 8
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПоФактуОтбора
	|				И ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриОтгрузкеНаВнутренниеНужды
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|						ТОГДА 4
	|					ИНАЧЕ 2
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ Статусы
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|		ПО (ПолитикиУчетаСерий.Склад = &Склад)
	|			И (ВЫРАЗИТЬ(Товары.Ингредиент КАК Справочник.Номенклатура).ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Статусы.НомерСтроки,
	|	Статусы.СтатусУказанияСерий
	|ИЗ
	|	Статусы КАК Статусы
	|ГДЕ
	|	Статусы.СтатусУказанияСерий <> Статусы.СтарыйСтатусУказанияСерий
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статусы.НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаполненияСтатусовУказанияСерийЗамены()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Товары.ИнгредиентИсходный,
	|	Товары.ИнгредиентЗамена,
	|	Товары.СтатусУказанияСерий,
	|	Товары.НомерСтроки
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.СтатусУказанияСерий КАК СтарыйСтатусУказанияСерий,
	|	ВЫБОР
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|			ТОГДА 14
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
	|			ТОГДА 10
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчетСерийПоFEFO
	|						ТОГДА 6
	|					ИНАЧЕ 8
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПоФактуОтбора
	|				И ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриОтгрузкеНаВнутренниеНужды
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|						ТОГДА 4
	|					ИНАЧЕ 2
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерийИнгредиентаИсходный,
	|	ВЫБОР
	|		КОГДА ПолитикиУчетаСерийЗамена.ПолитикаУчетаСерий ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ПолитикиУчетаСерийЗамена.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|			ТОГДА 14
	|		КОГДА ПолитикиУчетаСерийЗамена.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
	|			ТОГДА 10
	|		КОГДА ПолитикиУчетаСерийЗамена.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерийЗамена.ПолитикаУчетаСерий.УчетСерийПоFEFO
	|						ТОГДА 6
	|					ИНАЧЕ 8
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерийЗамена.ПолитикаУчетаСерий.УказыватьПоФактуОтбора
	|				И ПолитикиУчетаСерийЗамена.ПолитикаУчетаСерий.УказыватьПриОтгрузкеНаВнутренниеНужды
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерийЗамена.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|						ТОГДА 4
	|					ИНАЧЕ 2
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерийИнгредиентаЗамена
	|ПОМЕСТИТЬ Статусы
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|		ПО (ПолитикиУчетаСерий.Склад = &Склад)
	|			И (ВЫРАЗИТЬ(Товары.ИнгредиентИсходный КАК Справочник.Номенклатура).ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерийЗамена
	|		ПО (ПолитикиУчетаСерий.Склад = &Склад)
	|			И (ВЫРАЗИТЬ(Товары.ИнгредиентЗамена КАК Справочник.Номенклатура).ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Статусы.НомерСтроки,
	|	Статусы.СтатусУказанияСерийИнгредиентаИсходный,
	|	Статусы.СтатусУказанияСерийИнгредиентаЗамена
	|ИЗ
	|	Статусы КАК Статусы
	|ГДЕ
	|	Статусы.СтатусУказанияСерийИнгредиентаИсходный <> Статусы.СтарыйСтатусУказанияСерий
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статусы.НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Проведение

//+25
// %ИзЕРП% Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("Обеспечение");
	
КонецПроцедуры

//+25
// %ИзЕРП% Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * Таблица<ИмяРегистра> - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.питВыпускБлюд") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры);
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

// %ИзЕРП%
//
Процедура ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры)
	
	ТекстЗапросаТабЧасть =
		// Приход на неордерном складе или по старым назначениям.
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ТабЧасть.Назначение КАК Назначение,
		|	ТабЧасть.КоличествоНоменклатуры КАК Количество,
		|	ИСТИНА КАК ПоГрафику,
		|	ВЫРАЗИТЬ(ТабЧасть.Ссылка.ДокументОснование КАК Документ.питПланМеню) КАК РаспоряжениеВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Блюда КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Автопередел
		|	И (НЕ ВЫБОР
		|					КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|						ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|					ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|				КОНЕЦ
		|			ИЛИ ВЫБОР
		|				КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|					ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|				ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|			КОНЕЦ > ТабЧасть.Ссылка.Дата
		|			ИЛИ ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ)
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
	
	РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
	
	ТекстЗапросаТабЧасть =
		// Сторно приходного ордера по старым назначениям.
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	-ТабЧасть.КоличествоНоменклатуры КАК Количество,
		|	ЛОЖЬ КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО КАК РаспоряжениеВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Блюда КАК ТабЧасть
		|ГДЕ
		|	ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|		КОНЕЦ <= ТабЧасть.Ссылка.Дата
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
	
	РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
	
	// << ПорталЮг, КондрашихинИА, 25.03.2024 [Распределение запасов ЕРП 2.5]
	// !!! ВАЖНО!!! !!! ВАЖНО!!! !!! ВАЖНО!!! Доработан типовой механизм распределения запасов в документах питВыпускБлюд и питПланМеню
	// Доработка: Номенклатура без рецептуры в ТЧТовары питВыпускБлюд и питПлан меню тоже ДОЛЖНА УЧАВСТВОВАТЬ В РАСПРЕДЕЛЕНИИ ЗАПАСОВ
	
	// Товары, приход запаса 
	
	ТекстЗапросаТабЧасть =
	"ВЫБРАТЬ
	|	ТабЧасть.Ссылка КАК Ссылка,
	|	ТабЧасть.Ссылка.Дата КАК Период,
	|	ТабЧасть.Номенклатура КАК Номенклатура,
	|	ТабЧасть.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
	|			ТОГДА ТабЧасть.Ссылка.Склад
	|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
	|	КОНЕЦ КАК Склад,
	|	ТабЧасть.Назначение КАК Назначение,
	|	ТабЧасть.Количество КАК Количество,
	|	ИСТИНА КАК ПоГрафику,
	|	ВЫРАЗИТЬ(ТабЧасть.Ссылка.ДокументОснование КАК Документ.питПланМеню) КАК РаспоряжениеВГрафике
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК ТабЧасть
	|ГДЕ
	|	(НЕ ВЫБОР
	|					КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
	|						ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|					ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
	|				КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
	|					ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	|				ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
	|			КОНЕЦ > ТабЧасть.Ссылка.Дата
	|			ИЛИ ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ)
	|	И ТабЧасть.Рецептура = ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка)
	|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
	|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
	
	РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);

	
	// Товары, приход запаса, сторно
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	-ТабЧасть.Количество КАК Количество,
		|	ЛОЖЬ КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО КАК РаспоряжениеВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Товары КАК ТабЧасть
		|ГДЕ
		|	ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|		КОНЕЦ <= ТабЧасть.Ссылка.Дата
		|	И ТабЧасть.Рецептура = ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка)
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
	
		РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
		
		//>> Портал-Юг, Кондрашихин, 2024.04.26
	
		ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		ИНАЧЕ ТабЧасть.Назначение
		|	КОНЕЦ КАК Назначение,
		|	ТабЧасть.КоличествоНоменклатуры КАК Количество,
		|	ТабЧасть.Ссылка.ДокументОснование КАК Заказ,
		|	ТабЧасть.Ссылка.Дата КАК ДатаПоступления,
		|	ИСТИНА КАК ДоступенДляРасхода,
		|	ИСТИНА КАК ПоГрафику,
		|	ТабЧасть.Ссылка.ДокументОснование КАК РаспоряжениеВГрафике,
		|	ТабЧасть.КоличествоНоменклатуры КАК КоличествоВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Блюда КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Автопередел
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|		КОНЕЦ <= ТабЧасть.Ссылка.Дата
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
		
		РаспределениеЗапасовДвижения.ЗапланироватьПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);

		
		//<< Портал-Юг, Кондрашихин, 2024.04.26 [Обновление ERP 2.5] // Описание: 
	// !!! ВАЖНО!!! !!! ВАЖНО!!! !!! ВАЖНО!!! Доработан типовой механизм распределения запасов в документах питВыпускБлюд и питПланМеню
	// Доработка: Номенклатура без рецептуры в ТЧТовары питВыпускБлюд и питПлан меню тоже ДОЛЖНА УЧАВСТВОВАТЬ В РАСПРЕДЕЛЕНИИ ЗАПАСОВ

		
		// Товары, отражение в графике
		ТекстЗапросаТабЧасть =
			"ВЫБРАТЬ
			|	ТабЧасть.Ссылка КАК Ссылка,
			|	ТабЧасть.Ссылка.Дата КАК Период,
			|	ТабЧасть.Номенклатура КАК Номенклатура,
			|	ТабЧасть.Характеристика КАК Характеристика,
			|	ВЫБОР
			|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
			|			ТОГДА ТабЧасть.Ссылка.Склад
			|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
			|	КОНЕЦ КАК Склад,
			|	ВЫБОР
			|		КОГДА ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|		ИНАЧЕ ТабЧасть.Назначение
			|	КОНЕЦ КАК Назначение,
			|	ТабЧасть.Количество КАК Количество,
			|	ТабЧасть.Ссылка.ДокументОснование КАК Заказ,
			|	ТабЧасть.Ссылка.Дата КАК ДатаПоступления,
			|	ИСТИНА КАК ДоступенДляРасхода,
			|	ИСТИНА КАК ПоГрафику,
			|	ТабЧасть.Ссылка.ДокументОснование КАК РаспоряжениеВГрафике,
			|	ТабЧасть.Количество КАК КоличествоВГрафике
			|ИЗ
			|	Документ.питВыпускБлюд.Товары КАК ТабЧасть
			|ГДЕ
			|	ВЫБОР
			|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
			|				ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
			|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
			|				ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
			|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
			|		КОНЕЦ <= ТабЧасть.Ссылка.Дата
			|	И ТабЧасть.Рецептура = ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка)
			|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
			|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
	
		РаспределениеЗапасовДвижения.ЗапланироватьПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
		
		// Товары, закрываем график в 0, что бы не было зависщих поступлений в ожидании поставки
			ТекстЗапросаТабЧасть =
			"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ТабЧасть.Назначение КАК Назначение,
		|	ТабЧасть.ПЛ_Передано - ТабЧасть.Количество КАК Количество,
		|	ИСТИНА КАК ПоГрафику,
		|	ВЫРАЗИТЬ(ТабЧасть.Ссылка.ДокументОснование КАК Документ.питПланМеню) КАК РаспоряжениеВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Товары КАК ТабЧасть
		|ГДЕ
		|	(НЕ ВЫБОР
		|					КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|						ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|					ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|				КОНЕЦ
		|			ИЛИ ВЫБОР
		|				КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|					ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|				ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|			КОНЕЦ > ТабЧасть.Ссылка.Дата
		|			ИЛИ ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ)
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)
		| И ТабЧасть.ПЛ_Передано - ТабЧасть.Количество <> 0
		| И ТабЧасть.ПЛ_Передано <> 0
		|";

			РаспределениеЗапасовДвижения.ОтменитьЗапланированныйПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);

		//>> Портал-Юг, Кондрашихин, 2024.04.26


КонецПроцедуры

// %ИзЕРП% Процедура устанавливает параметры запросов.
//
// Параметры:
//  Запрос			 - Запрос - Объект запроса.
//  ДокументСсылка	 - ДокументСсылка - Ссылка на документ.
//
Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыпускБлюд.Дата            КАК Период,
		|	ВыпускБлюд.Организация     КАК Организация,
		|	ВыпускБлюд.Подразделение   КАК Подразделение,
		|	ВыпускБлюд.Дата        КАК ДатаПотребности,
		|	//ВыпускБлюд.ДатаПлан        КАК НачатьНеРанее
		|	ВыпускБлюд.Склад           КАК ЦеховаяКладовая,
		|	ВыпускБлюд.СкладПолучатель КАК СкладРеализации,
		|	ВыпускБлюд.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.питВыпускБлюд КАК ВыпускБлюд
		|ГДЕ
		|	ВыпускБлюд.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",           Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",      Реквизиты.Организация);
	Запрос.УстановитьПараметр("Подразделение",    Реквизиты.Подразделение);
	Запрос.УстановитьПараметр("ДатаПотребности",  Реквизиты.ДатаПотребности);
	//Запрос.УстановитьПараметр("НачатьНеРанее",    Реквизиты.НачатьНеРанее);
	Запрос.УстановитьПараметр("СкладРеализации",  ?(ЗначениеЗаполнено(Реквизиты.СкладРеализации),Реквизиты.СкладРеализации, Реквизиты.ЦеховаяКладовая));
	Запрос.УстановитьПараметр("ДокументОснование",  Реквизиты.ДокументОснование);
	
	Запрос.УстановитьПараметр("ПустаяСсылкаНазначение",    Справочники.Назначения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяСсылкаСклад",         Справочники.Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяСсылкаПодразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
КонецПроцедуры

// %ИзЕРП%
//
Функция ТекстыЗапросаРаспределениеЗапасовДвиженияДляОбновленияИБ() Экспорт
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений();
	Регистры = Неопределено;
	
	ТекстЗапросаТабЧасть =
		// Приход на неордерном складе или по старым назначениям.
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ТабЧасть.Назначение КАК Назначение,
		|	ТабЧасть.КоличествоНоменклатуры КАК Количество,
		|	ИСТИНА КАК ПоГрафику,
		|	ВЫРАЗИТЬ(ТабЧасть.Ссылка.ДокументОснование КАК Документ.питПланМеню) КАК РаспоряжениеВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Блюда КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Автопередел
		|	И (НЕ ВЫБОР
		|					КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|						ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|					ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|				КОНЕЦ
		|			ИЛИ ВЫБОР
		|				КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|					ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|				ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|			КОНЕЦ > ТабЧасть.Ссылка.Дата
		|			ИЛИ ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ)
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";


	
	РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
	
		// << ПорталЮг, КондрашихинИА, 25.03.2024 [Распределение запасов ЕРП 2.5]
			// !!! ВАЖНО!!! !!! ВАЖНО!!! !!! ВАЖНО!!! Доработан типовой механизм распределения запасов в документах питВыпускБлюд и питПланМеню
			// Доработка: Номенклатура без рецептуры в ТЧТовары питВыпускБлюд и питПлан меню тоже ДОЛЖНА УЧАВСТВОВАТЬ В РАСПРЕДЕЛЕНИИ ЗАПАСОВ
			// Данный запрос при выполнении обработчика обновления заполнит регистр накопления Распределение запасов -движения корректно 
			// При необходимост и при обновлении - доработать / изменить под новую архитектуру регистров
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ТабЧасть.Назначение КАК Назначение,
		|	ТабЧасть.Количество КАК Количество,
		|	ИСТИНА КАК ПоГрафику,
		|	ВЫРАЗИТЬ(ТабЧасть.Ссылка.ДокументОснование КАК Документ.питПланМеню) КАК РаспоряжениеВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Товары КАК ТабЧасть
		|ГДЕ
		|	(НЕ ВЫБОР
		|					КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|						ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|					ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|				КОНЕЦ
		|			ИЛИ ВЫБОР
		|				КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|					ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|				ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|			КОНЕЦ > ТабЧасть.Ссылка.Дата
		|			ИЛИ ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ)
		|	И ТабЧасть.Рецептура = ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка)
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
	
	
		РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
	// >> ПорталЮг, КондрашихинИА, 25.03.2024 
	
	ТекстЗапросаТабЧасть =
		// Сторно приходного ордера по старым назначениям.
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	-ТабЧасть.КоличествоНоменклатуры КАК Количество,
		|	ЛОЖЬ КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО КАК РаспоряжениеВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Блюда КАК ТабЧасть
		|ГДЕ
		|	ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|		КОНЕЦ <= ТабЧасть.Ссылка.Дата
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
		
	
	
	РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
	
	
	// << ПорталЮг, КондрашихинИА, 25.03.2024 [Распределение запасов ЕРП 2.5]
			// !!! ВАЖНО!!! !!! ВАЖНО!!! !!! ВАЖНО!!! Доработан типовой механизм распределения запасов в документах питВыпускБлюд и питПланМеню
			// Доработка: Номенклатура без рецептуры в ТЧТовары питВыпускБлюд и питПлан меню тоже ДОЛЖНА УЧАВСТВОВАТЬ В РАСПРЕДЕЛЕНИИ ЗАПАСОВ
			// Данный запрос при выполнении обработчика обновления заполнит регистр накопления Распределение запасов -движения корректно 
			// При необходимост и при обновлении - доработать / изменить под новую архитектуру регистров	
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	-ТабЧасть.Количество КАК Количество,
		|	ЛОЖЬ КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО КАК РаспоряжениеВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Товары КАК ТабЧасть
		|ГДЕ
		|	ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|		КОНЕЦ <= ТабЧасть.Ссылка.Дата
		|	И ТабЧасть.Рецептура = ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка)
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
	
	
		РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
		
	// >> ПорталЮг, КондрашихинИА, 25.03.2024 
	
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|			ТОГДА ТабЧасть.Ссылка.Склад
		|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
		|	КОНЕЦ КАК Склад,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		ИНАЧЕ ТабЧасть.Назначение
		|	КОНЕЦ КАК Назначение,
		|	ТабЧасть.КоличествоНоменклатуры КАК Количество,
		|	ТабЧасть.Ссылка.ДокументОснование КАК Заказ,
		|	ТабЧасть.Ссылка.Дата КАК ДатаПоступления,
		|	ИСТИНА КАК ДоступенДляРасхода,
		|	ИСТИНА КАК ПоГрафику,
		|	ТабЧасть.Ссылка.ДокументОснование КАК РаспоряжениеВГрафике,
		|	ТабЧасть.КоличествоНоменклатуры КАК КоличествоВГрафике
		|ИЗ
		|	Документ.питВыпускБлюд.Блюда КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Автопередел
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
		|				ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
		|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
		|		КОНЕЦ <= ТабЧасть.Ссылка.Дата
		|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
	
	РаспределениеЗапасовДвижения.ЗапланироватьПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);

		// << ПорталЮг, КондрашихинИА, 25.03.2024 [Распределение запасов ЕРП 2.5]
			// !!! ВАЖНО!!! !!! ВАЖНО!!! !!! ВАЖНО!!! Доработан типовой механизм распределения запасов в документах питВыпускБлюд и питПланМеню
			// Доработка: Номенклатура без рецептуры в ТЧТовары питВыпускБлюд и питПлан меню тоже ДОЛЖНА УЧАВСТВОВАТЬ В РАСПРЕДЕЛЕНИИ ЗАПАСОВ
			// Данный запрос при выполнении обработчика обновления заполнит регистр накопления Распределение запасов -движения корректно 
			// При необходимост и при обновлении - доработать / изменить под новую архитектуру регистров
	ТекстЗапросаТабЧасть =
			"ВЫБРАТЬ
			|	ТабЧасть.Ссылка КАК Ссылка,
			|	ТабЧасть.Ссылка.Дата КАК Период,
			|	ТабЧасть.Номенклатура КАК Номенклатура,
			|	ТабЧасть.Характеристика КАК Характеристика,
			|	ВЫБОР
			|		КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
			|			ТОГДА ТабЧасть.Ссылка.Склад
			|		ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель
			|	КОНЕЦ КАК Склад,
			|	ВЫБОР
			|		КОГДА ТабЧасть.Назначение.ДвиженияПоСкладскимРегистрам = ЛОЖЬ
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|		ИНАЧЕ ТабЧасть.Назначение
			|	КОНЕЦ КАК Назначение,
			|	ТабЧасть.Количество КАК Количество,
			|	ТабЧасть.Ссылка.ДокументОснование КАК Заказ,
			|	ТабЧасть.Ссылка.Дата КАК ДатаПоступления,
			|	ИСТИНА КАК ДоступенДляРасхода,
			|	ИСТИНА КАК ПоГрафику,
			|	ТабЧасть.Ссылка.ДокументОснование КАК РаспоряжениеВГрафике,
			|	ТабЧасть.Количество КАК КоличествоВГрафике
			|ИЗ
			|	Документ.питВыпускБлюд.Товары КАК ТабЧасть
			|ГДЕ
			|	ВЫБОР
			|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
			|				ТОГДА ТабЧасть.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
			|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА ТабЧасть.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСоСписанием))
			|				ТОГДА ТабЧасть.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
			|			ИНАЧЕ ТабЧасть.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
			|		КОНЕЦ <= ТабЧасть.Ссылка.Дата
			|	И ТабЧасть.Рецептура = ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка)
			|	И НЕ ТабЧасть.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.питПланМеню.ПустаяСсылка)
			|	И ТИПЗНАЧЕНИЯ(ТабЧасть.Ссылка.ДокументОснование) = ТИП(Документ.питПланМеню)";
	
	РаспределениеЗапасовДвижения.ЗапланироватьПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
		// >> ПорталЮг, КондрашихинИА, 25.03.2024 [Распределение запасов ЕРП 2.5]
			
	
	Возврат ТекстыЗапроса;
	
КонецФункции


#КонецОбласти

#Область Назначения

// %ИзЕРП% Инициализирует параметры, обслуживающие выбор назначений в формах документа.
// 
//  Возвращаемое значение:
//  Структура - структура параметров, см. Справочники.Назначения.МакетФормыВыбораНазначений().
//
Функция МакетФормыВыбораНазначений() Экспорт
	
	МакетФормы = Справочники.Назначения.МакетФормыВыбораНазначений();
	
	// Шаблон для выходных изделий
	ШаблонНазначения = Справочники.Назначения.ДобавитьШаблонНазначений(МакетФормы, "Объект.Товары.Назначение");
	
	// Потребности в выпущенной продукции на складе.
	ОписаниеКолонок = Справочники.Назначения.ДобавитьОписаниеКолонок(МакетФормы, "ОбеспечениеЗаказовВсеСклады", Истина, "Объект.Товары.Назначение", "ТоварыПотребность");
	ОписаниеКолонок.Колонки.НайтиПоЗначению("Потребность").Пометка = Истина;
	ОписаниеКолонок.УсловиеИспользования = "Объект.Товары.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)";
	
	ОписаниеКолонок.ПутиКДанным.Номенклатура     = "Объект.Товары.Номенклатура";
	ОписаниеКолонок.ПутиКДанным.Характеристика   = "Объект.Товары.Характеристика";
	
	// Шаблон для побочных изделий
	ШаблонНазначения = Справочники.Назначения.ДобавитьШаблонНазначений(МакетФормы, "Объект.ПобочныеИзделия.Назначение");
	
	// Потребности в побочных изделиях на складе.
	ОписаниеКолонок = Справочники.Назначения.ДобавитьОписаниеКолонок(МакетФормы, "ОбеспечениеЗаказовВсеСклады", Истина, "Объект.ПобочныеИзделия.Назначение", "ПобочныеИзделияПотребность");
	ОписаниеКолонок.Колонки.НайтиПоЗначению("Потребность").Пометка = Истина;
	ОписаниеКолонок.УсловиеИспользования = "Объект.ПобочныеИзделия.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)";
	
	ОписаниеКолонок.ПутиКДанным.Номенклатура     = "Объект.ПобочныеИзделия.Номенклатура";
	ОписаниеКолонок.ПутиКДанным.Характеристика   = "Объект.ПобочныеИзделия.Характеристика";
	
	// Шаблон
	ОписаниеКолонок = Справочники.Назначения.ДобавитьОписаниеКолонок(МакетФормы, "ОбеспечениеЗаказовВсеСклады", Истина, "Объект.Товары.НазначениеИнгредиентов", "ТоварыПотребность");
	ШаблонНазначения = Справочники.Назначения.ДобавитьШаблонНазначений(МакетФормы, "Объект.Товары.НазначениеИнгредиентов");
	ОписаниеКолонок.Колонки.НайтиПоЗначению("ВНаличии").Пометка = Истина;
	ОписаниеКолонок.ПутиКДанным.Номенклатура     = "Объект.Товары.Номенклатура";
	ОписаниеКолонок.ПутиКДанным.Характеристика   = "Объект.Товары.Характеристика";
	
	Возврат МакетФормы;
	
КонецФункции

#КонецОбласти

//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда     // --- 26.07.2024 Адель перенесено в начало модуля
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И (ЗначениеРазрешено(Склад) И ВЫБОР 
	|		КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСПеремещением) 
	|			ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСРозничнойРеализацией) 
	|		ТОГДА ЗначениеРазрешено(СкладПолучатель) 
	|		ИНАЧЕ Истина 
	|	КОНЕЦ)
	|	И ЗначениеРазрешено(Подразделение)
	|	И ВЫБОР 
	|		КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ВыпускПродукцииСРозничнойРеализацией) 
	|		ТОГДА ЗначениеРазрешено(КассаККМ) 
	|		ИНАЧЕ ИСТИНА 
	|	КОНЕЦ
	|";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом
//#КонецЕсли                                                                     // --- 26.07.2024 Адель перенесено в конец модуля

// Функция получает результат запроса по связанным с передаваемым планом-меню выпускам блюд.
//
// Параметры:
//  ДокументОснование	 - ДокументСсылка.питПланМеню - Ссылка на документ основание.
// 
// Возвращаемое значение:
//  РезультатЗапроса - РезультатЗапроса
//
Функция РезультатЗапросаСвязанныеВыпускиБлюд(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	питВыпускБлюд.Ссылка КАК ВыпускБлюд,
	|	питВыпускБлюд.Представление КАК Представление,
	|	ВЫРАЗИТЬ(питВыпускБлюд.ДокументОснование КАК Документ.питПланМеню).Представление КАК ПредставлениеПланаМеню
	|ИЗ
	|	Документ.питВыпускБлюд КАК питВыпускБлюд
	|ГДЕ
	|	питВыпускБлюд.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Возврат Запрос.Выполнить();
	
КонецФункции

//+25
#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Документы.питВыпускБлюд.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.5.5";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3fbdcbcc-5f64-40b8-bcf1-e17c37f7126d");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.питВыпускБлюд.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет реквизит СтавкаНДС с типом СправочникСсылка.СтавкиНДС.';
	|en = 'Fills in СтавкаНДС attribute with СправочникСсылка.СтавкиНДС type.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.питВыпускБлюд.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.СтавкиНДС.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Документы.питВыпускБлюд.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Документы.питВыпускБлюд.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.СтавкиНДС.ЗаполнитьЭлементыНачальнымиДанными";
	НоваяСтрока.Порядок = "Любой";
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Документ.питВыпускБлюд";
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Ссылка.Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	питВыпускБлюд.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.питВыпускБлюд КАК питВыпускБлюд
	|ГДЕ
	|	(ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
	|		ГДЕ
	|			питВыпускБлюд.Ссылка = питВыпускБлюдТовары.Ссылка
	|			И (питВыпускБлюдТовары.УдалитьСтавкаНДС <> &ПустаяСтавкаНДС
	|			И питВыпускБлюдТовары.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))
	|	)";
	
	УчетНДСЛокализация.УстановитьПараметрЗапросаПустаяСтавкаНДСПеречислением(Запрос);
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Для Каждого Документ Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Документ.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ДокументОбъект = Документ.Ссылка.ПолучитьОбъект(); // ДокументОбъект
			
			ОбъектИзменен = Ложь;
			Если ДокументОбъект <> Неопределено Тогда
				
				МассивТЧ = Новый Массив();
				МассивТЧ.Добавить("Товары");
				
				УчетНДСЛокализация.ЗаполнитьКолонкуТЧСтавкаНДС(ДокументОбъект, МассивТЧ, ОбъектИзменен);
				
			КонецЕсли;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Документ.Ссылка);
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Документ.Ссылка);
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

// %ИзЕРП%
//
Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

#КонецОбласти
//-25

//+25
#Область ЗаполнениеПоСтатистике

// Формирует описание реквизитов объекта, заполняемых по статистике их использования.
//
// Параметры:
//  ОписаниеРеквизитов - Структура - описание реквизитов, для которых необходимо получить значения по статистике
//               (см. функцию ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов)
//
Процедура ЗадатьОписаниеЗаполняемыхРеквизитовПоСтатистике(ОписаниеРеквизитов) Экспорт
	
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов, "Организация, Подразделение");
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Ответственный";
	
КонецПроцедуры

#КонецОбласти
//-25

// --- 26.07.2024 Адель перенесено в конец модуля
#КонецЕсли



