//!!!
//!!!
//!!!
// << КОНТРОЛЬ!!!!! Изменена длина НОМЕРА документа!

//<<Портал-Юг, Давиденко 2019.02.13 [4.2.3 Вид операции «Заборный лист» в документе «Выпуск блюд»]
// Добавлен реквизит ПЛ_Номенклатура, настроены параметры выбора Отбор.ТипНоменклатуры(Услуга)
// В ТЧ Товары Добавлены реквизиты:
// * ПЛ_Передано
// * ПЛ_Возвращено
// * ПЛ_ВремяПриготовления
// Добавлен реквизит объекта - ПЛ_ХозяйственнаяОперация, дублирующий хозяйственную операцию для возможности расширения видов операций без многочисленных изменений типового кода
// В реквизит ХозяйственнаяОперация дублируются значения из реквизита ПЛ_ХозяйственнаяОперация
// Для вида операции ПЛ_ЗаборныйЛист реквизит ХозяйственнаяОперация устанавливается в значение ВыпускПродукцииСРозничнойРеализацией
// Типовой реквизит на форме скрыт
// Реквизит ПЛ_ХозяйственнаяОперация добавлен на форму динамически.
//<<Портал-Юг, Давиденко 2019.02.19 [4.2.7 Нулевая цена и аналитика продаж в отчёте о розничных продажах и выпуске блюд]
// * ПЛ_Договор
//>>Портал-Юг, Давиденко 2019.02.19
//>>Портал-Юг, Давиденко 2019.02.13

Перем времФункциональнаяОпцияВозвратнаяТара; /// заменено выражение ПолучитьФункциональнуюОпцию("ИспользоватьВозвратнуюТару")
											 /// Если не будем испольховать возвратную тару то просто удалить все 
											 /// Если будем то вернуть


//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ
////
Процедура ЗаполнитьДокументНаОснованииПланаМеню(Знач ДокументОснование, Знач СУчетомПроизведенных = Ложь)
	
	ФормироватьДокументыПроизводства22 = Константы.питФормироватьДокументыПроизводства22.Получить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	питПланМеню.Ссылка КАК ДокументОснование,
	|	питПланМеню.Организация,
	|	питПланМеню.Подразделение,
	|	питПланМеню.Валюта,
	|	питПланМеню.КурсКонвертации,
	|	питПланМеню."+?(ФормироватьДокументыПроизводства22, "ЦеховаяКладовая", "Склад")+" КАК Склад,
	|	питПланМеню.СкладРеализации КАК СкладПолучатель,
	|	питПланМеню.ТипЦен,
	|	питПланМеню.СуммаДокумента,
	|	питПланМеню.РежимИспользованияАналогов,
	|	питПланМеню.РазрешитьНедовложения,
	|	питПланМеню.ВидПроизводства,
	|	питПланМеню.УчитыватьОстаткиБлюдНаСкладе,
	|	питПланМеню.ПроцентНаценки,
	|	питПланМеню.РасчетСебестоимости,
	|	питПланМеню.НеИспользоватьСезонныеПроценты,
	|	питПланМеню.ИсполнительТрудозатрат,
	|	питПланМеню.Товары.(
	|		Номенклатура,
	//<<Портал-Юг, Давиденко 2019.02.19 [4.2.7 Нулевая цена и аналитика продаж в отчёте о розничных продажах и выпуске блюд]
	|		НомерСтроки,
	//>>Портал-Юг, Давиденко 2019.02.19
	|		Характеристика,
	|		КоличествоУпаковок,
	|		Количество,
	|		Упаковка,
	|		Себестоимость,
	|		ПроцентНаценки,
	|		Цена,
	|		ЦенаЗаЕдиницуУдадлить,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		СуммаВсего,
	|		Характеристика,
	|		Рецептура,
	|		СкидкаНаТовар,
	|		ПроцентСкидки,
	|		ПроцентСкидкиСтроки,
	|		СуммаСкидки,
	|		СуммаСкидкиСтроки,
	|		ИдентификаторСтроки,
	|		Назначение,
	|		НазначениеИнгредиентов,
	|		ИзмененФактБлюда
	|	),
	|	питПланМеню.Блюда.(
	|		ИдентификаторСтроки,
	|		Номенклатура,
	|		Характеристика,
	|		Назначение,
	|		Рецептура,
	|		Автопередел,
	|		КоличествоУпаковокНоменклатуры,
	|		УпаковкаНоменклатуры,
	|		КоличествоНоменклатуры,
	|		СтатьяКалькуляции,
	|		ИзмененФактБлюда,
	|		Порядок
	|	),
	|	питПланМеню.Ингредиенты.(
	|		Ингредиент,
	|		Характеристика,
	|		Назначение,
	|		ИдентификаторБлюда,
	|		УпаковкаИнгредиента,
	|		КоличествоУпаковокИнгредиентаНорма,
	|		КоличествоУпаковокИнгредиентаФакт,
	|		ИзАвтопеределов,
	|		КоличествоИнгредиентаНорма,
	|		КоличествоИнгредиентаФакт,
	|		РецептураАвтопередела,
	|		Специя,
	|		ЗапретитьЗамены,
	|		СтатьяКалькуляции,
	|		СезонныйПроцент,
	|		Себестоимость,
	|		СпособУчетаНДС,
	|		ИзмененФакт
	|	),
	|	питПланМеню.Замены.(
	|		Ссылка,
	|		НомерСтроки,
	|		Блюдо,
	|		ХарактеристикаБлюда,
	|		Рецептура,
	|		Автопередел,
	|		ИнгредиентИсходный,
	|		ХарактеристикаИнгредиентаИсходного,
	|		НазначениеИнгредиентаИсходного,
	|		КоличествоИнгредиентаИсходный,
	|		КоличествоУпаковокИнгредиентаИсходный,
	|		УпаковкаИнгредиентаИсходный,
	|		ИнгредиентЗамена,
	|		ХарактеристикаИнгредиентаЗамена,
	|		НазначениеИнгредиентаЗамена,
	|		КоличествоИнгредиентаЗамена,
	|		КоличествоУпаковокИнгредиентаЗамена,
	|		УпаковкаИнгредиентаЗамена,
	|		СчетУчета,
	|		ОтражениеВУСН,
	|		ДокументОприходования,
	|		Себестоимость,
	|		СпособУчетаНДС,
	|		СтатьяКалькуляции
	|	),
	|	питПланМеню.Трудозатраты.(
	|		Ссылка,
	|		НомерСтроки,
	|		ИдентификаторБлюда,
	|		Подразделение,
	|		ВидРабот,
	|		Количество,
	|		СтатьяКалькуляции
	|	),
	|	питПланМеню.ПобочныеИзделия.(
	|		Ссылка,
	|		НомерСтроки,
	|		ИдентификаторБлюда,
	|		Подразделение,
	|		Получатель,
	|		Номенклатура,
	|		Характеристика,
	|		Серия,
	|		СтатусУказанияСерий,
	|		КоличествоУпаковок,
	|		Количество,
	|		Упаковка,
	|		Цена,
	|		Сумма,
	|		СтатьяКалькуляции,
	|		Назначение
	|	)
	|ИЗ
	|	Документ.питПланМеню КАК питПланМеню
	|ГДЕ
	|	питПланМеню.Ссылка = &ДокументОснование";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	//<<Портал-Юг, Давиденко 2019.02.19 [4.2.7 Нулевая цена и аналитика продаж в отчёте о розничных продажах и выпуске блюд]
	// запрос не расширить малыми потерями, поэтому добавим колонку "Договор" в отдельной процедуре и загрузим ТЗ в Документ
	//Товары.Загрузить(Выборка.Товары.Выгрузить());
	ТЗТовары = Выборка.Товары.Выгрузить();
	ПЛ_Сервер.ДополнитьТаблицуТоварыДоговором(ТЗТовары);
	Товары.Загрузить(ТЗТовары);
	//>>Портал-Юг, Давиденко 2019.02.19
	Блюда.Загрузить(Выборка.Блюда.Выгрузить());
	Ингредиенты.Загрузить(Выборка.Ингредиенты.Выгрузить());
	Замены.Загрузить(Выборка.Замены.Выгрузить());
	Трудозатраты.Загрузить(Выборка.Трудозатраты.Выгрузить());
	ПобочныеИзделия.Загрузить(Выборка.ПобочныеИзделия.Выгрузить());
	
	Если ЗначениеЗаполнено(Выборка.СкладПолучатель) И НЕ (Выборка.Склад = Выборка.СкладПолучатель) Тогда
		ЭтотОбъект.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСПеремещением;
	КонецЕсли;
	
	Если СУчетомПроизведенных Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	питПланМенюТовары.Номенклатура КАК Номенклатура,
		|	питПланМенюТовары.Характеристика КАК Характеристика,
		|	питПланМенюТовары.Упаковка КАК Упаковка,
		|	питПланМенюТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	питПланМенюТовары.Количество КАК Количество
		|ПОМЕСТИТЬ втПлан
		|ИЗ
		|	Документ.питПланМеню.Товары КАК питПланМенюТовары
		|ГДЕ
		|	питПланМенюТовары.Ссылка = &ДокументОснование
		|
		|;
		|
		|ВЫБРАТЬ
		|	питВыпускБлюдТовары.Номенклатура,
		|	питВыпускБлюдТовары.Характеристика,
		|	питВыпускБлюдТовары.Упаковка,
		|	питВыпускБлюдТовары.КоличествоУпаковок,
		|	питВыпускБлюдТовары.Количество
		|ПОМЕСТИТЬ втФакт
		|ИЗ
		|	Документ.питВыпускБлюд.Товары КАК питВыпускБлюдТовары
		|ГДЕ
		|	питВыпускБлюдТовары.Ссылка.Проведен
		|	И питВыпускБлюдТовары.Ссылка.ДокументОснование = &ДокументОснование
		|";
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаДельта = питПерепланирование.РазностьТаблицТоваровЗапрос(Запрос, "втФакт", "втПлан",,Истина);
		
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика");
		СтрокиУдалить = Новый Массив;
		КэшированныеЗначенияУпаковок = Неопределено;
		Для каждого СтрокаДельта Из ТаблицаДельта Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДельта);
			НайденныеСтроки = Товары.НайтиСтроки(СтруктураПоиска);
			Для каждого ТекущаяСтрока Из НайденныеСтроки Цикл
				Если СтрокаДельта.Количество <= 0 Тогда
					СтрокиУдалить.Добавить(ТекущаяСтрока);
					Продолжить;
				КонецЕсли;
				Если ТекущаяСтрока.Количество >= СтрокаДельта.Количество Тогда
					ТекущаяСтрока.Количество = СтрокаДельта.Количество;
					ТекущаяСтрока.КоличествоУпаковок = СтрокаДельта.Количество * питОбщегоНазначения.ПолучитьКоэффициентУпаковки(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Упаковка, КэшированныеЗначенияУпаковок);
				КонецЕсли;
				СтрокаДельта.Количество = СтрокаДельта.Количество - ТекущаяСтрока.Количество;
			КонецЦикла;
		КонецЦикла;
		Для каждого ТекущаяСтрокаУдалить Из СтрокиУдалить Цикл
			Товары.Удалить(ТекущаяСтрокаУдалить);
		КонецЦикла;
	КонецЕсли;
	
	//+ИзменениеФактаВПроизводстве
	// Установка режима по норме или по факту в зависимости от того, были ли изменены блюда в плане-меню.
	ИзмененыБлюда = питИзменениеФактаВПроизводстве.ЕстьИзмененныеБлюдаТовары(Блюда, Товары);
	РежимРасчетаСписанияВПроизводство = ?(ИзмененыБлюда, Перечисления.питРежимыРасчетаСписанияВПроизводство.ПоФакту, Перечисления.питРежимыРасчетаСписанияВПроизводство.ПоНорме);
	//-ИзменениеФактаВПроизводстве
	
	// +питПриоритетыПриготовления
	питПриоритетыПриготовления.СортироватьТабличнуюЧастьОбъектаПоПриоритетуПриготовления(ЭтотОбъект, "Товары", Склад);
	// -питПриоритетыПриготовления
	
	Если СУчетомПроизведенных Тогда
		ЗаполнитьПроизводства(Истина);
	КонецЕсли;
	
	ЭтотОбъект.Комментарий = "Выпуск создан на основании документа План-меню: <"+ДокументОснование+">";
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииТиповыхДокументов(Знач МассивДокументовОснований)
	
	Если НЕ МассивДокументовОснований.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснованиеГлавный = МассивДокументовОснований[0];
	
	ИмяДокументаВнутреннееПотребление = питОбратнаяСовместимостьПовтИсп.ИмяДокументаВнутреннееПотребление();
	
	СпособРасчетаРецептурыПоАктуальной= (питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("СпособРасчетаРецептур") = Перечисления.питСпособРасчетаРецептур.ПоАктуальнойРецептуре);
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДокОснование.Ссылка КАК ДокументОснование,
	|	ДокОснование.Организация КАК Организация,
	|	ДокОснование.Подразделение КАК Подразделение,
	|	ДокОснование.Склад КАК Склад,
	|	ДокОснование.Комментарий КАК Комментарий,
	|	ДокОснование.Автор КАК Ответственный,
	|	НЕОПРЕДЕЛЕНО КАК СкладПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК ЦенаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК ТипЦен,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	НЕОПРЕДЕЛЕНО КАК КассаККМ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДокОснование
	|ГДЕ
	|	ДокОснование.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧастьТовары.Номенклатура КАК Номенклатура,
	|	ТабличнаяЧастьТовары.Характеристика КАК Характеристика,
	|	ТабличнаяЧастьТовары.Серия КАК Серия,
	|	ТабличнаяЧастьТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	СУММА(ТабличнаяЧастьТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ТабличнаяЧастьТовары.Количество) КАК Количество,
	|	ТабличнаяЧастьТовары.Упаковка КАК Упаковка,
	|	ТабличнаяЧастьТовары.Номенклатура.питВидНоменклатуры КАК питВидНоменклатуры,
	|	ЗНАЧЕНИЕ(Документ.питРецептура.ПустаяСсылка) КАК Рецептура
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТабличнаяЧастьТовары
	|ГДЕ
	|	ТабличнаяЧастьТовары.Ссылка В (&МассивДокументовОснований)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабличнаяЧастьТовары.Номенклатура,
	|	ТабличнаяЧастьТовары.Характеристика,
	|	ТабличнаяЧастьТовары.Упаковка,
	|	ТабличнаяЧастьТовары.Номенклатура.питВидНоменклатуры,
	|	ТабличнаяЧастьТовары.Серия,
	|	ТабличнаяЧастьТовары.СтатусУказанияСерий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧастьСерии.Серия КАК Серия,
	|	ТабличнаяЧастьСерии.Количество КАК Количество,
	|	ТабличнаяЧастьСерии.Номенклатура КАК Номенклатура,
	|	ТабличнаяЧастьСерии.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
	|ПОМЕСТИТЬ втСерии
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Серии КАК ТабличнаяЧастьСерии
	|ГДЕ
	|	ТабличнаяЧастьСерии.Ссылка В (&МассивДокументовОснований)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.питВидНоменклатуры КАК питВидНоменклатуры,
	|	втТовары.Серия КАК Серия,
	|	втТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	втТовары.Рецептура КАК Рецептура,
	|	ЕСТЬNULL(втСерии.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияТЧ,
	|	ЕСТЬNULL(втСерии.Количество, 0) КАК СерияКоличествоТЧ,
	|	ВЫБОР
	|		КОГДА втСерии.Серия ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СерияВТЧ
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСерии КАК втСерии
	|		ПО втТовары.Номенклатура = втСерии.Номенклатура
	|			И втТовары.Характеристика = втСерии.Характеристика";
	Если ТипЗнч(ДокументОснованиеГлавный) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РеализацияТоваровУслуг", "Документ.ОтчетОРозничныхПродажах");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокОснование.Автор КАК Ответственный", "ДокОснование.Ответственный КАК Ответственный");
	ИначеЕсли ТипЗнч(ДокументОснованиеГлавный) = Тип(СтрШаблон("ДокументСсылка.%1", ИмяДокументаВнутреннееПотребление)) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РеализацияТоваровУслуг", СтрШаблон("Документ.%1", ИмяДокументаВнутреннееПотребление));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокОснование.Автор КАК Ответственный", "ДокОснование.Ответственный КАК Ответственный");
	ИначеЕсли ТипЗнч(ДокументОснованиеГлавный) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РеализацияТоваровУслуг", "Документ.ВозвратТоваровОтКлиента");
	ИначеЕсли ТипЗнч(ДокументОснованиеГлавный) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РеализацияТоваровУслуг", "Документ.ПеремещениеТоваров");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокОснование.Склад КАК Склад", "ДокОснование.СкладОтправитель КАК Склад");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокОснование.Автор КАК Ответственный", "ДокОснование.Ответственный КАК Ответственный");
	ИначеЕсли ТипЗнч(ДокументОснованиеГлавный) = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РеализацияТоваровУслуг", "Документ.ДвижениеПродукцииИМатериалов");
		УсловиеСклад = 
		"ВЫБОР 
		|	КОГДА ДокОснование.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой)
		|		ТОГДА ДокОснование.Отправитель 
		|	КОГДА ДокОснование.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую)
		|		ТОГДА ДокОснование.Получатель 
		|	ИНАЧЕ НЕОПРЕДЕЛЕНО 
		|КОНЕЦ КАК Склад";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокОснование.Склад КАК Склад", УсловиеСклад);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокОснование.Автор КАК Ответственный", "ДокОснование.Ответственный КАК Ответственный");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокОснование.Подразделение КАК Подразделение", "НЕОПРЕДЕЛЕНО КАК Подразделение");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснованиеГлавный);
	Запрос.УстановитьПараметр("МассивДокументовОснований", МассивДокументовОснований);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Шапка.
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	// Для упаковок.
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	// ТЧ "Товары"
	ТаблицаТоварыВыборка = РезультатЗапроса[3].Выбрать();
	Пока ТаблицаТоварыВыборка.Следующий() Цикл
		// Если это не блюдо, то не считаем
		Если ТаблицаТоварыВыборка.питВидНоменклатуры <> Перечисления.питВидыНоменклатуры.Блюдо Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрокаТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаТовары, ТаблицаТоварыВыборка);
		
		Если СпособРасчетаРецептурыПоАктуальной Тогда
			// Определяем актуальную рецептуру
			НовСтрокаТовары.Рецептура = питПроизводство.ВернутьОсновнуюРецептуру(НовСтрокаТовары.Номенклатура, НовСтрокаТовары.Характеристика, Перечисления.питХозяйственныеОперации.РецептураПриготовление,Дата,СпособРасчетаРецептурыПоАктуальной,,ЭтотОбъект.Организация,,,ЭтотОбъект.Подразделение);
		КонецЕсли;
		
		Если ТаблицаТоварыВыборка.СерияВТЧ Тогда
			НовСтрокаТовары.Серия				= ТаблицаТоварыВыборка.СерияТЧ;
			НовСтрокаТовары.Количество			= ТаблицаТоварыВыборка.СерияКоличествоТЧ;
			НовСтрокаТовары.КоличествоУпаковок	= питОбщегоНазначения.ПолучитьКоэффициентУпаковки(НовСтрокаТовары.Номенклатура, НовСтрокаТовары.Упаковка, КэшированныеЗначения) / ТаблицаТоварыВыборка.СерияКоличествоТЧ;
		КонецЕсли;
		
	КонецЦикла;
	
	// +питПриоритетыПриготовления
	питПриоритетыПриготовления.СортироватьТабличнуюЧастьОбъектаПоПриоритетуПриготовления(ЭтотОбъект, "Товары", Склад);
	// -питПриоритетыПриготовления
	
	ЭтотОбъект.ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукции;
	ЭтотОбъект.Комментарий = "Выпуск создан на основании документа ""Реализация товаров и услуг"": <"+ДокументОснование+">";
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Менеджер                  = Пользователи.ТекущийПользователь();
	Валюта                    = питПроизводствоПовтИсп.ПолучитьВалютуРегламентированногоУчета(Валюта);
	Организация               = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
	Склад                     = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад, Ложь, Истина);
	СтатьяКалькуляции         = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("СтатьяКалькуляцииПоУмолчанию");
	
	Если НЕ ЗначениеЗаполнено(РежимПриготовленияМодификаторов) Тогда
		РежимПриготовленияМодификаторов = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питВидыПроизводстваМодификаторов");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		ДанныеЗаполненияМассив = ДанныеЗаполнения;
	Иначе
		ДанныеЗаполненияМассив = Новый Массив;
		ДанныеЗаполненияМассив.Добавить(ДанныеЗаполнения);
	КонецЕсли;
	Если НЕ ДанныеЗаполненияМассив.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдено данные для заполнения документа!");
		Возврат;
	КонецЕсли;
	Если НЕ МассивОднотипный(ДанныеЗаполненияМассив) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные для заполнения документа не однотипны. Выберите документы одинакового типа");
		Возврат;
	КонецЕсли;
	ДанныеЗаполненияГлавный = ДанныеЗаполненияМассив[0];
	
	ИмяДокументаВнутреннееПотребление = питОбратнаяСовместимостьПовтИсп.ИмяДокументаВнутреннееПотребление();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированныйУчетПодсистемы") Тогда
		МодульЗаполнениеДокументов = ОбщегоНазначения.ОбщийМодуль("ЗаполнениеДокументов");
		МодульЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполненияГлавный, Ложь);
	КонецЕсли; 
	
	ИнициализироватьДокумент();
	
	Если ТипЗнч(ДанныеЗаполненияГлавный) = тип("ДокументСсылка.питПланМеню") Тогда
		
		ЗаполнитьДокументНаОснованииПланаМеню(ДанныеЗаполненияГлавный);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполненияГлавный) = тип("Структура")
		И ДанныеЗаполненияГлавный.Свойство("ДокументОснование")
		И ТипЗнч(ДанныеЗаполненияГлавный.ДокументОснование) = тип("ДокументСсылка.питПланМеню") Тогда
		ЗаполнитьДокументНаОснованииПланаМеню(ДанныеЗаполненияГлавный.ДокументОснование, ДанныеЗаполненияГлавный.Свойство("СУчетомПроизведенных"));
		
	ИначеЕсли ТипЗнч(ДанныеЗаполненияГлавный) = тип("ДокументСсылка.ОтчетОРозничныхПродажах") 
		ИЛИ ТипЗнч(ДанныеЗаполненияГлавный) = тип("ДокументСсылка.РеализацияТоваровУслуг") 
		ИЛИ ТипЗнч(ДанныеЗаполненияГлавный) = тип(СтрШаблон("ДокументСсылка.%1", ИмяДокументаВнутреннееПотребление)) 
		ИЛИ ТипЗнч(ДанныеЗаполненияГлавный) = тип("ДокументСсылка.ВозвратТоваровОтКлиента")
		ИЛИ ТипЗнч(ДанныеЗаполненияГлавный) = тип("ДокументСсылка.ДвижениеПродукцииИМатериалов")
		ИЛИ ТипЗнч(ДанныеЗаполненияГлавный) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		ЗаполнитьДокументНаОснованииТиповыхДокументов(ДанныеЗаполненияМассив);
		
	Иначе
		
		//+25
		//ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
		ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполненияГлавный);
		//-25
		
		// Предлагаем использовать или нет сезонные коэффициенты
		НеИспользоватьСезонныеПроценты = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питНеИспользоватьСезонныеПроценты");
		
		ВидПроизводства = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питРежимПриготовленияПолуфабрикатов");
		
	КонецЕсли;
	
		//<<Портал-Юг, Давиденко 2019.03.01 [4.2.3 Вид операции «Заборный лист» в документе «Выпуск блюд»]
	Если ПЛ_ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.питХозяйственныеОперации.ПЛ_ЗаборныйЛист") Тогда
		Для Каждого СтрокаТовары Из Товары Цикл
			СтрокаТовары.ПЛ_Передано = СтрокаТовары.КоличествоУпаковок - СтрокаТовары.ПЛ_Возвращено;
		КонецЦикла;

	КонецЕсли;
		ПЛ_ХозяйственнаяОперация = ХозяйственнаяОперация;
	//>>Портал-Юг, Давиденко 2019.03.01			
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// +питПриоритетыПриготовления
	Если ДополнительныеСвойства.Свойство("питСортироватьПоПриоритетуПриготовления") Тогда
		питПриоритетыПриготовления.СортироватьТабличнуюЧастьОбъектаПоПриоритетуПриготовления(ЭтотОбъект, "Товары", Склад);
	КонецЕсли;
	// -питПриоритетыПриготовления
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	//<< Портал-Юг, Баринов, 2019.09.15 [9.20 Настройка доступа к документу «Выпуск блюд» для супервайзеров и поваров]
	Если НЕ ЭтоНовый() И НЕ ПравоДоступа("Проведение", Метаданные()) Тогда
		// Не должно быть возможности изменить вид операции на "Выпуск с розничной реализацией" и в реализации менять значение реквизита "ПЛ_Номенклатура"
		РеквизитыДоЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПЛ_ХозяйственнаяОперация, ПЛ_Номенклатура");
		Если ПЛ_ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРозничнойРеализацией 
			ИЛИ РеквизитыДоЗаписи.ПЛ_ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРозничнойРеализацией Тогда
			
			НарушениеПрав = ПЛ_ХозяйственнаяОперация <> РеквизитыДоЗаписи.ПЛ_ХозяйственнаяОперация
				ИЛИ ПЛ_Номенклатура <> РеквизитыДоЗаписи.ПЛ_Номенклатура;
			
			Если НарушениеПрав Тогда
				Отказ = Истина;
				ТекстОшибки = НСтр("ru = 'У пользователя недостаточно прав на исполнение операции над базой данных'");
				ВызватьИсключение ТекстОшибки;
			КонецЕсли; 	
		КонецЕсли;
	КонецЕсли; 
	//>> Портал-Юг, Баринов, 2019.09.15
	
	// Эти два флага должны совпадать
	СуммаВключаетНДС = ЦенаВключаетНДС;
	
	ЭтоРозница     = (ХозяйственнаяОперация=Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРозничнойРеализацией);
	ЭтоРеализация  = (ХозяйственнаяОперация=Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРеализацией);
	
	Если ЭтоРозница ИЛИ ЭтоРеализация Тогда
		СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(Товары, ЦенаВключаетНДС);
		Для каждого СтрокаТовары Из Товары Цикл
			СтрокаТовары.Назначение = Неопределено;
		КонецЦикла;
	Иначе
		СуммаДокумента = 0;
	КонецЕсли;
	
	//+ОтложенноеПроведение
	Если НЕ ДополнительныеСвойства.Свойство("питИспользоватьОтложенноеПроведениеВыпускаБлюд") Тогда
		ДополнительныеСвойства.Вставить("питИспользоватьОтложенноеПроведениеВыпускаБлюд", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питИспользоватьОтложенноеПроведениеВыпускаБлюд"));
	КонецЕсли;
	Если ДополнительныеСвойства.питИспользоватьОтложенноеПроведениеВыпускаБлюд
		И НЕ ДополнительныеСвойства.Свойство("питВыполнениеДействияОтложенногоПроведения") Тогда
		ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
		ДополнительныеСвойства.Вставить("СтараяПометкаУдаления", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления"));
		Возврат;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//<<Портал-Юг, Каунов, 2019.11.11 [запрет записи выпусков в конце дня] - формирует документы следующим днём
	Если Дата = КонецДня(Дата) Тогда
		Дата = Дата-1;
	КонецЕсли; 
	//>>Портал-Юг, Каунов, 2019.11.11
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	//+Серии
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект,Документы.питВыпускБлюд);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.Товары);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.ПобочныеИзделия);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.Блюда);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.Ингредиенты);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.Модификаторы);
	//-Серии
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Прежде, чем пересчитывать таблицы производства, обновим рецептуры в ТЧ товары
	ТекстОшибки = "";
	//<< Портал-Юг, Баринов, 2019.10.21 [Перенесено из релиза 2.4.10.56]
	//ПроверкаАктуальностиРецептур(Отказ, РежимЗаписи, ТекстОшибки);
	//<< Портал-Юг, Баринов, 2019.11.25 [Перепроведение без пересчёта]
	Если Не ПЛ_КлиентСервер.ЗначениеСвойства(ДополнительныеСвойства, "ПЛ_ГрупповоеПерепроведение", Ложь) Тогда
	//>> Портал-Юг, Баринов, 2019.11.25
	ОбновитьАктуальныеРецептуры(Отказ, РежимЗаписи, ТекстОшибки);
	//<< Портал-Юг, Баринов, 2019.11.25 [Перепроведение без пересчёта]
	КонецЕсли; 
	//>> Портал-Юг, Баринов, 2019.11.25
	//>> Портал-Юг, Баринов, 2019.10.21
	Если Отказ Тогда
		ВызватьИсключение(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	//+Серии
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.питВыпускБлюд);
	ТекстОшибки = "";
	
	// Автосоздание серий по товарам
	ВсеОк = питПроизводство.СоздатьСерииАвтоматически(ЭтотОбъект, ПараметрыУказанияСерий.Товары, ТекстОшибки);
	Если НЕ ВсеОк Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	// Автосоздание серий по побочным изделиям
	ВсеОк = питПроизводство.СоздатьСерииАвтоматически(ЭтотОбъект, ПараметрыУказанияСерий.ПобочныеИзделия, ТекстОшибки);
	Если НЕ ВсеОк Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	//-Серии
	
	//<<Портал-Юг, Давиденко 2019.03.12 [6.2.10 Отражение производства услуг по СКЛ]
	// необходимо иметь возможность ввода дублей
	//Отказ = НЕ Документы.питВыпускБлюд.ПроверитьТоварыНаДубли(ЭтотОбъект);
	//>>Портал-Юг, Давиденко 2019.03.1
	Если ЭтотОбъект.РежимРасчетаСписанияВПроизводство = Перечисления.питРежимыРасчетаСписанияВПроизводство.ПоНорме Тогда
		
		ОтключитьДополнительныеПроверки = Ложь;
		Если ДополнительныеСвойства.Свойство("ОтключитьДополнительныеПроверки") Тогда
			ОтключитьДополнительныеПроверки = ДополнительныеСвойства.ОтключитьДополнительныеПроверки;
		КонецЕсли;

		//<< Портал-Юг, Баринов, 2019.11.25 [Перепроведение без пересчёта]
		Если Не ПЛ_КлиентСервер.ЗначениеСвойства(ДополнительныеСвойства, "ПЛ_ГрупповоеПерепроведение", Ложь) Тогда
		//>> Портал-Юг, Баринов, 2019.11.25
		
		ЗаполнитьПроизводства(ОтключитьДополнительныеПроверки);

		//<< Портал-Юг, Баринов, 2019.11.25 [Перепроведение без пересчёта]
		КонецЕсли; 
		//>> Портал-Юг, Баринов, 2019.11.25			
	КонецЕсли;
	
	// Проверка заполненности рецептур в ТЧ "Товары".
	ТекстОшибки = "";
	//<< Портал-Юг, Баринов, 2019.11.25 [Перепроведение без пересчёта]
	Если Не ПЛ_КлиентСервер.ЗначениеСвойства(ДополнительныеСвойства, "ПЛ_ГрупповоеПерепроведение", Ложь) Тогда
	//>> Портал-Юг, Баринов, 2019.11.25
	ПроверкаЗаполненностиРецептур(Отказ, РежимЗаписи, ТекстОшибки);
	//<< Портал-Юг, Баринов, 2019.11.25 [Перепроведение без пересчёта]
	КонецЕсли; 
	//>> Портал-Юг, Баринов, 2019.11.25		
	Если Отказ Тогда
		ВызватьИсключение(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	//+Серии
	// Автосоздание серий по блюдам(п/ф)
	ВсеОк = питПроизводство.СоздатьСерииАвтоматически(ЭтотОбъект, ПараметрыУказанияСерий.Блюда, ТекстОшибки, Истина);
	Если НЕ ВсеОк Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	//-Серии
	
	//+Серии
	// Заполнение серии в ТЧ "Ингредиенты".
	СтрокиАвтопеределов = ЭтотОбъект.Ингредиенты.НайтиСтроки(Новый Структура("ИзАвтопеределов", Истина));
	Для каждого ТекАвтопередел Из СтрокиАвтопеределов Цикл
		СтрокиБлюдо = ЭтотОбъект.Блюда.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Рецептура,Автопередел", ТекАвтопередел.Ингредиент, ТекАвтопередел.Характеристика, ТекАвтопередел.РецептураАвтопередела, Истина));
		Если СтрокиБлюдо.Количество() Тогда
			СтрокаБлюдо = СтрокиБлюдо[0];
			ТекАвтопередел.Серия = СтрокаБлюдо.Серия;
		КонецЕсли;
	КонецЦикла;
	//-Серии
	
		// << MRS #ERP-5312 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 23.07.25, ()
	ОргСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ПЛ_Организация");
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(ОргСклада) И Организация <> ОргСклада Тогда
		Если НЕ MRS_Сервер.РольДоступнаВызовСервера("АдминистраторСистемы") Тогда
			ОбщегоНазначения.СообщитьПользователю("Запрещено проведение документа с организацией отличной от организации склада получателя!",,,,Отказ);
		Иначе
			СообщенияПользователюБЗК.СообщитьПользователю("Запрещено проведение документа с организацией отличной от организации склада получателя!, Но вы Админ, вам можно.");
		КонецЕсли;	
	КонецЕсли;
	// >> MRS #ERP-5312 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 23.07.25, ()
	
	Документы.питВыпускБлюд.СвернутьМодификаторы(Модификаторы);
	Документы.питВыпускБлюд.ПроверитьМодификаторы(Модификаторы);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

// Проверяет заполненность рецептур в ТЧ Товары.
Процедура ПроверкаЗаполненностиРецептур(Отказ=Ложь, РежимЗаписи = Неопределено, ТекстОшибки = "")
	Если РежимЗаписи = Неопределено Тогда
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	
	питВосприниматьБлюдоБезРецептурыКакТовар = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питВосприниматьБлюдоБезРецептурыКакТовар");
	
	Если РежимРасчетаСписанияВПроизводство=Перечисления.питРежимыРасчетаСписанияВПроизводство.ПоНорме Тогда
		
		ЗаписыватьПриНеЗаполненнойРецептуре = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("ЗаписыватьПриНеЗаполненнойРецептуре");
		//СпособРасчетаРецептурыПоАктуальной = (Константы.питСпособРасчетаРецептур.Получить() = Перечисления.питСпособРасчетаРецептур.ПоАктуальнойРецептуре);
		СпособРасчетаРецептурыПоАктуальной= (питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("СпособРасчетаРецептур") = Перечисления.питСпособРасчетаРецептур.ПоАктуальнойРецептуре);
		СвойстваТоваров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Товары.ВыгрузитьКолонку("Номенклатура"),"питВидНоменклатуры");
		Если НЕ СпособРасчетаРецептурыПоАктуальной Тогда
			СвойстваРецептур = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Товары.ВыгрузитьКолонку("Рецептура"),"Номенклатура");
		КонецЕсли;	
		
		Для Каждого СтрокаТовары Из Товары Цикл
			
			// Если это не блюдо, то не считаем
			Если СвойстваТоваров.Получить(СтрокаТовары.Номенклатура).питВидНоменклатуры <> Перечисления.питВидыНоменклатуры.Блюдо Тогда
				Продолжить;
			КонецЕсли;	
			
			Если СпособРасчетаРецептурыПоАктуальной Тогда
				// Определяем актуальную рецептуру
				Рецептура = питПроизводство.ВернутьОсновнуюРецептуру(СтрокаТовары.Номенклатура, СтрокаТовары.Характеристика, Перечисления.питХозяйственныеОперации.РецептураПриготовление,Дата,СпособРасчетаРецептурыПоАктуальной,,Организация,,,Подразделение);
			Иначе
				Рецептура = СтрокаТовары.Рецептура;
			КонецЕсли;
			
			Префикс = "Товары[" + Формат(СтрокаТовары.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
			
			Если НЕ ЗначениеЗаполнено(Рецептура) И НЕ СтрокаТовары.ПриготовлениеЗапрещено И НЕ питВосприниматьБлюдоБезРецептурыКакТовар Тогда
				
				// Рецептуры нет, сообщим об этом
				Если СпособРасчетаРецептурыПоАктуальной Тогда
					ТекстСообщения = НСтр("ru = 'Нет актуальной рецептуры, на дату: %1.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Дата);
				Иначе
					ТекстСообщения = НСтр("ru = 'Не заполнена рецептура.'");
				КонецЕсли;	
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru = 'Рецептура'"), СтрокаТовары.НомерСтроки, "Товары", ТекстСообщения);
				Поле = Префикс + "Рецептура";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", );
				ТекстОшибки = ТекстСообщения;
				Если НЕ ЗаписыватьПриНеЗаполненнойРецептуре ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
					Отказ = Истина;
				КонецЕсли;
				
			Иначе
				
				Если НЕ СпособРасчетаРецептурыПоАктуальной Тогда
					// Проверить правильность указания рецептуры
					Если СтрокаТовары.Номенклатура <> СвойстваРецептур.Получить(СтрокаТовары.Рецептура).Номенклатура Тогда
						
						ТекстСообщения = НСтр("ru = 'Неправильно указана рецептура, номенклатура в шапке рецептуры не равна номенклатуре в строке таблицы товаров.'");
						ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
							НСтр("ru = 'Рецептура'"), СтрокаТовары.НомерСтроки, "Товары", ТекстСообщения);
						Поле = Префикс + "Рецептура";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", );
						ТекстОшибки = ТекстСообщения;
						Если НЕ ЗаписыватьПриНеЗаполненнойРецептуре ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
							Отказ = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Обновляет ТЧ Товары актуальными рецептурами
Процедура ОбновитьАктуальныеРецептуры(Отказ=Ложь, РежимЗаписи = Неопределено, ТекстОшибки = "")
	Если РежимЗаписи = Неопределено Тогда
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	
	Если РежимРасчетаСписанияВПроизводство=Перечисления.питРежимыРасчетаСписанияВПроизводство.ПоНорме Тогда
		
		ЗаписыватьПриНеЗаполненнойРецептуре = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("ЗаписыватьПриНеЗаполненнойРецептуре");
		СпособРасчетаРецептурыПоАктуальной= (питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("СпособРасчетаРецептур") = Перечисления.питСпособРасчетаРецептур.ПоАктуальнойРецептуре);
		СвойстваТоваров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Товары.ВыгрузитьКолонку("Номенклатура"),"питВидНоменклатуры");
		Если НЕ СпособРасчетаРецептурыПоАктуальной Тогда
			СвойстваРецептур = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Товары.ВыгрузитьКолонку("Рецептура"),"Номенклатура");
		КонецЕсли;	
		
		Для Каждого СтрокаТовары Из Товары Цикл
			
			// Если это не блюдо, то не считаем
			Если СвойстваТоваров.Получить(СтрокаТовары.Номенклатура).питВидНоменклатуры <> Перечисления.питВидыНоменклатуры.Блюдо Тогда
				Продолжить;
			КонецЕсли;	
			
			Если СпособРасчетаРецептурыПоАктуальной Тогда
				// Определяем актуальную рецептуру
				Рецептура = питПроизводство.ВернутьОсновнуюРецептуру(СтрокаТовары.Номенклатура, СтрокаТовары.Характеристика, Перечисления.питХозяйственныеОперации.РецептураПриготовление,Дата,СпособРасчетаРецептурыПоАктуальной,,Организация,,,Подразделение);
				Если СтрокаТовары.Рецептура<>Рецептура Тогда
					СтрокаТовары.Рецептура = Рецептура;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(РежимПриготовленияМодификаторов) Тогда
		РежимПриготовленияМодификаторов = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питВидыПроизводстваМодификаторов");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидПроизводства) Тогда
		ВидПроизводства = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питРежимПриготовленияПолуфабрикатов");
	КонецЕсли;
	
	ЭтоВыпуск      = (ХозяйственнаяОперация=Перечисления.питХозяйственныеОперации.ВыпускПродукции);
	ЭтоРозница     = (ХозяйственнаяОперация=Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРозничнойРеализацией);
	ЭтоРеализация  = (ХозяйственнаяОперация=Перечисления.питХозяйственныеОперации.ВыпускПродукцииСРеализацией);
	ЭтоСписание    = (ХозяйственнаяОперация=Перечисления.питХозяйственныеОперации.ВыпускПродукцииСоСписанием);
	ЭтоПеремещение = (ХозяйственнаяОперация=Перечисления.питХозяйственныеОперации.ВыпускПродукцииСПеремещением);
	///***---
	//РаздельныйУчетНДСДо2014Года = УчетнаяПолитика.РаздельныйУчетНДСДо2014Года(Организация, Дата);
	//РаздельныйУчетНДСНаСчете19 = УчетнаяПолитика.РаздельныйУчетНДСНаСчете19(Организация, Дата);
	РаздельныйУчетНДСДо2014Года = Ложь; //удалить
	РаздельныйУчетНДСНаСчете19 = Ложь;
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	// Не проверяем заполненность табличных частей (включая реквизиты), 
	// которые не используются при определенных видах операции и будут очищены в ПередЗаписью
	НеИспользуемыеТабличныеЧасти = Документы.питВыпускБлюд.НеИспользуемыеТабличныеЧасти(ХозяйственнаяОперация);
	
	питОбщегоНазначенияСервер.ИсключитьИзПроверкиНеиспользуемыеТабличныеЧасти(
		ПроверяемыеРеквизиты,
		НеИспользуемыеТабличныеЧасти);
	
	ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
		ЭтотОбъект,, МассивНепроверяемыхРеквизитов, Отказ);
	
	// Документ без данных о реализованных товарах или услугах
	// считаем заполненным некорректно.
	
	ОсновныеСписки = Новый Массив();
	ОсновныеСписки.Добавить("Товары");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ОсновныеСписки, НеИспользуемыеТабличныеЧасти);
	
	питОбщегоНазначенияСервер.ИсключитьИзПроверкиОсновныеТабличныеЧасти(
		ЭтотОбъект, 
		ОсновныеСписки, 
		ПроверяемыеРеквизиты);  
	
	// {{ Список реквизитов
	
	// "Дата"
	// "ХозяйственнаяОперация"
	// "Организация"
	// "ПодразделениеОрганизации"
	// "Склад"
	
	Если ЭтоРозница Тогда
		ПроверяемыеРеквизиты.Добавить("ТипЦен");
	КонецЕсли;
	
	Если НЕ ЭтоПеремещение И НЕ ЭтоРозница И НЕ ЭтоРеализация Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СкладПолучатель");
	КонецЕсли;
	Если НЕ (ЭтоРозница ИЛИ ЭтоРеализация) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Валюта");
	КонецЕсли;
	
	// "РежимРасчетаСписанияВПроизводство"
	// "РежимИспользованияАналогов"
	// "ВидПроизводства"
	// "СтатьяЗатратПроизводство"
	МассивНепроверяемыхРеквизитов.Добавить("СчетКасса");
	Если НЕ ЭтоРеализация Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("СпособЗачетаАвансов");
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаРасчетовСКонтрагентом");
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаРасчетовПоАвансам");
		
		МассивНепроверяемыхРеквизитов.Добавить("Партнер");
		МассивНепроверяемыхРеквизитов.Добавить("Соглашение");
		
	КонецЕсли;
	МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");
	МассивНепроверяемыхРеквизитов.Добавить("Договор");
	
	МассивНепроверяемыхРеквизитов.Добавить("питСтатьяРасходов");
	
	//>> Швецов. ERP-5424. 17.09.25
	// Требует заполнять аналитику даже там, где она не обязательна
	Если НЕ ЭтоСписание Тогда  
		 
		Если ПЛ_ХозяйственнаяОперация <> Перечисления.питХозяйственныеОперации.ПЛ_ЗаборныйЛист Тогда 
			МассивНепроверяемыхРеквизитов.Добавить("СтатьяРасходов");
		ИначеЕсли ПЛ_ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.ПЛ_ЗаборныйЛист Тогда
			ЕстьАлкогольнаяПродукция = Ложь;
			Для Каждого СтрокаТовара из Товары Цикл
				Если СтрокаТовара.Номенклатура.АлкогольнаяПродукция и НЕ СтрокаТовара.Номенклатура.АлкогольнаяПродукцияВоВскрытойТаре Тогда
					ЕстьАлкогольнаяПродукция = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			Если не ЕстьАлкогольнаяПродукция Тогда
				МассивНепроверяемыхРеквизитов.Добавить("СтатьяРасходов");
			КонецЕсли;	
		КонецЕсли;
		
		ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
		ЭтотОбъект,, МассивНепроверяемыхРеквизитов, Отказ);
	
	Иначе
		ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
			ЭтотОбъект,, МассивНепроверяемыхРеквизитов, Отказ);		
	КонецЕсли;
	//<< Швецов. ERP-5424. 17.09.25
	
	// "Товары"
	// "Товары.Номенклатура"
	// "Товары.ЕдиницаИзмерения"
	// "Товары.Коэффициент"
	// "Товары.Количество"
	// "Товары.СтавкаНДС"
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ПереданныеСчетУчета");
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Цена");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Сумма");
	Если ЭтоРозница ИЛИ ЭтоРеализация Тогда
		
		//<<Портал-Юг, Давиденко 2019.02.19 [4.2.7 Нулевая цена и аналитика продаж в отчёте о розничных продажах и выпуске блюд]
		//<< Портал-Юг, Баринов, 2019.08.01 [ТП Нулевая цена по кассе ККМ] 
		//Если ПЛ_ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.питХозяйственныеОперации.ПЛ_ЗаборныйЛист") Тогда
		ПроверятьЦену = ПЛ_ХозяйственнаяОперация <> Перечисления.питХозяйственныеОперации.ПЛ_ЗаборныйЛист;
		Если ПроверятьЦену И ЭтоРозница Тогда
			ПроверятьЦену = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассаККМ, "ПЛ_РазрешитьПродажуПоНулевойЦене") <> Истина;
		КонецЕсли;
		Если ПроверятьЦену Тогда
	    //>> Портал-Юг, Баринов, 2019.08.01
			Если ЭтоРеализация Тогда
		//>>Портал-Юг, Давиденко 2019.02.19
		
		// Если даже сумма нулевая, НО при этом процент скидки заполнен, значит разрешаем такую строку.
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	ТЧТовары.НомерСтроки, 
		|	ТЧТовары.Номенклатура,
		|	ТЧТовары.Характеристика,
		|	ТЧТовары.Сумма,
		|	ТЧТовары.ПроцентРучнойСкидки,
		|	ТЧТовары.ПроцентСкидки
		|ПОМЕСТИТЬ ВТИнгредиенты 
		|ИЗ &ТЧТовары КАК ТЧТовары;
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА питВыпускБлюдБлюда.Сумма <> 0 ИЛИ питВыпускБлюдБлюда.ПроцентРучнойСкидки > 0 ИЛИ питВыпускБлюдБлюда.ПроцентСкидки > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СуммаЗаполнена,
		|	питВыпускБлюдБлюда.НомерСтроки
		|ИЗ
		|	ВТИнгредиенты КАК питВыпускБлюдБлюда";
		//<<Портал-Юг, Давиденко 2019.02.19 [4.2.7 Нулевая цена и аналитика продаж в отчёте о розничных продажах и выпуске блюд]
	ИначеЕсли ЭтоРозница Тогда
		// для розницы разрешена установка нулевой цены номенклатуры, помеченной в регистре
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧТовары.НомерСтроки КАК НомерСтроки,
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Характеристика КАК Характеристика,
		|	ТЧТовары.Сумма КАК Сумма,
		|	ТЧТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ТЧТовары.ПроцентСкидки КАК ПроцентСкидки
		|ПОМЕСТИТЬ ВТИнгредиенты
		|ИЗ
		|	&ТЧТовары КАК ТЧТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА питВыпускБлюдБлюда.Сумма <> 0
		|				ИЛИ питВыпускБлюдБлюда.ПроцентРучнойСкидки > 0
		|				ИЛИ питВыпускБлюдБлюда.ПроцентСкидки > 0
		|				ИЛИ ЕСТЬNULL(ПЛ_НастройкиПродаж.НулеваяЦена, ЛОЖЬ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СуммаЗаполнена,
		|	питВыпускБлюдБлюда.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТИнгредиенты КАК питВыпускБлюдБлюда
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_НастройкиПродаж КАК ПЛ_НастройкиПродаж
		|		ПО питВыпускБлюдБлюда.Номенклатура = ПЛ_НастройкиПродаж.Номенклатура";
	КонецЕсли;
	//>>Портал-Юг, Давиденко 2019.02.19
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТЧТовары", ЭтотОбъект.Товары.Выгрузить());
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(ЭтотОбъект);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ ВыборкаДетальныеЗаписи.СуммаЗаполнена Тогда
				Отказ = Истина;
				
				// >> ERP-5692. Швецов. Логирование работы с выпусками блюд, для помощи при закрытии смены
				ТекстОшибки = СтрШаблон(
				    "Сумма не заполнена в строке %1 таблицы ""Товары""!",
				    ВыборкаДетальныеЗаписи.НомерСтроки
				); 
				
				MRS_Сервер.ЗаписатьЛогОбработкиВыпускаБлюд(ЭтотОбъект,ТекстОшибки);
				// <<
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", ВыборкаДетальныеЗаписи.НомерСтроки, "Сумма");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма не заполнена в строке "+ВыборкаДетальныеЗаписи.НомерСтроки+" таблицы ""Товары""!",,,,Отказ);
			КонецЕсли;
		КонецЦикла;
	//<<Портал-Юг, Давиденко 2019.02.26 [4.2.3 Вид операции «Заборный лист» в документе «Выпуск блюд»]
	КонецЕсли;
	//>>Портал-Юг, Давиденко 2019.02.26		
	КонецЕсли;
	
	Если НЕ ЭтоПеремещение Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.НовыйСчетУчета");
	КонецЕсли;
	Если НЕ ЭтоПеремещение ИЛИ НЕ РаздельныйУчетНДСНаСчете19 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.СпособУчетаНДС");
	КонецЕсли;
	// "Производство.Номенклатура"
	// "Производство.Рецептура"
	// "Производство.ЕдиницаИзмеренияНоменклатуры"
	// "Производство.КоэффициентНоменклатуры"
	// "Производство.Ингредиент"
	// "Производство.ЕдиницаИзмеренияИнгредиента"
	// "Производство.КоэффициентИнгредиента"
	Если НЕ РаздельныйУчетНДСНаСчете19 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Производство.СпособУчетаНДС");
	КонецЕсли;
	// "Замены.Номенклатура"
	// "Замены.ИнгредиентИсходный"
	// "Замены.ЕдиницаИзмеренияИнгредиентаИсходный"
	// "Замены.КоэффициентИсходный"
	// "Замены.ИнгредиентЗамена"
	// "Замены.ЕдиницаИзмеренияИнгредиентаЗамена"
	// "Замены.КоэффициентЗамена"
	Если НЕ РаздельныйУчетНДСНаСчете19 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Замены.СпособУчетаНДС");
	КонецЕсли;
	Если НЕ (ЭтоСписание ИЛИ ЭтоПеремещение ИЛИ ЭтоРеализация) ИЛИ НЕ времФункциональнаяОпцияВозвратнаяТара Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.Номенклатура");
		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.Количество");
		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.СчетУчета");
	КонецЕсли;
	Если НЕ ЭтоПеремещение ИЛИ НЕ времФункциональнаяОпцияВозвратнаяТара Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВозвратнаяТара.НовыйСчетУчета");
	КонецЕсли;
	// "Услуги"
	//Если НЕ (ЭтоРозница ИЛИ ЭтоРеализация) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Услуги.СтавкаНДС");
		МассивНепроверяемыхРеквизитов.Добавить("Услуги.СчетДоходов");
		МассивНепроверяемыхРеквизитов.Добавить("Услуги.Субконто");
		МассивНепроверяемыхРеквизитов.Добавить("Услуги.СчетУчетаНДСПоРеализации");
		МассивНепроверяемыхРеквизитов.Добавить("Услуги.СчетРасходов");
	//КонецЕсли;
	//МассивНепроверяемыхРеквизитов.Добавить("Услуги.СчетУчетаНДСПоРеализации"); //??
	Если НЕ ЭтоРозница Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КассаККМ");
		
		МассивНепроверяемыхРеквизитов.Добавить("АгентскиеУслуги.СтавкаНДС");
		МассивНепроверяемыхРеквизитов.Добавить("АгентскиеУслуги.Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("АгентскиеУслуги.ДоговорКонтрагента");
		МассивНепроверяемыхРеквизитов.Добавить("АгентскиеУслуги.СчетРасчетов");
	КонецЕсли;
	Если НЕ ЭтоРеализация Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗачетАвансов");
	КонецЕсли;
	
	// }} Список реквизитов
	
	////////////////////////////////////////////////////////////////
	
	ТипСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТипСклада");
	
	Если ТипСклада <> Перечисления.ТипыСкладов.ОптовыйСклад Тогда
		РозницаВПродажныхЦенах = Истина;
	Иначе
		РозницаВПродажныхЦенах = Ложь;
	КонецЕсли;
	
	АТТ = (РозницаВПродажныхЦенах И ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин);
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ОрганизацияПрименяетУСН    = Ложь;
	///***--- ОрганизацияПредприниматель = УчетнаяПолитика.ПлательщикНДФЛ(Организация, Дата);
	ОрганизацияПредприниматель = Ложь;
	
	ОтражатьВНалоговомУчетеУСН       = Ложь;
	ОтражатьВНалоговомУчетеУСНДоходы = Ложь;
	
	// Соберем списываемую номенклатуру
	СписокНоменклатуры = ОбщегоНазначения.ВыгрузитьКолонку(Товары, "Номенклатура", Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНоменклатуры, Замены.ВыгрузитьКолонку("ИнгредиентЗамена"), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНоменклатуры, Ингредиенты.ВыгрузитьКолонку("Ингредиент"), Истина);
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокНоменклатуры, "питВидНоменклатуры");
	
	ИмяСписка = НСтр("ru = 'Товары'");
	Для каждого СтрокаТаблицы Из Товары Цикл
		Префикс = "Товары[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		
		СведенияОНоменклатуре = РеквизитыНоменклатуры.Получить(СтрокаТаблицы.Номенклатура);
		ЭтоУслуга = ?(СведенияОНоменклатуре = Неопределено, Ложь, СведенияОНоменклатуре.питВидНоменклатуры = Перечисления.питВидыНоменклатуры.Услуга);
		
		Если ЭтоУслуга И (ЭтоПеремещение ИЛИ ЭтоСписание) Тогда
			ТекстСообщения = НСтр("ru = 'Для операций перемещения и списания не должно быть услуг.'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность", НСтр("ru = 'Номенклатура'"),
				СтрокаТаблицы.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Номенклатура";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверка заполнения табличной части "Оплата" для выпуска с розницей
	Если ЭтоРозница Тогда
		
		// Проверка: сумма безналичных оплат не должна превышать сумму по реализации товаров и услуг
		СуммаВыручки = Товары.Итог("Сумма") + ?(СуммаВключаетНДС, 0, Товары.Итог("СуммаНДС"))
			+ АгентскиеУслуги.Итог("Сумма") + ?(СуммаВключаетНДС, 0, АгентскиеУслуги.Итог("СуммаНДС"));
		
		Если Оплата.Итог("СуммаОплаты") > СуммаВыручки  Тогда
			
			ТекстОписаниеОшибки = НСтр("ru = 'Сумма безналичных оплат превышает сумму выручки от реализации!'");
			ТекстСообщения      = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список", "Корректность",,, НСтр("ru = 'Безналичные оплаты'"), ТекстОписаниеОшибки);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Оплата", "Объект", Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	#Область ПроверкаХарактеристик
	
	ПараметрыПроверкиХарактеристик = НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик();
	
	ПараметрыПроверкиХарактеристик.ИмяТЧ = "Товары";
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверкиХарактеристик);
	
	ПараметрыПроверкиХарактеристик.ИмяТЧ = "Модификаторы";
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверкиХарактеристик);
	
	ПараметрыПроверкиХарактеристик.ИмяТЧ = "ПобочныеИзделия";
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверкиХарактеристик);
	
	ПараметрыПроверкиХарактеристик.ИмяТЧ = "Блюда";
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверкиХарактеристик);
	
	МассивНепроверяемыхРеквизитов.Добавить("Замены.ХарактеристикаБлюда");
	МассивНепроверяемыхРеквизитов.Добавить("Замены.ХарактеристикаИнгредиентаИсходного");
	МассивНепроверяемыхРеквизитов.Добавить("Замены.ХарактеристикаИнгредиентаЗамена");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"
		|ВЫБРАТЬ 
		|	ТЧЗамены.НомерСтроки,
		|	ТЧЗамены.Блюдо, 
		|	ТЧЗамены.ИнгредиентИсходный, 
		|	ТЧЗамены.ИнгредиентЗамена,
		|	ТЧЗамены.ХарактеристикаБлюда,
		|	ТЧЗамены.ХарактеристикаИнгредиентаЗамена,
		|	ТЧЗамены.ХарактеристикаИнгредиентаИсходного
		|ПОМЕСТИТЬ ВТЗамены 
		|ИЗ &ТЧЗамены КАК ТЧЗамены;
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ Блюда.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|				И питВыпускБлюдЗамены.ХарактеристикаБлюда = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ХарактеристикаБлюдаЗаполнена,
		|	питВыпускБлюдЗамены.НомерСтроки,
		|	ВЫБОР
		|		КОГДА НЕ ИнгредиентыЗамена.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|				И питВыпускБлюдЗамены.ХарактеристикаИнгредиентаЗамена = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ХарактеристикаЗаменыЗаполнена,
		|	ВЫБОР
		|		КОГДА НЕ ИнгредиентыИсходные.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|				И питВыпускБлюдЗамены.ХарактеристикаИнгредиентаИсходного = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ХарактеристикаИнгредиентаИсходногоЗаполнена
		|ИЗ
		|	ВТЗамены КАК питВыпускБлюдЗамены
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Блюда
		|		ПО питВыпускБлюдЗамены.Блюдо = Блюда.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ИнгредиентыИсходные
		|		ПО питВыпускБлюдЗамены.ИнгредиентИсходный = ИнгредиентыИсходные.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ИнгредиентыЗамена
		|		ПО питВыпускБлюдЗамены.ИнгредиентЗамена = ИнгредиентыЗамена.Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЧЗамены", ЭтотОбъект.Замены.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(ЭтотОбъект);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ВыборкаДетальныеЗаписи.ХарактеристикаБлюдаЗаполнена Тогда
			Отказ = Истина;
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Замены", ВыборкаДетальныеЗаписи.НомерСтроки, "ХарактеристикаБлюда");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена характеристика блюда в строке "+ВыборкаДетальныеЗаписи.НомерСтроки+" таблицы ""Замены""!",,,,Отказ);
		КонецЕсли;
		Если НЕ ВыборкаДетальныеЗаписи.ХарактеристикаЗаменыЗаполнена Тогда
			Отказ = Истина;
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Замены", ВыборкаДетальныеЗаписи.НомерСтроки, "ХарактеристикаИнгредиентаЗамена");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена характеристика замены в строке "+ВыборкаДетальныеЗаписи.НомерСтроки+" таблицы ""Замены""!",,,,Отказ);
		КонецЕсли;
		Если НЕ ВыборкаДетальныеЗаписи.ХарактеристикаЗаменыЗаполнена Тогда
			Отказ = Истина;
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Замены", ВыборкаДетальныеЗаписи.НомерСтроки, "ХарактеристикаИнгредиентаИсходного");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена характеристика исходного ингредиента в строке "+ВыборкаДетальныеЗаписи.НомерСтроки+" таблицы ""Замены""!",,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
	МассивНепроверяемыхРеквизитов.Добавить("Ингредиенты.Характеристика");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	ТЧИнгредиенты.НомерСтроки, 
	|	ТЧИнгредиенты.Ингредиент,
	|	ТЧИнгредиенты.Характеристика
	|ПОМЕСТИТЬ ВТИнгредиенты 
	|ИЗ &ТЧИнгредиенты КАК ТЧИнгредиенты;
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Ингредиенты.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|				И питВыпускБлюдИнгредиенты.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ХарактеристикаЗаполнена,
	|	питВыпускБлюдИнгредиенты.НомерСтроки
	|ИЗ
	|	ВТИнгредиенты КАК питВыпускБлюдИнгредиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ингредиенты
	|		ПО питВыпускБлюдИнгредиенты.Ингредиент = Ингредиенты.Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЧИнгредиенты", ЭтотОбъект.Ингредиенты.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(ЭтотОбъект);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ВыборкаДетальныеЗаписи.ХарактеристикаЗаполнена Тогда
			Отказ = Истина;
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Ингредиенты", ВыборкаДетальныеЗаписи.НомерСтроки, "Характеристика");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена характеристика ингредиента в строке "+ВыборкаДетальныеЗаписи.НомерСтроки+" таблицы ""Ингредиенты""!",,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ПроверкаСерий
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.питВыпускБлюд);
	СтатусыСерийСерияНеУказана = НоменклатураКлиентСервер.СтатусыСерийСерияНеУказана();
	
	// Товары
	ПараметрыУказанияСерий.Товары.ОтборПроверяемыхСтрок = Новый Массив;
	Для каждого ТекПроверяемаяСтрока Из ЭтотОбъект.Товары Цикл
		//>> Швецов. ERP-5431. 30.09.25. Проверка при проведениия на указание серии для алко
		//Если СтатусыСерийСерияНеУказана.Найти(ТекПроверяемаяСтрока.СтатусУказанияСерий) = Неопределено Тогда
		Если СтатусыСерийСерияНеУказана.Найти(ТекПроверяемаяСтрока.СтатусУказанияСерий) <> Неопределено Тогда
		//<<
			ПараметрыУказанияСерий.Товары.ОтборПроверяемыхСтрок.Добавить(ТекПроверяемаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	// ПобочныеИзделия
	ПараметрыУказанияСерий.ПобочныеИзделия.ОтборПроверяемыхСтрок = Новый Массив;
	Для каждого ТекПроверяемаяСтрока Из ЭтотОбъект.ПобочныеИзделия Цикл
		Если СтатусыСерийСерияНеУказана.Найти(ТекПроверяемаяСтрока.СтатусУказанияСерий) = Неопределено Тогда
			ПараметрыУказанияСерий.ПобочныеИзделия.ОтборПроверяемыхСтрок.Добавить(ТекПроверяемаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	// Блюда
	ПараметрыУказанияСерий.Блюда.ОтборПроверяемыхСтрок = Новый Массив;
	Для каждого ТекПроверяемаяСтрока Из ЭтотОбъект.Блюда Цикл
		Если СтатусыСерийСерияНеУказана.Найти(ТекПроверяемаяСтрока.СтатусУказанияСерий) = Неопределено Тогда
			ПараметрыУказанияСерий.Блюда.ОтборПроверяемыхСтрок.Добавить(ТекПроверяемаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	// Модификаторы
	ПараметрыУказанияСерий.Модификаторы.ОтборПроверяемыхСтрок = Новый Массив;
	Для каждого ТекПроверяемаяСтрока Из ЭтотОбъект.Модификаторы Цикл
		Если СтатусыСерийСерияНеУказана.Найти(ТекПроверяемаяСтрока.СтатусУказанияСерий) = Неопределено Тогда
			ПараметрыУказанияСерий.Модификаторы.ОтборПроверяемыхСтрок.Добавить(ТекПроверяемаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект, ПараметрыУказанияСерий.Товары, Отказ, МассивНепроверяемыхРеквизитов);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект, ПараметрыУказанияСерий.ПобочныеИзделия, Отказ, МассивНепроверяемыхРеквизитов);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект, ПараметрыУказанияСерий.Блюда, Отказ, МассивНепроверяемыхРеквизитов);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект, ПараметрыУказанияСерий.Модификаторы, Отказ, МассивНепроверяемыхРеквизитов);
	
	#КонецОбласти
	
	//+Бизнес ланчи
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЧТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТЧТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТЧТовары.НомерСтроки
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&ТЧТовары КАК ТЧТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧМодификаторы.Номенклатура КАК Номенклатура,
	|	ТЧМодификаторы.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТМодификаторы
	|ИЗ
	|	&ТЧМодификаторы КАК ТЧМодификаторы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Номенклатура КАК Номенклатура,
	|	ВТТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВТТовары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТБизнесЛанчи
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|ГДЕ
	|	ВТТовары.Номенклатура.питВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.питВидыНоменклатуры.БизнесЛанч)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБизнесЛанчи.Номенклатура КАК Номенклатура,
	|	ВТМодификаторы.Номенклатура КАК НоменклатураМодификатора,
	|	ВТБизнесЛанчи.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТБизнесЛанчи КАК ВТБизнесЛанчи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМодификаторы КАК ВТМодификаторы
	|		ПО ВТБизнесЛанчи.ИдентификаторСтроки = ВТМодификаторы.ИдентификаторСтроки
	|ГДЕ
	|	ВТМодификаторы.Номенклатура ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ТЧТовары", ЭтотОбъект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ТЧМодификаторы", ЭтотОбъект.Модификаторы.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(ЭтотОбъект);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", ВыборкаДетальныеЗаписи.НомерСтроки, "Номенклатура");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены модификаторы бизнес ланча в строке "+ВыборкаДетальныеЗаписи.НомерСтроки+" таблицы ""Товары""!",ЭтотОбъект,Поле,"Объект",Отказ);
	КонецЦикла;
	//-Бизнес ланчи
	
	Если НЕ Трудозатраты.Количество() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИсполнительТрудозатрат");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура СообщитьОНекорректномЗначенииТаблицыОплата(НомерСтроки, ИмяПоля, ЗначениеПоля, ТекстОшибки, Отказ)
	
	ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
		ЗначениеПоля, НомерСтроки, НСтр("ru = 'Оплата'"), ТекстОшибки);
	
	Поле = "Оплата[" + Формат(НомерСтроки - 1, "ЧН=0; ЧГ=") + "]." + ИмяПоля;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	
КонецПроцедуры

Процедура ЗаполнитьПроизводства(ОтключитьДополнительныеПроверки)
	
	//+АвтовыборНоменклатуры
	МассивДеревьевСостава = Новый Массив;
	//+АвтовыборНоменклатуры
	
	ТаблицаПроизводства = питПроизводство.ЗаполнитьПроизводственныеТаблицыПоРецептуре(ЭтотОбъект, Истина, ,ОтключитьДополнительныеПроверки, МассивДеревьевСостава, УточненияАвтовыбора);
	
	//+АвтовыборНоменклатуры
	питУправлениеДаннымиОбИзделиях.ЗаполнитьУточненияАвтовыбора(МассивДеревьевСостава, УточненияАвтовыбора);
	Если питУправлениеДаннымиОбИзделиях.ЗаполнитьНайденыОшибкиАвтовыбора(УточненияАвтовыбора) Тогда
		ОбщегоНазначения.СообщитьПользователю("Найдены неуточненные характеристики в таблице производства!");
	КонецЕсли;
	//+АвтовыборНоменклатуры
	
	//+РазрешенныеПодразделения
	Товары.Загрузить(питПроизводство.УстановитьЗапрещенныеТовары(ТаблицаПроизводства, Товары.Выгрузить()));
	//-РазрешенныеПодразделения
	
	ТаблицаПроизводства.Колонки.Добавить("ФактЗамены", новый ОписаниеТипов("Число"));
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	
	ЭтотОбъект.Замены.Очистить();
	СтруктураПараметров = Новый Структура("МоментВремени, СчитатьФактВТаблицеЗамен, Склад, Организация, Подразделение, РежимИспользованияАналогов, ОрганизацияПрименяетУСН");
	СтруктураПараметров.МоментВремени  = питПроизводство.ПолучитьМоментВремениКонтроляОстатковВыпуска(ЭтотОбъект);
	СтруктураПараметров.СчитатьФактВТаблицеЗамен = Ложь;
	СтруктураПараметров.Склад = ЭтотОбъект.Склад;
	СтруктураПараметров.Организация = ЭтотОбъект.Организация;
	СтруктураПараметров.Подразделение = ЭтотОбъект.Подразделение;
	СтруктураПараметров.РежимИспользованияАналогов = ЭтотОбъект.РежимИспользованияАналогов;
	СтруктураПараметров.ОрганизацияПрименяетУСН = Ложь;////ОбщептЕРП!!!
	СтруктураПараметров.Вставить("СсылкаНаДокумент", ?(ЭтотОбъект.Ссылка.Пустая(), Неопределено, ЭтотОбъект.Ссылка));
	СтруктураПараметров.Вставить("ВидПроизводства", ЭтотОбъект.ВидПроизводства);
	
	питПроизводство.ЗаполнитьПроизводственныеТаблицыФактическимКоличеством(ТаблицаПроизводства,ЭтотОбъект.Замены , СтруктураПараметров);
	
	Если НЕ ЭтотОбъект.РазрешитьНедовложения Тогда
		// Остаточную нехватку пишем в КоличествоФакт, и заполняем колонку ФактЗамены
		питПроизводство.ЗаписатьОстаточныеНехваткиВКоличествоФакт(ТаблицаПроизводства, ЭтотОбъект.Замены);
	Иначе
		// Рассчитываем только колонку ФактЗамены
		питПроизводство.ЗаписатьВТаблицуПроизводствоФактЗанены(ТаблицаПроизводства, ЭтотОбъект.Замены);
		
		питПроизводство.ОбнулитьФактическоеКоличествоПеределовПоСоставу(ТаблицаПроизводства);
		
	КонецЕсли;
	
	// Заполняем таблицу производства
	Если ТаблицаПроизводства <> Неопределено Тогда
		
		ЭтотОбъект.Блюда.Очистить();
		ЭтотОбъект.Ингредиенты.Очистить();

		ТаблицаПроизводства.Колонки.ЕдиницаИзмеренияНоменклатуры.Имя = "УпаковкаНоменклатуры";
		ТаблицаПроизводства.Колонки.ЕдиницаИзмеренияИнгредиента.Имя  = "УпаковкаИнгредиента";
		
		ТаблБлюд = ТаблицаПроизводства.Скопировать(,"Номенклатура,Характеристика,Серия,Назначение,УпаковкаНоменклатуры,Рецептура,Автопередел,КоличествоНоменклатуры,КоличествоУпаковокНоменклатуры, Порядок");
		ТаблБлюд.Свернуть("Номенклатура,Характеристика,Рецептура,Серия,Назначение,УпаковкаНоменклатуры,Автопередел,КоличествоНоменклатуры, КоличествоУпаковокНоменклатуры, Порядок");
		ТаблБлюд.Колонки.Добавить("ИдентификаторСтроки", ОписаниеТиповСтрока, ,36);
		
		ТаблицаПроизводства.Колонки.Добавить("ИдентификаторБлюда", ОписаниеТиповСтрока, ,36);
		
		
		Для Каждого Стр из ТаблБлюд Цикл
			
			Стр.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			
			МассивСтрокингредиентов = ТаблицаПроизводства.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Серия,Назначение,УпаковкаНоменклатуры,Рецептура,Автопередел",Стр.Номенклатура,Стр.Характеристика,Стр.Серия,Стр.Назначение,Стр.УпаковкаНоменклатуры,Стр.Рецептура, Стр.Автопередел ) );
			
			Для Каждого СтрИнгр из МассивСтрокингредиентов Цикл
				
				НовСтрТаблИнгредиентов = ЭтотОбъект.Ингредиенты.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрТаблИнгредиентов, СтрИнгр);
				НовСтрТаблИнгредиентов.ИдентификаторБлюда = Стр.ИдентификаторСтроки;
				///НовСтрТаблИнгредиентов.Блюдо = Стр.Номенклатура;
				
				НовСтрТаблИнгредиентов.Характеристика = СтрИнгр.ХарактеристикаИнгредиента;
				НовСтрТаблИнгредиентов.Назначение = СтрИнгр.НазначениеИнгредиента;
				НовСтрТаблИнгредиентов.Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
					
			КонецЦикла;
			
		КонецЦикла;
		//ТаблИнгредиентов = ТаблицаПроизводства.Скопировать(,"ИдентификаторБлюда,Ингредиент,УпаковкаИнгредиента,КоличествоИнгредиентаНорма,КоличествоУпаковокИнгредиентаНорма,СезонныйПроцент,КоличествоИнгредиентаФакт,ИзАвтопеределов,РецептураАвтопередела,Специя,ЗапретитьЗамены,Замена,КоэффициентЗамены,СчетУчета,Субконто,СчетЗатрат,ОтражениеВУСН,Порядок");
		ЭтотОбъект.Блюда.Загрузить(ТаблБлюд);
		
		ДополнительныеТаблицыВыпускаПоТаблицеБлюд = питПроизводство.ПолучитьДополнительныеТаблицыВыпускаПоТаблицеБлюд(ТаблБлюд,";0;1;");
		ЭтотОбъект.Трудозатраты.Загрузить(ДополнительныеТаблицыВыпускаПоТаблицеБлюд[0]);
		ЭтотОбъект.ПобочныеИзделия.Загрузить(ДополнительныеТаблицыВыпускаПоТаблицеБлюд[1]);
		
		ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.питВыпускБлюд));
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий["Блюда"]);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий["Ингредиенты"]);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий["Замены"]);
		
	КонецЕсли;
	
	Для каждого ТекСтрокаИнгредиент Из Ингредиенты Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрокаИнгредиент.КоличествоИнгредиентаНорма) И ЗначениеЗаполнено(ТекСтрокаИнгредиент.КоличествоУпаковокИнгредиентаНорма) Тогда
			ТекСтрокаИнгредиент.КоличествоИнгредиентаНорма = ТекСтрокаИнгредиент.КоличествоУпаковокИнгредиентаНорма * питОбщегоНазначения.ПолучитьКоэффициентУпаковки(ТекСтрокаИнгредиент.Ингредиент, ТекСтрокаИнгредиент.УпаковкаИнгредиента);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекСтрокаИнгредиент.КоличествоИнгредиентаФакт) И ЗначениеЗаполнено(ТекСтрокаИнгредиент.КоличествоУпаковокИнгредиентаФакт) Тогда
			ТекСтрокаИнгредиент.КоличествоИнгредиентаФакт = ТекСтрокаИнгредиент.КоличествоУпаковокИнгредиентаФакт * питОбщегоНазначения.ПолучитьКоэффициентУпаковки(ТекСтрокаИнгредиент.Ингредиент, ТекСтрокаИнгредиент.УпаковкаИнгредиента);
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//+ОтложенноеПроведение
	Если НЕ ДополнительныеСвойства.Свойство("питИспользоватьОтложенноеПроведениеВыпускаБлюд") Тогда
		ДополнительныеСвойства.Вставить("питИспользоватьОтложенноеПроведениеВыпускаБлюд", питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("питИспользоватьОтложенноеПроведениеВыпускаБлюд"));
	КонецЕсли;
	Если ДополнительныеСвойства.питИспользоватьОтложенноеПроведениеВыпускаБлюд
		И НЕ ДополнительныеСвойства.Свойство("питВыполнениеДействияОтложенногоПроведения") Тогда
		Возврат;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	//+%ИзЕРП% Набор типовых процедур для обработки проведения документа.
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	//-%ИзЕРП%
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса1 = 
	"ВЫБРАТЬ
	|	питВыпускБлюдБлюда.Номенклатура КАК Блюдо,
	|	питВыпускБлюдБлюда.Характеристика КАК Характеристика,
	|	питВыпускБлюдИнгредиенты.Ингредиент КАК Ингредиент,
	|	питВыпускБлюдИнгредиенты.Характеристика КАК ХарактеристикаИнгредиента,
	|	ВЫБОР
	|		КОГДА питВыпускБлюдИнгредиенты.УпаковкаИнгредиента = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА питВыпускБлюдИнгредиенты.Ингредиент.ЕдиницаИзмерения
	|		ИНАЧЕ питВыпускБлюдИнгредиенты.УпаковкаИнгредиента
	|	КОНЕЦ КАК УпаковкаИнгредиента,
	|	питВыпускБлюдБлюда.Ссылка.Дата КАК Период,
	|	питВыпускБлюдБлюда.Ссылка.Склад КАК Склад,
	|	питВыпускБлюдБлюда.Ссылка.Организация КАК Организация,
	|	питВыпускБлюдБлюда.Рецептура,
	|	питВыпускБлюдБлюда.Ссылка.Подразделение КАК Подразделение,
	|	питВыпускБлюдБлюда.КоличествоНоменклатуры КАК КоличествоБлюда,
	|	питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт КАК КоличествоИнгредиента,
	|	питВыпускБлюдИнгредиенты.КоличествоИнгредиентаНорма - питВыпускБлюдИнгредиенты.КоличествоИнгредиентаФакт КАК КоличествоНедовложения,
	|	питВыпускБлюдИнгредиенты.КоличествоУпаковокИнгредиентаФакт КАК КоличествоУпаковокИнгредиента,
	|	питВыпускБлюдИнгредиенты.Ингредиент.питВидНоменклатуры КАК ИнгредиентВидНоменклатуры,
	|	питВыпускБлюдИнгредиенты.КоличествоИнгредиентаНорма КАК КоличествоИнгредиентаНорма,
	|	питВыпускБлюдБлюда.Автопередел,
	|	питВыпускБлюдИнгредиенты.ИзАвтопеределов
	|ПОМЕСТИТЬ ВТ_ПроизводствоИнгр
	|ИЗ
	|	Документ.питВыпускБлюд.Блюда КАК питВыпускБлюдБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд.Ингредиенты КАК питВыпускБлюдИнгредиенты
	|		ПО питВыпускБлюдБлюда.ИдентификаторСтроки = питВыпускБлюдИнгредиенты.ИдентификаторБлюда
	|ГДЕ
	|	питВыпускБлюдБлюда.Ссылка = &Ссылка
	|	И питВыпускБлюдИнгредиенты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПроизводствоИнгр.Блюдо КАК Блюдо,
	|	ВТ_ПроизводствоИнгр.Характеристика КАК Характеристика,
	|	ВТ_ПроизводствоИнгр.Ингредиент,
	|	ВТ_ПроизводствоИнгр.ХарактеристикаИнгредиента,
	|	ВТ_ПроизводствоИнгр.УпаковкаИнгредиента,
	|	ВТ_ПроизводствоИнгр.Период,
	|	ВТ_ПроизводствоИнгр.Склад,
	|	ВТ_ПроизводствоИнгр.Организация,
	|	ВТ_ПроизводствоИнгр.Рецептура,
	|	ВТ_ПроизводствоИнгр.Подразделение,
	|	ВТ_ПроизводствоИнгр.КоличествоБлюда,
	|	ВТ_ПроизводствоИнгр.КоличествоИнгредиента,
	|	ВТ_ПроизводствоИнгр.ИнгредиентВидНоменклатуры,
	|	ВТ_ПроизводствоИнгр.Автопередел,
	|	ВТ_ПроизводствоИнгр.ИзАвтопеределов,
	|	питВыпускБлюдЗамены.ИнгредиентЗамена,
	|	питВыпускБлюдЗамены.ХарактеристикаИнгредиентаЗамена,
	|	ЕСТЬNULL(питВыпускБлюдЗамены.КоличествоИнгредиентаЗамена, 0) КАК КоличествоИнгредиентаЗамена,
	|	ЕСТЬNULL(питВыпускБлюдЗамены.КоличествоИнгредиентаИсходный, 0) КАК КоличествоИнгредиентаИсходный,
	|	ЕСТЬNULL(питВыпускБлюдЗамены.КоличествоУпаковокИнгредиентаЗамена, 0) КАК КоличествоУпаковокИнгредиентаЗамена,
	|	ВЫБОР
	|		КОГДА питВыпускБлюдЗамены.УпаковкаИнгредиентаЗамена = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА питВыпускБлюдЗамены.ИнгредиентЗамена.ЕдиницаИзмерения
	|		ИНАЧЕ питВыпускБлюдЗамены.УпаковкаИнгредиентаЗамена
	|	КОНЕЦ КАК УпаковкаИнгредиентаЗамена,
	|	питВыпускБлюдЗамены.ИнгредиентЗамена.питВидНоменклатуры КАК ЗаменаВидНоменклатуры
	|ПОМЕСТИТЬ ВТ_ПроизводствоЗамены
	|ИЗ
	|	ВТ_ПроизводствоИнгр КАК ВТ_ПроизводствоИнгр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.питВыпускБлюд.Замены КАК питВыпускБлюдЗамены
	|		ПО ВТ_ПроизводствоИнгр.Блюдо = питВыпускБлюдЗамены.Блюдо
	|			И ВТ_ПроизводствоИнгр.Характеристика = питВыпускБлюдЗамены.ХарактеристикаБлюда
	|			И ВТ_ПроизводствоИнгр.Ингредиент = питВыпускБлюдЗамены.ИнгредиентИсходный
	|			И ВТ_ПроизводствоИнгр.ХарактеристикаИнгредиента = питВыпускБлюдЗамены.ХарактеристикаИнгредиентаИсходного
	|			И ВТ_ПроизводствоИнгр.Рецептура = питВыпускБлюдЗамены.Рецептура
	|ГДЕ
	|	питВыпускБлюдЗамены.Ссылка = &Ссылка
	|";
	ТекстЗапроса2 = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПроизводствоИнгр.Блюдо КАК Блюдо,
	|	ВТ_ПроизводствоИнгр.Характеристика КАК Характеристика,
	|	ВТ_ПроизводствоИнгр.Ингредиент,
	|	ВТ_ПроизводствоИнгр.ХарактеристикаИнгредиента,
	|	ВТ_ПроизводствоИнгр.УпаковкаИнгредиента,
	|	ВТ_ПроизводствоИнгр.Период,
	|	ВТ_ПроизводствоИнгр.Склад,
	|	ВТ_ПроизводствоИнгр.Организация,
	|	ВТ_ПроизводствоИнгр.Рецептура,
	|	ВТ_ПроизводствоИнгр.Подразделение,
	|	ВТ_ПроизводствоИнгр.КоличествоБлюда,
	|	ВТ_ПроизводствоИнгр.КоличествоИнгредиента,
	|	ВТ_ПроизводствоИнгр.КоличествоИнгредиентаНорма КАК КоличествоИнгредиентаНорма,
	|	ВТ_ПроизводствоИнгр.ИнгредиентВидНоменклатуры,
	|	ВТ_ПроизводствоИнгр.Автопередел,
	|	ВТ_ПроизводствоИнгр.ИзАвтопеределов,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК ИнгредиентИсходный,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) ХарактеристикаИнгредиентаИсходного,
	|	0 КАК КоличествоИнгредиентаИсходного,
	|	ВТ_ПроизводствоИнгр.КоличествоНедовложения КАК КоличествоНедовложения,
	|	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК К1,
	|	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК К2,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ВТ_ПроизводствоИнгр.КоличествоУпаковокИнгредиента * ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	|						ТОГДА КурсыВалютыЦены.Курс * КурсыВалюты.Кратность / (КурсыВалюты.Курс * КурсыВалютыЦены.Кратность)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	ВТ_ПроизводствоИнгр КАК ВТ_ПроизводствоИнгр
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныНоменклатуры КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВТ_ПроизводствоИнгр.Ингредиент = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ВТ_ПроизводствоИнгр.ХарактеристикаИнгредиента = ЦеныНоменклатурыСрезПоследних.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, ) КАК КурсыВалютыЦены
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, Валюта = &Валюта) КАК КурсыВалюты
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПроизводствоЗамены.Блюдо,
	|	ВТ_ПроизводствоЗамены.Характеристика,
	|	ВТ_ПроизводствоЗамены.ИнгредиентЗамена,
	|	ВТ_ПроизводствоЗамены.ХарактеристикаИнгредиентаЗамена,
	|	ВТ_ПроизводствоЗамены.УпаковкаИнгредиентаЗамена,
	|	ВТ_ПроизводствоЗамены.Период,
	|	ВТ_ПроизводствоЗамены.Склад,
	|	ВТ_ПроизводствоЗамены.Организация,
	|	ВТ_ПроизводствоЗамены.Рецептура,
	|	ВТ_ПроизводствоЗамены.Подразделение,
	|	ВТ_ПроизводствоЗамены.КоличествоБлюда,
	|	ВТ_ПроизводствоЗамены.КоличествоИнгредиентаЗамена,
	|	0,
	|	ВТ_ПроизводствоЗамены.ЗаменаВидНоменклатуры,
	|	ВТ_ПроизводствоЗамены.Автопередел,
	|	ВТ_ПроизводствоЗамены.ИзАвтопеределов,
	|	ВТ_ПроизводствоЗамены.Ингредиент,
	|	ВТ_ПроизводствоЗамены.ХарактеристикаИнгредиента,
	|	ВТ_ПроизводствоЗамены.КоличествоИнгредиентаИсходный,
	|	0,
	|	0,
	|	0,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ВТ_ПроизводствоЗамены.КоличествоУпаковокИнгредиентаЗамена * ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	|						ТОГДА КурсыВалютыЦены.Курс * КурсыВалюты.Кратность / (КурсыВалюты.Курс * КурсыВалютыЦены.Кратность)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_ПроизводствоЗамены КАК ВТ_ПроизводствоЗамены
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныНоменклатуры КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВТ_ПроизводствоЗамены.ИнгредиентЗамена = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ВТ_ПроизводствоЗамены.ХарактеристикаИнгредиентаЗамена = ЦеныНоменклатурыСрезПоследних.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, ) КАК КурсыВалютыЦены
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, Валюта = &Валюта) КАК КурсыВалюты
	|		ПО (ИСТИНА)";
	
	
	// +пит
	ТекстЗапросаШаблон = 
		"%1
		|;
		|%2
		|;
		|%3";
	ТекстЦеныКомплексныйОтбор = 
		питЦеныНоменклатуры.ПреобразоватьТекстКомплексногоОтбора(Дата, "(Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							ВТ_ПроизводствоИнгр.Ингредиент,
		|							ВТ_ПроизводствоИнгр.ХарактеристикаИнгредиента
		|						ИЗ
		|							ВТ_ПроизводствоИнгр КАК ВТ_ПроизводствоИнгр
		|						ОБЪЕДИНИТЬ ВСЕ
		|						ВЫБРАТЬ
		|							ВТ_ПроизводствоЗамены.ИнгредиентЗамена,
		|							ВТ_ПроизводствоЗамены.ХарактеристикаИнгредиентаЗамена
		|						ИЗ
		|							ВТ_ПроизводствоЗамены КАК ВТ_ПроизводствоЗамены)");
	ТекстЗапросаЦены = питЦеныНоменклатуры.ТекстЗапросаЦеныНоменклатуры(Дата, 
		"втЦеныНоменклатуры", "НаДату", "", "", "ВидЦен", ТекстЦеныКомплексныйОтбор);
	ТекстЗапроса2 = СтрЗаменить(ТекстЗапроса2,
		"ВТ_ПроизводствоЗамены.ХарактеристикаИнгредиентаЗамена = ЦеныНоменклатурыСрезПоследних.Характеристика",
		питЦеныНоменклатуры.УсловиеСоединенияХарактеристика(Дата, 
			"ВТ_ПроизводствоЗамены", "ХарактеристикаИнгредиентаЗамена", "ЦеныНоменклатурыСрезПоследних"));
	ТекстЗапроса2 = СтрЗаменить(ТекстЗапроса2,
		"ВТ_ПроизводствоИнгр.ХарактеристикаИнгредиента = ЦеныНоменклатурыСрезПоследних.Характеристика",
		питЦеныНоменклатуры.УсловиеСоединенияХарактеристика(Дата, 
			"ВТ_ПроизводствоИнгр", "ХарактеристикаИнгредиента", "ЦеныНоменклатурыСрезПоследних"));
	ТекстЗапроса = СтрШаблон(ТекстЗапросаШаблон, ТекстЗапроса1, ТекстЗапросаЦены, ТекстЗапроса2);
	// -пит
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЦеныНоменклатурыСрезПоследних.Упаковка",
	"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ВТ_ПроизводствоИнгр.УпаковкаИнгредиента",
	"ВТ_ПроизводствоИнгр.Ингредиент"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки3",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ВТ_ПроизводствоЗамены.УпаковкаИнгредиентаЗамена",
	"ВТ_ПроизводствоЗамены.ИнгредиентЗамена"));
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НаДату", МоментВремени());
	Запрос.УстановитьПараметр("ВидЦен", Константы.питНормативнаяЦена.Получить());
	Запрос.УстановитьПараметр("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Запрос.Текст = ТекстЗапроса;	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.питПроизводство.Записывать = Истина;
	ДвиженияПроизводство = Движения.питПроизводство;
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = ДвиженияПроизводство.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		
		Если Выборка.ИнгредиентВидНоменклатуры = Перечисления.питВидыНоменклатуры.Товар Или НЕ ЗначениеЗаполнено(Выборка.ИнгредиентВидНоменклатуры) Тогда
			Если Выборка.Автопередел И НЕ Выборка.ИзАвтопеределов Тогда 
				НоваяЗапись.ВидПроизводственногоДвижения = Перечисления.питВидыПроизводственногоДвижения.ТоварВЗаготовке
			ИначеЕсли НЕ Выборка.Автопередел И НЕ Выборка.ИзАвтопеределов Тогда 
				НоваяЗапись.ВидПроизводственногоДвижения = Перечисления.питВидыПроизводственногоДвижения.ТоварВБлюде
			КонецЕсли
		ИначеЕсли Выборка.ИнгредиентВидНоменклатуры = Перечисления.питВидыНоменклатуры.Блюдо Тогда
			Если Выборка.Автопередел И НЕ Выборка.ИзАвтопеределов Тогда 
				НоваяЗапись.ВидПроизводственногоДвижения = Перечисления.питВидыПроизводственногоДвижения.ЗаготовкаВЗаготовке
			ИначеЕсли НЕ Выборка.Автопередел И НЕ Выборка.ИзАвтопеределов Тогда 
				НоваяЗапись.ВидПроизводственногоДвижения = Перечисления.питВидыПроизводственногоДвижения.ЗаготовкаВБлюде
			ИначеЕсли Выборка.Автопередел И Выборка.ИзАвтопеределов Тогда 
				НоваяЗапись.ВидПроизводственногоДвижения = Перечисления.питВидыПроизводственногоДвижения.ЗаготовкаВЗаготовкеАвтопередел
			ИначеЕсли НЕ Выборка.Автопередел И Выборка.ИзАвтопеределов Тогда 
				НоваяЗапись.ВидПроизводственногоДвижения = Перечисления.питВидыПроизводственногоДвижения.ЗаготовкаВБлюдеАвтопередел
			КонецЕсли
		ИначеЕсли Выборка.ИнгредиентВидНоменклатуры = Перечисления.питВидыНоменклатуры.ТехнологическийИнгредиент Тогда // Технический ингредиент
			Если Выборка.Автопередел И НЕ Выборка.ИзАвтопеределов Тогда 
				НоваяЗапись.ВидПроизводственногоДвижения = Перечисления.питВидыПроизводственногоДвижения.ТехнологическийОтходВЗаготовке
			ИначеЕсли НЕ Выборка.Автопередел И НЕ Выборка.ИзАвтопеределов Тогда 
				НоваяЗапись.ВидПроизводственногоДвижения = Перечисления.питВидыПроизводственногоДвижения.ТехнологическийОтходВБлюде
			КонецЕсли
		КонецЕсли;
		
	КонецЦикла;
	
	// Сбросим в БезИзменения реквизит ОбщепитСпособРасчетаЦеныРеализацииПродукции,
	// если настройка НеИзменятьРанееРассчитаннуюЦенуТоваровИБлюд установлена в Истина
	текРежимРасчетаСписанияВПроизводство = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("РежимРасчетаСписанияВПроизводство");
	текНеИзменятьРежимСписанияВПроизводство = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("НеИзменятьРежимСписанияВПроизводствоПоНастройке");
	
	Если НЕ текНеИзменятьРежимСписанияВПроизводство Тогда ///***--- И НЕ СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации()
		Если НЕ ЗначениеЗаполнено(текРежимРасчетаСписанияВПроизводство) Тогда
			// Заменим режим проведения на "По Факту", для того, чтобы при дальнейших регламентных проведениях
			// всегда гарантированно получать один и тот же результат.
			РежимРасчетаСписанияВПроизводство = Перечисления.питРежимыРасчетаСписанияВПроизводство.ПоФакту;
		Иначе
			РежимРасчетаСписанияВПроизводство = текРежимРасчетаСписанияВПроизводство;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимРасчетаСписанияВПроизводство = Перечисления.питРежимыРасчетаСписанияВПроизводство.ПоФакту И НЕ РазрешитьНедовложения = Ложь Тогда
		РазрешитьНедовложения = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ДокументОснование = Неопределено;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
	//+ОтложенноеПроведение
	Если ДополнительныеСвойства.Свойство("питИспользоватьОтложенноеПроведениеВыпускаБлюд") Тогда
		питТекущийПриоритетДействияОтложенногоПроведения = 0;
		Если ДополнительныеСвойства.питИспользоватьОтложенноеПроведениеВыпускаБлюд
			И НЕ ДополнительныеСвойства.Свойство("питВыполнениеДействияОтложенногоПроведения") Тогда
			
			ТекстОшибки = "";
			
			Отказ = НЕ питТиповыеДокументы.УдалитьДействияОтложенногоПроведенияПоДокументуОбщепит(Ссылка, ТекстОшибки);
			Если Отказ Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Возврат;
			КонецЕсли;
			
			Если ДополнительныеСвойства.СтараяПометкаУдаления = Ложь И ПометкаУдаления = Истина Тогда
				ТекДействие = Перечисления.питДействияОтложенногоПроведения.ПометитьНаУдалениеДокументОбщепит;
			ИначеЕсли ДополнительныеСвойства.СтараяПометкаУдаления = Истина И ПометкаУдаления = Ложь Тогда
				ТекДействие = Перечисления.питДействияОтложенногоПроведения.СнятьПометкуУдаленияДокументОбщепит;
			Иначе
				ТекДействие = питТиповыеДокументы.ПолучитьТекущееДействиеПоРежимузаписиДокументаОбщепит(ДополнительныеСвойства.РежимЗаписи);
			КонецЕсли;
			Отказ = НЕ питТиповыеДокументы.ДобавитьДействиеОтложенногоПроведения(Ссылка, ТекДействие, Неопределено, 0,ТекстОшибки);
			
			Если Отказ Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//-ОтложенноеПроведение
	
	Если НЕ Отказ Тогда
		питЦентрМониторинга.ЗаписатьОперацииБизнесСтатистики(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Функция МассивОднотипный(МассивДляПроверки)
	
	Результат = Истина;
	Счетчик = 0;
	ТекущийТип = Неопределено;
	Для каждого ЭлементМассива Из МассивДляПроверки Цикл
		Если Счетчик = 0 Тогда
			ТекущийТип = ТипЗнч(ЭлементМассива);
			Продолжить;
		КонецЕсли;
		Если НЕ ТекущийТип = ТипЗнч(ЭлементМассива) Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

времФункциональнаяОпцияВозвратнаяТара = Ложь;
