#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//<< Портал-Юг Баринов 2019.02.26 [6.2.13 Регистр сведений «Соответствие с Front-системами»]
// Номенклатура в регистре используется без характеристики, т.к. документ "питДанныеПродажФронта" не поддерживает характеристики (релиз 2.4.6.174). Регистр нужен для заполнения этого документа.
//>> Портал-Юг Баринов 2019.02.26
	
#Область ОбработчикиСобытий

//<< Портал-Юг Баринов 2019.02.26 [6.2.13 Регистр сведений «Соответствие с Front-системами»]
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Количество должно быть заполнено, если заполнен объект и установлен соответствующий флаг в типе объекта.
	СтрокиСПустымКоличеством = Новый Массив;
	ТипыОбъектов = Новый Массив;
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Объект) И ЗначениеЗаполнено(Запись.ТипОбъекта) И Не ЗначениеЗаполнено(Запись.Количество) Тогда 
			СтрокиСПустымКоличеством.Добавить(Запись);
			ТипыОбъектов.Добавить(Запись.ТипОбъекта);
		КонецЕсли;	
	КонецЦикла; 
		
	Если СтрокиСПустымКоличеством.Количество() Тогда 
		
		ШаблонСообщения = НСтр("ru='Поле ""%Количество%"" не заполнено'");
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Количество%", НСтр("ru = 'Количество'"));
	    		
		УказыватьКоличество = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТипыОбъектов, "УказыватьКоличество");
		Для каждого Запись Из СтрокиСПустымКоличеством Цикл
			Если УказыватьКоличество[Запись.ТипОбъекта] = Истина Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Количество", "Запись", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;			

КонецПроцедуры //>> Портал-Юг Баринов 2019.02.26

//<< Портал-Юг Баринов 2019.02.26 [6.2.13 Регистр сведений «Соответствие с Front-системами»]
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;	
	КонецЕсли;	
	
	Для каждого Запись Из ЭтотОбъект Цикл
	
		Если Не ЗначениеЗаполнено(Запись.Объект) Тогда
			// Для исключения разных значений пустого реквизита. Например, пустых ссылок разных типов
			Запись.Объект = Неопределено;
		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры //>> Портал-Юг Баринов 2019.02.26

#КонецОбласти

#КонецЕсли