

#Область ПеременныеМодуля

#КонецОбласти


#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	питИзменениеОтраслевыхФормСервер.ПриСозданииНаСервереВНачале(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("КассовыйУзел") Тогда
		Объект.КассовыйУзел = Параметры.КассовыйУзел;
	КонецЕсли;
	Если Параметры.Свойство("ДатаНачалаОтбора") Тогда
		Объект.ДатаНачалаОтбора = Параметры.ДатаНачалаОтбора;
	КонецЕсли;
	Если Параметры.Свойство("ДатаКонцаОтбора") Тогда
		Объект.ДатаКонцаОтбора = Параметры.ДатаКонцаОтбора;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ДатаНачалаОтбораПриИзменении(Элемент)
	Если Объект.ДатаНачалаОтбора > '39991231000000' Тогда
		Объект.ДатаНачалаОтбора = '39991231000000';
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя использовать даты более 31.12.3999г.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаОтбораПриИзменении(Элемент)
	Если Объект.ДатаКонцаОтбора > '39991231000000' Тогда
		Объект.ДатаКонцаОтбора = '39991231000000';
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя использовать даты более 31.12.3999г.");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	ИзменитьСостояниеФлагов(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ИзменитьСостояниеФлагов(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	Если Объект.ДатаКонцаОтбора < Объект.ДатаНачалаОтбора Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Введен некорректный период отбора продаж");
		Возврат;
	КонецЕсли;
	//>>Швецов. 11.07.25. ERP-5187. Переопределим метод получения чеков к загрузке
	//ОбновитьСписокНаСервере(); 
	MRS_ОбновитьСписокНаСервере();
	//<<
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ИзменитьСостояниеФлагов(Значение = Истина)
	Для Каждого ТекСтрока Из ДокументыДПФ Цикл
		ТекСтрока.Загружать = Значение;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере(ЭтоУстановкаВозможностиЗагрузки = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументыДПФ.Документ КАК Документ,
	|	ДокументыДПФ.Загружать КАК Загружать
	|ПОМЕСТИТЬ ДокументыДПФпред
	|ИЗ
	|	&ДокументыДПФ КАК ДокументыДПФ
	|;
	|ВЫБРАТЬ
	|	ДокументыДПФ.Документ КАК Документ,
	|	ДокументыДПФ.Загружать КАК Загружать
	|ПОМЕСТИТЬ ДокументыДПФ
	|ИЗ
	|	ДокументыДПФпред КАК ДокументыДПФ
	|ГДЕ
	|	ДокументыДПФ.Загружать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчетДанныхПродаж.ДокументРегистратор КАК Документ,
	|	ЕСТЬNULL(ДокументыДПФ.Загружать, ИСТИНА) КАК Загружать
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК УчетДанныхПродаж
	|		"+?(ЭтоУстановкаВозможностиЗагрузки, "ВНУТРЕННЕЕ", "ЛЕВОЕ")+" СОЕДИНЕНИЕ ДокументыДПФ КАК ДокументыДПФ
	|		ПО УчетДанныхПродаж.ДокументРегистратор = ДокументыДПФ.Документ
	|ГДЕ
	|	УчетДанныхПродаж.ОбновленПриемник";
	Запрос.УстановитьПараметр("ДокументыДПФ", ДокументыДПФ.Выгрузить());
	Если ЗначениеЗаполнено(Объект.ДатаНачалаОтбора) Тогда
		Запрос.УстановитьПараметр("ДатаНачалаОтбора",Объект.ДатаНачалаОтбора);
		Запрос.Текст = Запрос.Текст + " И УчетДанныхПродаж.ДокументРегистратор.Дата >= &ДатаНачалаОтбора ";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДатаКонцаОтбора) Тогда
		Запрос.УстановитьПараметр("ДатаКонцаОтбора",КонецДня(Объект.ДатаКонцаОтбора));
		Запрос.Текст = Запрос.Текст + " И УчетДанныхПродаж.ДокументРегистратор.Дата <= &ДатаКонцаОтбора ";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Запрос.УстановитьПараметр("Организация",Объект.Организация);
		Запрос.Текст = Запрос.Текст + " И УчетДанныхПродаж.ДокументРегистратор.Организация = &Организация ";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.КассовыйУзел) Тогда
		Запрос.УстановитьПараметр("КассовыйУзел",Объект.КассовыйУзел);
		Запрос.Текст = Запрос.Текст + " И УчетДанныхПродаж.ДокументРегистратор.КассаККМ.питКассовыйУзел = &КассовыйУзел ";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаСмены) Тогда
		Запрос.УстановитьПараметр("ДатаСмены",ДатаСмены);
		Запрос.Текст = Запрос.Текст + " И УчетДанныхПродаж.ДокументРегистратор.ДатаСмены = &ДатаСмены ";
	КонецЕсли;
	
	ДокументыДПФ.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДокументыДПФ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

//>>Швецов. 11.07.25. ERP-5187. Переопределим метод получения чеков к загрузке
//Добавим получение возвратов из списка документов, потому что из-за вычитания из продаж не обновляется запись в регистре 
&НаСервере
Процедура MRS_ОбновитьСписокНаСервере(ЭтоУстановкаВозможностиЗагрузки = Ложь)
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументыДПФ.Документ КАК Документ,
	|	ДокументыДПФ.Загружать КАК Загружать
	|ПОМЕСТИТЬ ДокументыДПФпред
	|ИЗ
	|	&ДокументыДПФ КАК ДокументыДПФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДПФ.Документ КАК Документ,
	|	ДокументыДПФ.Загружать КАК Загружать
	|ПОМЕСТИТЬ ДокументыДПФ
	|ИЗ
	|	ДокументыДПФпред КАК ДокументыДПФ
	|ГДЕ
	|	ДокументыДПФ.Загружать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчетДанныхПродаж.ДокументРегистратор КАК Документ,
	|	ЕСТЬNULL(ДокументыДПФ.Загружать, ИСТИНА) КАК Загружать
	|ПОМЕСТИТЬ ВТ_ДанныеРегистра
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК УчетДанныхПродаж
	|		" + ?(ЭтоУстановкаВозможностиЗагрузки, "ВНУТРЕННЕЕ", "ЛЕВОЕ") + " СОЕДИНЕНИЕ ДокументыДПФ КАК ДокументыДПФ
	|		ПО УчетДанныхПродаж.ДокументРегистратор = ДокументыДПФ.Документ
	|ГДЕ
	|	УчетДанныхПродаж.ОбновленПриемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	питДанныеПродажФронта.Ссылка КАК Документ,
	|	ИСТИНА КАК Загружать
	|ПОМЕСТИТЬ ВТ_ВозвратыДокументы
	|ИЗ
	|	Документ.питДанныеПродажФронта КАК питДанныеПродажФронта
	|ГДЕ
	|	питДанныеПродажФронта.ВидОперации = ЗНАЧЕНИЕ(Перечисление.питХозяйственныеОперации.ДанныеПродажФронтаВозврат)
	|	И НЕ питДанныеПродажФронта.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеРегистра.Документ КАК Документ,
	|	ВТ_ДанныеРегистра.Загружать КАК Загружать
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ВозвратыДокументы.Документ,
	|	ВТ_ВозвратыДокументы.Загружать
	|ИЗ
	|	ВТ_ВозвратыДокументы КАК ВТ_ВозвратыДокументы
	|ГДЕ
	|	НЕ ВТ_ВозвратыДокументы.Документ В
	|				(ВЫБРАТЬ
	|					ВТ_ДанныеРегистра.Документ
	|				ИЗ
	|					ВТ_ДанныеРегистра)";
	
	// Создание схемы запроса на основе текста
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	// Добавление условий через схему запроса
	Если ЗначениеЗаполнено(Объект.ДатаНачалаОтбора) Тогда
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("УчетДанныхПродаж.ДокументРегистратор.Дата >= &ДатаНачалаОтбора");
		СхемаЗапроса.ПакетЗапросов[3].Операторы[0].Отбор.Добавить("питДанныеПродажФронта.Дата >= &ДатаНачалаОтбора");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаКонцаОтбора) Тогда
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("УчетДанныхПродаж.ДокументРегистратор.Дата <= &ДатаКонцаОтбора");
		СхемаЗапроса.ПакетЗапросов[3].Операторы[0].Отбор.Добавить("питДанныеПродажФронта.Дата <= &ДатаКонцаОтбора");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("УчетДанныхПродаж.ДокументРегистратор.Организация = &Организация");
		СхемаЗапроса.ПакетЗапросов[3].Операторы[0].Отбор.Добавить("питДанныеПродажФронта.Организация = &Организация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КассовыйУзел) Тогда
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("УчетДанныхПродаж.ДокументРегистратор.КассаККМ.питКассовыйУзел = &КассовыйУзел");
		СхемаЗапроса.ПакетЗапросов[3].Операторы[0].Отбор.Добавить("питДанныеПродажФронта.КассаККМ.питКассовыйУзел = &КассовыйУзел");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаСмены) Тогда
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("УчетДанныхПродаж.ДокументРегистратор.ДатаСмены = &ДатаСмены");
	КонецЕсли;
	
	// Установка параметров и выполнение запроса
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("ДокументыДПФ", ДокументыДПФ.Выгрузить());
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаОтбора) Тогда
		Запрос.УстановитьПараметр("ДатаНачалаОтбора", Объект.ДатаНачалаОтбора);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаКонцаОтбора) Тогда
		Запрос.УстановитьПараметр("ДатаКонцаОтбора", КонецДня(Объект.ДатаКонцаОтбора));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КассовыйУзел) Тогда
		Запрос.УстановитьПараметр("КассовыйУзел", Объект.КассовыйУзел);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаСмены) Тогда
		Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	КонецЕсли;
	
	// Выполнение запроса и заполнение таблицы
	ДокументыДПФ.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДокументыДПФ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВозможностьЗагрузкиНаСервере()
	Если ДокументыДПФ.Количество() = 0 Тогда
		//>>Швецов. 11.07.25. ERP-5187. Переопределим метод получения чеков к загрузке
		//ОбновитьСписокНаСервере(Истина); 
		MRS_ОбновитьСписокНаСервере(Истина);
		//<<
	КонецЕсли;
	
	КоличествоЗаписей = ДокументыДПФ.Количество();
	Сч = 0;
	Для Каждого СтрокаДокумента Из ДокументыДПФ Цикл
			
		Сч = Сч + 1;
		Если НЕ ЗначениеЗаполнено(СтрокаДокумента.Документ) Или НЕ СтрокаДокумента.Загружать Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = СтрокаДокумента.Документ.ПолучитьОбъект();
		ПОпытка
			ДокументОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось изменить возможность загрузки для " + ДокументОбъект + ". Проверьте корректность введенных данных.")
		КонецПопытки;
	КонецЦикла;
	
	//>>Швецов. 11.07.25. ERP-5187. Переопределим метод получения чеков к загрузке
	//ОбновитьСписокНаСервере(); 
	MRS_ОбновитьСписокНаСервере();
	//<<
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВозможностьЗагрузки(Команда)
	УстановитьВозможностьЗагрузкиНаСервере();
КонецПроцедуры

#КонецОбласти
